{
    "address": "Chemistry Department, University of California, Santa Barbara,\nCA 93106}\n\n\\date{Scheduled to publish in PRB Jan. 15, 2000 issue}\n\\maketitle\n\\begin{abstract}\nWe study the kinetics of spin coherence of optically excited\nelectrons in an undoped insulating ZnSe/Zn$_{1-x}$Cd$_x$Se quantum well\nunder moderate magnetic fields\nin the Voigt configuration. After clarifying the optical coherence and the\nspin coherence, we build the kinetic Bloch equations and\ncalculate dephasing and relaxation kinetics\nof laser pulse excited plasma due to statically\nscreened Coulomb scattering and electron hole spin exchange.\nWe find that the Coulomb scattering can not cause the spin dephasing,\nand that the electron-hole spin exchange is the main mechanism of the spin\ndecoherence. Moreover the beat frequency in the Faraday rotation\nangle is determined mainly by the Zeeman splitting, red shifted by the\nCoulomb scattering and the electron hole spin exchange.\nOur numerical results are in agreement\nwith experiment findings. A possible scenario for the contribution\nof electron-hole spin exchange to the spin dephasing of the $n$-doped\nmaterial is also proposed.\n\\end{abstract}\n\\pacs{PACS: 42.50.Md, 42.65.Re, 42.50.-p, 75.10.Jm, 78.47.+p, 78.66.Hf,\n42.79.Ta}\n\n\\begin{multicols}{2}\n\\narrowtext\n\n\\section{Introduction}\nStudies of ultrafast nonlinear optical spectroscopy in semiconductors\nhave attracted numerous interest both experimentally and theoretically\nduring the past 20 years.\\cite{proce,shah,ufpxi} Most of these studies\nare focused on the optical coherence and the studies of spin coherence are\nrelatively rare. Recently, ultrafast nonlinear optical\nexperiments\\cite{dam,wagner,baum,herb,buss1,crook,buss2,kikk1,kikk2,kikk3}\nhave shown\nthat the spin coherence which is optically excited by laser pulse can last\nmuch longer than optical coherence. For undoped ZnSe/ZnCdSe quantum wells,\nit is found in the experiment that the spin coherence can last up to\n15-20\\ ps\\cite{kikk1} where as for undoped bulk GaAs, it lasts about\n600\\ ps.\\cite{kikk3} For $n$-doped material, the spin coherence can last\nup to three orders of magnitude longer than the undoped sample which makes\n8\\ ns for ZnSe/ZnCdSe quantum well\\cite{kikk1} and 100\\ ns for bulk\nGaAs.\\cite{kikk3",
    "author": "M. W. Wu$^*$ and H. Metiu"
}