{
    "address": "Center for Nonlinear Phenomena and Complex Systems,\\\\ \nUniversit\\'{e} Libre de Bruxelles, Campus Plaine Code Postal 231,\\\\\nBoulevard du Triomphe, B-1050 Brussels, Belgium}\n\\date{\\today}\n\\maketitle\n\\begin{abstract} \nWe compute the full Lyapunov spectra for a hard-disk fluid under\ntemperature gradient and shear. The system is thermalized by\ndeterministic and time-reversible scattering at the boundary. This\nthermostating mechanism allows for energy fluctuations around a mean\nvalue which is reflected by only two vanishing Lyapunov exponents in\nequilibrium and nonequilibrium. The Lyapunov exponents are calculated\nwith a recently developed formalism for systems with elastic hard\ncollisions. In a nonequilibrium steady state the average phase-space\nvolume is contracted onto a fractal attractor leading to a negative\nsum of Lyapunov exponents. Since the system is driven inhomogeneously\nwe do not expect the conjugate pairing rule to hold which is confirmed\nnumerically.\n\\end{abstract}\n\\pacs{PACS numbers: 05.70.Ln, 51.10.+y, 66.20.+d, 66.60.+60}\n\n\\section{Introduction}\nTransport of energy and momentum is a central problem in\nnonequilibrium statistical mechanics, but so far most of our knowledge\nis confined to the macroscopic level. There is still a long way to go\nwhen it comes to understanding this phenomena in microscopic terms\nalthough significant progress has been made during the last years,\nwith help from dynamical systems theory and computer simulations. In\ngeneral, external forces are needed to drive a system out of\nequilibrium, but in order to prepare a nonequilibrium steady state the\nredundant energy has to be removed thus preventing the system from\nheating up indefinitely. One way out is the introduction of\nthermostating mechanisms\n\\cite{Ev83,HLM82,EH83,Nose84a,Nose84b,Hoov85}. Both stochastic \n\\cite{AT87,LeSp78,TCG82,GKI85,ChLe95,ChLe97,HoPo98,PoHo98} and\ndeterministic/time-reversible thermostats are in use, the latter\nhaving been introduced to remain close to Hamiltonian dynamics.\n\nRecently, an alternative thermostating mechanism\n\\cite{KRN99,RKN98,RKH99} acting via deterministic time-reversible\nboundary-scattering has been applied on a hard disk fluid to model\nheat and shear flow nonequilibrium steady states \\cite{WKN99}. The\ncalculated transport coefficients have been found to be in agreement\nwith the theoretical values obtained from kinetic theory, but only for\nspecial cases and in the thermodynamic limit the conjectured identity\nbetween exponential phase-space contraction and entropy production\nrate holds. In the present paper we investigate further the dynamical\nproperties of this system by computing the full Lyapunov spectra and\nrelated quantities like the Kaplan-Yorke dimension or the\nKolmogorov-Sinai entropy. In Sec. \\ref{sec1} we briefly recapitulate\nthe model and its thermostating mechanism and Sec. \\ref{sec2} serves\nto outline the method used for computing the Lyapunov exponents\n\\cite{DPH96,DePo97b}. The results are presented in Sec. \\ref{sec3} and\nconclusions are drawn in Sec. \\ref{sec4}.\n\n\\section{Model}\\label{sec1}\nConsider a two-dimensional system of hard disks confined in a square\nbox of length $L$ with periodic boundary conditions along the x-axis,\ni.e., the left and right sides at $x=\\pm L/2$ are identified. The $N$\ndisks interact among themselves via elastic hard collisions, thus the\nbulk dynamics is purely conservative. In the following and in all the\nnumerical computations we use reduced units by setting the particle\nmass $m$, the disk diameter $\\sigma$ and the Boltzmann constant $k_B$\nequal to one. Now, denote with $p_x^i$, $p_y^i$ and with $p^f_x$,\n$p^f_y$ the tangential and normal momentum of a disk before and after\na collision with the wall. Then the scattering prescription is given\nas \\cite{WKN99}\n\\begin{equation}\\label{e1",
    "author": "C. Wagner"
}