{
    "address": " Dept. of Physics, University of California,\nDavis, CA 95616}\n\\author{ Rajamani Narayanan}\n\\address{ American Physical Society, One Research Road, Ridge, NY 11961 }\n\\maketitle \n\n\\begin{abstract}\nA numerical investigation of the quenched Schwinger model on the lattice\nusing the overlap Dirac operator points to a divergent chiral condensate.\n\\end{abstract}\n\\pacs{11.15.Ha, 11.30Rd, 12.38Gc}\n\n\\section{Introduction}\n\nUse of quenched QCD as an approximation to the full theory depends upon a good\nunderstanding of the regions of parameter space where the quenched theory\ndiffers in important ways from the full theory. For the case of the chiral\ncondensate $\\langle \\bar\\psi\\psi \\rangle$, there may be qualitatively different\nbehaviors for sufficiently small quark mass. Whereas the condensate is expected\nto be finite in the full theory, there are theoretical arguments~\\cite{Sharpe}\nand some\ninitial numerical indications~\\cite{QCD} that it diverges in quenched QCD. \nAlso numerical analysis~\\cite{Sharan} of an instanton\ngas model shows a divergence.\nA careful\nstudy, using a lattice Dirac operator that obeys chiral symmetry, to determine\nthe mass range in which quenched QCD is a good approximation to the full theory\nhas not been done.\n\nSimilarly for the Schwinger model, the full theory has a finite \ncondensate\\cite{ls}\nbut there are predictions\\cite{Smilga,Durr} that it diverges in the quenched \ntheory. Thus the\nSchwinger model can be used to investigate the two-dimensional versions of\nthese questions concerning anomalies, topology, chiral symmetry, and\ncondensates and their impact on the relationship between full and quenched\ntheories. Although the Schwinger model is in most ways\nmuch simpler than QCD, it does present some peculiar\ndifficulties of its own. \nStrong infrared effects, which are dynamical and nonperturbative in QCD, are\nalready kinematical in the lower dimension of the Schwinger model.\nThere is the possibility that infrared enhancement in the quenched case gives a\nfermion spectral density that is divergent as the eigenvalue $\\lambda$ goes to\nzero and that there is a corresponding infinite condensate $<\\bar\\psi\\psi>$.\nWe have investigated this issue numerically using the overlap Dirac operator to\ndescribe the massless limit for the fermions and have found strong evidence for\nthese divergences in the quenched Schwinger model.\n\nWhen stated in terms of the low eigenvalue behavior of the fermion\nspectral density in the quenched Schwinger model, theoretical discussions \nhave given a lower bound that is\nfinite\\cite{Casher} and stronger one that is divergent\\cite{Smilga}.\nSome estimates\\cite{Smilga,Durr} that are not bounds have suggested \na form diverging exponentially in the volume $e^{cg^2V}$. \nThe discussions in Refs.~\\cite{Smilga,Casher} are given in\nterms of the eigenvalue shifts of the would-be-zero modes associated\nwith subregions of the whole two-dimensional volume $V$. With larger\nshifts \\cite{Casher} due to interactions with other subareas, the\nspectrum is flat at small $\\lambda$ in the infinite volume\nlimit. Smaller shifts \\cite{Smilga} leave the would-be-zero modes\nconcentrated near the origin so that the spectral density there\ndiverges as $V \\rightarrow \\infty$. Other arguments \\cite{Smilga,Durr} for\nthe form of the divergence proceed along different lines, but the\nimplication for the spectrum is that the lowest eigenvalues are\nexponentially small in the volume with a corresponding exponentially\nlarge spectral density and condensate.\n\nThe data that we present here covers a range of lattice sizes from\n$8^2$ to $32^2$. The full spectrum of the overlap Dirac operator was\ncalculated in gauge backgrounds from the Wilson action at several bare\ncouplings. \nThe next section discusses the lattice formalism used in this paper.\nThe third section discusses the physics issues in more detail. \nThe fourth section\ngives our numerical results. In addition to the spectrum itself, there are\nmeasures of its behavior including $<\\bar\\psi\\psi>$ and the distribution of the\nlowest eigenvalue.\nThe last section contains a summary of our\nresults and some concluding discussion.\n\n\\section {Lattice formalism}\n\nSince we are interested in studying the small mass region and the\nmassless limit, we need to work with a lattice Dirac operator that\nrespects chiral symmetry. We will use the overlap Dirac operator\nfor our numerical study. It has the form\\cite{Herbert}\n\\begin{equation}\nD={1\\over 2",
    "author": " Joe Kiskis",
    "title": "Chiral condensate in the quenched Schwinger model"
}