{
    "affiliation": "partment of Physics and Astronomy, University of\nVictoria, Victoria, BC V8P 1A1, Canada}\n\n\\and \n\n\\author{Matthias Steinmetz\\altaffilmark{2}}\n\n\\affil{Steward Observatory, University of Arizona, Tucson, AZ 85721, USA}\n\n\\altaffiltext{1}{CIAR Scholar, Alfred P.~Sloan Fellow. Email: jfn@uvic.ca}\n\\altaffiltext{2}{Alfred P.~Sloan Fellow, David \\& Lucile Packard Fellow. Email: msteinmetz@as.arizona.edu}\n\n\\begin{abstract}\n%\nWe use cosmological N-body/gasdynamical simulations that include star formation\nand feedback to examine the proposal that scaling laws between the total\nluminosity, rotation speed, and angular momentum of disk galaxies reflect\nanalogous correlations between the structural parameters of their surrounding\ndark matter halos.  The numerical experiments follow the formation of\ngalaxy-sized halos in two Cold Dark Matter dominated universes: the standard\n$\\Omega=1$ CDM scenario and the currently popular $\\Lambda$CDM model.  We find\nthat the slope and scatter of the I-band Tully-Fisher relation are well\nreproduced in the simulations, although not, as proposed in recent work, as a\nresult of the cosmological equivalence between halo mass and circular velocity:\nlarge systematic variations in the fraction of baryons that collapse to form\ngalaxies and in the ratio between halo and disk circular velocities are observed\nin our numerical experiments. The Tully-Fisher slope and scatter are recovered\nin this model as a direct result of the dynamical response of the halo to the\nassembly of the luminous component of the galaxy. We conclude that models that\nneglect the self-gravity of the disk and its influence on the detailed structure\nof the halo cannot be used to derive meaningful estimates of the scatter or\nslope of the Tully-Fisher relation. Our models fail, however, to match the\nzero-point of the Tully-Fisher relation, as well as that of the relation linking\ndisk rotation speed and angular momentum. These failures can be traced,\nrespectively, to the excessive central concentration of dark halos formed in the\nCold Dark Matter cosmogonies we explore and to the formation of galaxy disks as\nthe final outcome of a sequence of merger events. Disappointingly, our feedback\nformulation, calibrated to reproduce the empirical correlations linking star\nformation rate and gas surface density established by Kennicutt, has little\ninfluence on these conclusions. Agreement between model and observations appears\nto demand substantial revision to the Cold Dark Matter scenario or to the manner\nin which baryons are thought to assemble and evolve into galaxies in\nhierarchical universes.\n%Star\n%formation is significantly attenuated in early collapsing clumps, but\n%still most baryons collapse at high redshift into dense disks which\n%subsequently merge to form the final galaxy. \n%As a result, simulated\n%galaxies of given luminosity are too massive and too compact to be\n%consistent with typical spirals. A much stronger feedback\n%prescription, one that affects substantially the cooling, accretion,\n%and conversion of baryons into stars in systems with circular\n%%velocities as large as $\\sim 200$-$300$ km s$^{-1}$, seems required in\n%order to bring models into closer agreement with observations.\n%\n%\n\\end{abstract}\n\n\\keywords{cosmology: theory -- galaxies: formation, evolution -- methods: numerical}\n\n\\section{Introduction",
    "author": "Julio F. Navarro\\altaffilmark{1}",
    "title": "Dark Halo and Disk Galaxy Scaling Laws in Hierarchical Universes"
}