{
    "address": "$^1$NORDITA, Blegdamsvej 17, DK-2100 Copenhagen \\O, Denmark\n\\\\ $^2$Laboratoire d'Optique Appliqu\\'ee, Ecole Nationale Sup\\'erieure\nde Techniques Avanc\\'ees, \\`Ecole Polytechnique, Palaiseau, France}\n\n\\maketitle\n\n\\begin{abstract}\n   In view of the recent experiments of O'Hara {\\it et al.}\n\\cite{Keith} on excitons in Cu$_2$O, we examine the interconversion \nbetween the angular-momentum triplet-state excitons and the angular-momentum\nsinglet-state excitons by a spin-exchange process which has been\noverlooked in the past. We estimate the rate of this \nparticle-conserving mechanism and find a substantially higher value \nthan the Auger process considered so far. Based on this idea, we give a \npossible explanation of the recent experimental observations, and make \ncertain predictions, with the most important being that the singlet-state \nexcitons in Cu$_2$O is a very serious candidate for exhibiting the \nphenomenon of Bose-Einstein condensation.\n\\end{abstract}\n\\pacs{PACS numbers: 25.70.Np,12.38.Qk}\n \n\\vskip0.5pc]\n\n   Bose-Einstein condensation \\cite{GSS} \nhas been the subject of numerous theoretical and experimental studies.  \nWhile in the recent years many of these studies have focused on the \nBose-Einstein condensation of trapped alkali atoms \\cite{RMP},\nanother possible candidate which can undergo this second-order phase \ntransition is the exciton gas in semiconducting materials \\cite{Knox}. \n\n  Excitons are much like positronium atoms. They are bound states \nwhich form between electrons and holes in a semiconductor,\nafter the electrons get excited from the conduction band to the\nvalence band, usually by some laser field.  Since excitons consist of \ntwo fermions, in the limit where their separation is much larger than \ntheir Bohr radius, they are expected to behave like bosons.  Many \nexperiments have been performed with excitons in Cu$_2$O \nbecause of the many advantages of this material: It has a direct, but\ndipole-forbidden gap, which makes the lifetime of excitons rather long,\nit has isotropic effective electron and hole masses, it does not form \nbound states, biexcitons, or an electron-hole liquid, and finally the\nexciton binding energy is quite large.\n\nThe traditional way of observing the kinetic energy distribution\nof excitons is to look at the recombination spectrum, and more\nspecifically the optical-phonon assisted lines.  Since the optical \nphonons have a very weak dispersion relation and since the transition matrix\nelement does not depend on the exciton momentum, the energy \ndistribution of the emitted photons essentially gives the kinetic \nenergy distribution of the excitons.  Many experiments \n\\cite{Andre,David} have demonstrated that excitons do indeed obey \nBose-Einstein statistics in the limit of high enough densities and low \nenough temperatures, with the luminescence spectrum fitting very \naccurately to Bose-Einstein distributions.\nThis fitting procedure gives the temperature and the chemical \npotential of the gas, since these are essentially independent parameters.  \nA crucial assumption underlying this procedure, is that very frequent\ncollisions between the excitons bring the gas to a quasi equilibrium, \nwith some time-dependent chemical potential and temperature, which in \ngeneral differs from the lattice temperature that is kept very low, \nbelow 5 K.  The typical effective temperature of the exciton gas is on \nthe order of 10 up to 100 K.  Knowing the temperature and the chemical \npotential, one can deduce the particle density, assuming an ideal Bose \ngas with an experimentally known total exciton mass.  The densities turn \nout to be on the order of 10$^{18}$ cm$^{-3}$ from this method. Following \nthis approach Snoke {\\it et al.} \\cite{Andre,David",
    "author": "G. M. Kavoulakis$^1$ and A. Mysyrowicz$^2$"
}