{
    "address": "Dept. of Physics and Astronomy, University College London\\\\\nGower Street, London WC1E 6BT, E-mail: w.hofer@ucl.ac.uk}\n\n\\maketitle\n\n%---------------------------------------------------------------------------%\n%       A B S T R A C T    A N D   P A C S                                  %\n%---------------------------------------------------------------------------%\n\n\\begin{abstract}\n\nThe fundamental equations of particle motion lead to a modified\nPoisson equation including dynamic charge. This charge derives\nfrom density oscillations of a particle; it is not discrete, but\ncontinuous. Within the dynamic model of hydrogen it accounts for\nall features of electron proton interactions, its origin are\ndensity oscillations of the proton. We propose a new system of\nelectromagnetic units, based on meter, kilogram, and second,\nbearing on these findings. The system has none of the\ndisadvantages of traditional three-unit systems. On the basis of\nour theoretical model we can genuinely derive the scaling factor\nbetween electromagnetic and mechanic variables, which is equal,\nwithin a few percent, to Planck's constant h. The implications of\nthe results in view of unifying gravity and quantum theory are\ndiscussed. It seems that the hypothetical solar gravity waves, in\nthe low frequency range of the electromagnetic spectrum, are open\nto experimental detection.\n\n\\end{abstract}\n\n\\vspace{0.5cm}\n{\\it PACS:} 03.65.Bz, 03.70.+k, 04.60.-m, 11.10.-z\n\n%%% end of two-column print\n\\vskip2pc]\n\n\n%---------------------------------------------------------------------------%\n%       T I T L E   P A G E                                                 %\n%---------------------------------------------------------------------------%\n\n\n\n\\section{The nature of charge}\nSince the discovery of the electron by J. J. Thomson\n\\cite{thomson97} the concept of electric charge has remained\nnearly unchanged. Apart from Lorentz' extended electron\n\\cite{lorentz04}, or Abraham's electromagnetic electron\n\\cite{abraham03}, the charge of an electron remained a point like\nentity, in one way or another related to electron mass\n\\cite{bender84,keller97}. In atomic nuclei we think of charge as a\nsmeared out region of space, which is structured by the elementary\nconstituents of nuclear particles, the quarks \\cite{montan94}.\n\nThe first major modification in this picture occurred only in the\nlast decades, when experiments on the quantum hall effect\n\\cite{stormer82,hall90} suggested the existence of \"fractional\ncharge\" of electrons. Although this effect has later been\nexplained on the basis of standard theory \\cite{laughlin83}, its\nimplications are worth a more thorough analysis. Because it cannot\nbe excluded that the same feature, fractional or even continuous\ncharge, will show up in other experiments, especially since\nexperimental practice more and more focuses on the properties of\nsingle particles. And in this case the conventional picture, which\nis based on discrete and unchangeable charge of particles, may\nsoon prove too narrow a frame of reference. It seems therefore\njustified, at this point, to analyze the very nature of charge\nitself. A nature, which would reveal itself as an answer to the\nquestion: What is charge?\n\nIt must be noted, in this respect, that the picture of continuous\ncharge, in classical theories, is due to the omission of the\natomic structure of matter. In any modern sense, continuous charge\ncan only be recovered by considering dynamic processes within the\nvery particles themselves.\n\nWith this problem in mind, we reanalyze the fundamental equations\nof intrinsic particle properties \\cite{hofer98a}. The consequences\nof this analysis are developed in two directions. First, we\ndetermine the interface between mechanic and electromagnetic\nproperties of matter, where we find that only one fundamental\nconstant describes it: Planck's constant $\\hbar$. And second, we\ncompute the fields of interaction within a hydrogen atom, where we\ndetect oscillations of the proton density of mass as their source.\nFinally, the implications of our results in view of unifying\ngravity and quantum theory are discussed and a new model of\ngravity waves derived, which is open to experimental tests.\n\n\\section{The origin of dynamic charge}\n\nThe intrinsic vector field ${\\bf E}({\\bf r",
    "author": "W. A. Hofer",
    "title": "Evidence for a dynamic origin of charge"
}