{
    "address": "\n$^a$ Dipartimento di Fisica and INFN, Politecnico di Torino, \nI-10129 Torino, Italy\\\\\n$^b$ Physics  Department, Southern Illinois University,\nEdwardsville, IL 62026, USA}\n\\maketitle\n\n\\begin{abstract}\nWe formulate a convenient generalization of\nthe $q$-expectation value, based on the analogy of the symmetric\nquantum groups and $q$-calculus, and  show that \nthe  $q\\leftrightarrow \\q1$ symmetric\nnonextensive entropy preserves all of the  mathematical structure of\nthermodynamics  just as in the case of non-symmetric Tsallis\nstatistics. Basic properties and analogies with\nquantum groups are discussed.\n\\end{abstract}\n\n\\vspace{0.5cm}\n\n\\noindent\nPACS: 05.20.-y; 05.70.-a; 05.30.-d\n\\vspace{1cm}\n\nIn the last few years there has been much interest in\nnonextensive classical and quantum  physics.\nThe nonextensive statistical mechanics proposed by Tsallis\n\\cite{tsallis,curado},\nhas been\nthe source of inspiration for many investigations  in systems\n which represent multifractal properties, long-range interactions\nand/or long-range memory effects \\cite{biblio}. On the other hand,\n quantum groups and the derived $q$-deformed algebraic structure such as\n$q$-oscillators, based on\nthe deformation of standard oscillator commutation-anticommutation relations, \n have created considerable interest in mathematical physics\nand in several applications \\cite{bie}.\nThe investigations described above are \nonly two apparently unrelated areas in nonextensive physics.\nAlthough a complete understanding of the connection between nonextensive\nstatistics and $q$-deformed structure is still lacking, many papers are\ndevoted to the study of a deep connection between these two non-extensive\nformalisms \\cite{tsa,abe,bor,pin,joh}.\n\nTsallis statistics is a $q$-nonsymmetric formalism i.e., not invariant\nunder $q \\leftrightarrow\\q1$. Recently Abe \\cite{abe} has\nemployed a connection between Tsallis entropy and the non-symmetric Jackson\nderivative. Because the requirement of invariance under\n$q \\leftrightarrow\\q1$ is very important in quantum groups \\cite{aiz}, \nthe above connection allows him to extend the  Tsallis entropy\nto the $q$-symmetric one by means of a symmetric Jackson derivative.\nHowever, Abe has not extended the definition of the expectation value\nof an observable to the symmetric case and thus unable to formulate the\nthermostatistics which will preserve the Legendre transformation of\nstandard thermodynamics \nin contrast to the  Tsallis statistics which does. We would like to point\nout that Ref.\\cite{bor} introduces a two-parameter modification for the\nentropy and for the expectation value of an observable but does not also\nproduce a consistent formulation of thermostatistics.  \n\nThe purpose of this letter is to show how the $q\\leftrightarrow \\q1$\nsymmetric generalization of the Tsallis entropy\ntogether with a natural generalization of the\n$q$-expectation value produces  \n a thermostatistics that preserves the\nmathematical structure of standard thermodynamics and show\nthat this\nproperty is a direct consequence of the generalization from the\nnon-symmetric $q$-calculus to the symmetric one.\n\n\nBefore  investigating the symmetric nonextensive thermostatistics, let us\nbriefly review the fundamental properties of the Tsallis thermostatistics,\nwhich is based  upon the following two postulates \\cite{tsallis,curado}.\n\n\\begin{itemize",
    "author": "A. Lavagno $^a$ and P. Narayana Swamy $^b$"
}