{
    "address": "Center for BioDynamics, Center for Polymer Studies, and Department of Physics, Boston\nUniversity, Boston, MA, 02215}\n\\maketitle\n\\begin{abstract}\n  \n  We study the time until a filter becomes clogged due to the trapping of\n  suspended particles as they pass through a porous medium.  This trapping\n  progressively impedes and eventually stops the flow of the carrier fluid.\n  We develop a simple description for the pore geometry and the motion of the\n  suspended particles which, together with extreme-value statistics, predicts\n  that the distribution of times until a filter clogs has a power-law\n  long-time tail, with an infinite mean clogging time.  These results and its\n  consequences are in accord with simulations on a square lattice porous\n  network.\n\n\\bigskip \n\\indent {PACS Numbers: 47.55.Kf, 83.70.Hq, 64.60.Ak, 05.40.+j}\n\\end{abstract}\n\\begin{multicols}{2}\n  \n  In this letter, we investigate the time required for a filter to clog.  In\n  a typical filtration process, a dirty fluid is ``cleaned'' by passing it\n  through a porous medium to remove the suspended particles.  The medium\n  enhances filtering efficiency by increasing both the available filter\n  surface area for trapping suspended particles, as well as the exposure time\n  of the suspension to the active surfaces.  Such a mechanism is the basis of\n  water purification, air filtration, and many other separation\n  processes\\cite{rev,rev2}.  As suspended particles become trapped, the fluid\n  permeability of the medium gradually decreases, and eventually the filter\n  becomes clogged.  Determining the time dependence of this clogging is basic\n  to predicting when a filter is no longer useful, either because of reduced\n  throughput or reduced filtration efficiency, and should be discarded.\n  \n  We develop a minimalist model which provides an intuitive understanding for\n  the clogging of a filter.  Our analytical results are based on representing\n  the clogging of a porous medium by the clogging of a single parallel array\n  of pores which are blocked in decreasing size order (Fig.~\\ref{cartoon",
    "author": "S.~Redner and Somalee~Datta$^*$",
    "title": "Clogging Time of a Filter"
}