{
    "affiliation": "partment of Astronomy and Astrophysics, University of Chicago\\\\\n       5640 South Ellis Avenue, Chicago, IL 60637\\\\\n       nweinber@midway.uchicago.edu}\n\n\\author{M. Coleman Miller}\n\\affil{Department of Astronomy, University of Maryland\\\\\n       College Park, MD  20742-2421\\\\\n       miller@astro.umd.edu}\n\n\\author{Donald Q. Lamb}\n\\affil{Department of Astronomy and Astrophysics and Enrico Fermi Institute\\\\\n       University of Chicago, 5640 South Ellis Avenue, Chicago, IL 60637\\\\\n       lamb@pion.uchicago.edu}\n\n\\begin{abstract} \nThe discovery of high-amplitude brightness oscillations during\ntype I X-ray bursts from six low-mass X-ray binaries has provided a powerful\nnew tool to study the properties of matter at supranuclear densities, the\neffects of  strong gravity, and the propagation of thermonuclear burning. There\nis substantial evidence that these brightness oscillations are produced by\nspin  modulation of one or two localized hot spots confined to the stellar\nsurface. It is therefore important to calculate the expected light curves\nproduced  by such hot spots under various physical assumptions, so that\ncomparison   with the observed light curves may most sensitively yield\ninformation about the underlying physical quantities. In this paper we make\ngeneral relativistic calculations of the light curves and oscillation\namplitudes produced by a  rotating neutron star with one or two hot spots as a\nfunction of spot size,  stellar compactness, rotational velocity at the stellar\nsurface, spot location, orientation of the line of sight of the observer, and\nthe angular dependence of the surface specific intensity. For the case of two\nemitting spots we  also investigate the effects of having spot separations less\nthan $180^\\circ$ and the effects of having asymmetries in the brightness of the\ntwo spots.  We find that stellar rotation and beaming of the emission tend to\nincrease the observed  oscillation amplitudes whereas greater compactness and\nlarger spot size tend to decrease them. We also show that when two emitting\nspots are either non-antipodal or asymmetric in brightness,  significant power\nat the first harmonic is generated. By applying these results to \n4U~1636--536, whose two emitting spots produce power at the first harmonic, we \nplace strong constraints on the neutron star's magnetic field\ngeometry.  We also show that the data on the phase lags between photons\nof different energies in the\npersistent pulsations in SAX~J1808--58 can be fit well with a model in which\nthe observed hard leads are due to Doppler beaming.\n\\end{abstract}\n\n\\keywords{stars: neutron --- equation of state --- gravitation --- \nrelativity --- X-rays: bursts}\n\n\\section{INTRODUCTION}\n\nThe study of neutron stars is attractive in part because of the fundamental\nissues of physics that can be addressed.  These include the behavior of\nspacetime in strong gravity, the equation of state of matter at supranuclear\ndensities, and the propagation of thermonuclear burning in degenerate\nmatter, an issue which has relevance to many astrophysical events including\nclassical novae and Type~Ia supernovae.\n\nThe discovery with the \\textsl{Rossi X-ray Timing Explorer} (\\textsl{RXTE",
    "author": "Nevin Weinberg",
    "title": "Oscillation Waveforms and Amplitudes from Hot Spots on Neutron Stars"
}