{
    "affiliation": "1$Canadian Institute for Theoretical Astrophysics,\nUniversity of Toronto, McLennan Labs, 60 St. George Street,\nToronto, ON M5S 3H8, Canada}\n\\affil{$^2$University of Kentucky, Department of Physics \\& Astronomy, 177 CP\nBuilding, Lexington, KY 40506--0055, USA}\n\n\\begin{abstract}\nThis paper describes the development of the photo-ionization code Cloudy\nsince the last major release 90.05.\n\\end{abstract}\n\n\\section{Introduction}\n\nThis poster centers on the development of Cloudy, a large-scale code designed\nto compute the spectrum of gas in photo-ionization or collisional balance.\nSuch plasma is far from equilibrium, and its conditions are set by the balance\nof a host of micro-physical processes. The development of Cloudy is a\nthree-pronged effort requiring advances in the underlying atomic data base,\nthe numerical and computational methods used in the simulation, and\nculminating in the application to astronomical problems. These three steps are\nstrongly interwoven.\n\nIn recent years, Cloudy has undergone a major upgrade in the atomic data. A\nlarge part of this effort was concentrated on improving the photo-ionization\ncross sections. Since then the code has been transformed from a Fortran 77 to\nan ANSI C code and work has begun to completely recode the model atoms used to\ncalculate line emissivities. They will be organized in such a way that each\niso-electronic sequence has a common code appropriate for all members of that\nsequence. This makes validating the code easier and also facilitates future\nupgrades in the atomic data. Work on the hydrogen sequence is complete and\nwork on the helium sequence is underway. A more detailed account of the\n% check !!\ncurrent status of the code can be found in Section~2. The grain model in\nCloudy is also currently undergoing a major upgrade, which is described in\n% check !!\nmore detail in Section~3. \n\n\\section{Improvements in Cloudy 94",
    "author": "J. Franco, E. Terlevich, O. L\\'opez-Cruz and I, Aretxaga, eds.",
    "title": "Current Development of the Photo-Ionization Code Cloudy"
}