{
    "address": "$^{\\diamond}$ Departamento de F\\'{\\i}sica,\nUniversidad Aut\\'onoma Metropolitana--Iztapalapa,\\\\\nApartado Postal 55-534, C.P. 09340, M\\'exico, D.F., MEXICO\\\\  and\\\\\n$^\\$$Astronomy Centre, School of Chemistry, Physics and\nEnvironmental Science,\\\\ University of Sussex, Falmer, Brighton BN1 9QJ,\nUnited Kingdom,}\n\n\\date{\\today}\n\n\\maketitle\n\n\\begin{abstract}\nThe present surge for the astrophysical relevance of {\\em boson stars} stems\nfrom the speculative possibility that these compact objects could provide a\nconsiderable fraction of the\nnon-baryonic part of {\\em dark matter} within the halo of galaxies. \nFor a very \nlight `universal' {\\em axion} of {\\em effective string} models, \ntheir total gravitational mass will be in the most likely range of\n$\\sim 0.5$ $M_\\odot$ of MACHOs. According to this framework, \n{\\em gravitational microlensing} is indirectly \n``weighing\" the axion mass, resulting in $\\sim 10^{-10}$ eV/c$^2$. \nThis conclusion is not changing much, if we use a\ndilaton type self-interaction \nfor the bosons. Moreover,\nwe review their formation, rotation and stability as likely\ncandidates of astrophysical importance.\n\\end{abstract}\n%\\bigskip\n\\pacs{PACS no.: 04.40.Dg, 04.25.Dm, 95.30.Sf} Keywords: Boson stars, Axions,\nEffective string models, Dark matter, MACHOs\n\n\\section{Introduction}\n\\subsection{\\bf Dark matter --- Issue of missing mass}\n\nThe rotation velocities of spiral galaxies\ncan be accurately measured from the Doppler\neffect. At large radii where the stellar surface brightness is falling\nexponentially, velocities are obtained for clouds of \nneutral hydrogen using the 21 cm hyperfine line. \nThe resulting `rotation curves' are found to be roughly \nflat out to the maximum observed radii of about 50 kpc,\nwhich implies an enclosed mass increasing linearly with radius. \nThis mass profile is much more extended than the distribution \nof starlight, which typically converges within $\\sim 10$ kpc; \nthus, the galaxies are presumed to be surrounded by extended \n{\\em halos} of {\\em dark matter}.   \n\nPerhaps the most compelling evidence for dark matter comes from\nclusters of galaxies.\nThese are structures of about 1 Mpc size \ncontaining more than 100 galaxies, representing an overdensity of \nabout a factor 1000 relative to the mean galaxy density. \nIt is assumed that they are gravitationally bound since the\ntime for galaxies to cross the cluster lasts only about 10\\%\\ of the\nage of the Universe. The cluster masses are determined in several\nindependent ways: \nFirst, the virial theorem uses the radial velocities of\nindividual galaxies as `test particles'.\nSecond, observations of hot gas at about $10^7$ K\ncontained in the clusters, which is observed in X-rays\nvia thermal bremsstrahlung. The gas temperature \nis derived from the X-ray spectrum, and the density profile from\nthe map of the X-ray surface brightness. \nAssuming the gas is pressure-supported against the gravitational\npotential leads to a mass profile for the cluster.  \nThe third method is gravitational lensing of background objects by the\ncluster potential. There are two regimes: the `strong lensing' \nregime at small radii, which leads to arcs and multiple images, and the\nweak lensing regime at large radii, which causes background galaxies to be \npreferentially stretched in the tangential direction. \nAll three methods yield estimates for cluster masses\n\\cite{C98,BN92",
    "author": "Eckehard W. Mielke$^{\\diamond}$\\thanks{E-mail: ekke@xanum.uam.mx",
    "title": "Boson Stars: Alternatives to primordial black holes?"
}