{
    "address": "Institute of Theoretical Physics, University of\nRegensburg, D-93040 Regensburg, Germany}, \n\\renewcommand{\\thefootnote}{\\alph{footnote}}\nCh. Helm\\fnm{1}\\address{Los Alamos National Laboratory, Division T-11, M.S.\nB-262, NM 87545, USA},  K. Schmalzl\\fnm{1}, Ch. Walter\\fnm{1}, J.\nKeller\\fnm{1}}\n\n\n\n\\begin{document}\n\n\n\\begin{abstract}\nA microscopic theory \nfor the coupling of intrinsic\nJosephson oscillations and dispersive phonon branches in layered\nsuperconductors is developed. Thereby the effect of phonons on \nthe electronic c-axis transport enters through an effective\nlongitudinal dielectric function.\nThis coupling provides an explanation of recently observed subgap resonances in\nthe $I_{\\rm dc}$-$V_{\\rm dc}$-curve \nof anisotropic cuprate superconductors forming a stack of \nshort Josephson junctions. Due to the finite dispersion these resonances can\nappear at van-Hove-singularities of both optical and acoustical phonon \nbranches,\nexplaining low-voltage structures in the I-V-characteristic, which are not\nunderstood in phonon models without dispersion.\nIn long junctions the dispersion of collective electron-phonon \n modes parallel  to the layers is investigated.\n\\end{abstract}\n\n\\maketitle\n\n%\\pacs{74.80Dm, 74.50+r, 74.25Kc, 74.25Jb}\n\n\n\\section{INTRODUCTION}\n\n\nThe main features of the electronic $c$-axis transport  \nin the high-$T_c$-superconductors  Tl$_2$Ba$_2$Ca$_2$Cu$_3$O$_{10+\\delta}$ \n and Bi$_2$Sr$_2$CaCu$_2$O$_{8+\\delta}$  below \nthe critical temperature $T_c$ can be well understood in the model of  \na stack of superconducting  CuO$_2$-layers, \nwhich form a onedimensional stack of intrinsic Josephson junctions\n\\cite{kleiner1}.   \n\n\n\nOne of the few phenomena, which are specific to the {\\em intrinsic} \nJosephsoneffect and cannot be seen in arrays of conventional superconductors, \nis the interaction of the Josephson oscillations and phonons. This has been \nobserved experimentally in the form of resonances in the\n$I_{\\rm dc}$-$V_{\\rm dc}$-characteristics at \nlow voltages \\cite{schlengal,yurgenss,seidel}. Their main features \ncould already \nbe understood theoretically in the framework of a simple lattice dynamical \nmodel of damped local oscillators in the barrier \\cite{wir1}.  \n\nDespite the clear evidence of the effect a general multi-band theory, in which \nparameters like the phonon frequencies or the oscillator strength in the \ndielectric function are specified microscopically, is still missing and shall \nbe presented in the following. This more general formalism is in principle  \nappropriate to include the eigenvalues and eigenvectors of the dynamical matrix\nas obtained in {\\em any}\n microscopic lattice dynamical calculation into the Josephson\ntheory. Qualitative effects of the phonon dispersion are discussed in a simple \nrigid ion model, e.g. the van-Hove singularity at \nthe upper edge of the acoustical band, which can be detected in the \n$I_{\\rm dc}$-$V_{\\rm dc}$-curve. Details of the \nderivation and further results can be found elsewhere \\cite{wir6}. \n\n\\section{THEORY OF PHONON COUPLING}\n\n%The main steps in the theoretical derivation of the \n%$I_{\\rm dc}$-$V_{\\rm dc"
}