{
    "address": "\\ddag Institut des Sciences Nucl\\'eaires,  F-38026 Grenoble,  \nFrance}\n\\address{\\dag Instytut Fizyki,  Uniwersytet MCS,  20-031 Lublin,  \nPoland}\n\n\\begin{abstract}\nThe motion of circular WP for one electron in central Coulomb\nfield with high $Z$ is calculated. The WP is defined in terms of solutions \nof the Dirac equation in order to take into account all possible relevant\neffects in particular the spin-orbit potential. A time scale is defined\nwithin which spin dynamics must be taken into account mainly in the atoms\nwith high $Z$. Within this time scale there exists a mechanism of collapses\nand revivals of the spin already shown by the authors for harmonic\noscillator potential and called the {\\em spin orbit pendulum}. However this\neffect has not the exact periodicity of the simpler model, but the WP's spatial\nmotion is nevertheless quite similar.\n\\end{abstract}\n\\pacs{03.65.Sq} \n\n\\vspace{2mm}\n\\noindent Submitted to {\\em Physical Review A}   \\hfill\\today\n\n\\section{Introduction}\\label{intro}\nIn the last decade large efforts\n\\cite{parker,averbukh,nauenberg,dacic,peres,bluhmsr,BKP} \nhave been\ndevoted to the detailed understanding of the quantum dynamics of WP in\nsimple systems like H atoms or hydrogenoid atoms.\nTheoretical investigations resulted in very good understanding\nof such subtle interference effects like collapse, revivals,\nfractional revivals and super-revivals of wavepackets created\nin atomic and molecular systems. Many signatures of these phenomena\nhave been observed in numerous sophisticated experimental studies.\nIndeed with contemporary lasers\nand tunable electromagnetic fields one can engineer many different\ndesired initial states and analyze their time evolution \\cite{alber}.\n   \n     Our aim in this paper is to perform a new step in the analysis of the\nWP dynamics for hydrogen atom and for ions with one electron by\nconsidering spin motion. Until now this effect was not considered for\nisolated atoms since it requires very long time scales to manifest itself\ndue to the weakness of the spin--orbit coupling. In order to decrease as\nmuch as possible this time scale we will consider WP within ions with very\nlarge $Z$. We intended to make a calculation which include all possible\neffects for these elements and therefore we have considered WP which\nevolve under the relativistic Dirac Hamiltonian i.e. which are \nfour component spinors.\n\n    Spin effects and relativistic effects have been studied many times but\nmostly for atoms submitted to intense laser fields. A recent review has\nbeen given in \\cite{protopapas}.\nSome of the most relevant research works are found in\n\\cite{latinne,rathe,szymanowski,husx}.\nIt is generally agreed in them that spin and relativistic effects\nare small but that their magnitude increase with the intensity of the\nfield. For fields of the order of $10^{16}$ to $10^{17}$ W/cm$^2$ \nthey should be taken into account. \nIn a most recent paper \\cite{husx} the interest has been\nfocussed on the spin--orbit coupling, essentially for Al$^{+12}$ and Ga$^{+12}$\nions. The dynamics of the spin degree of freedom was analyzed there during\nthe time of interaction of the laser with the ion. The authors did not use\nthe Dirac equation but the Schr\\\"odinger equation corrected up to order\n$1/c^3$ and therefore the spin--orbit potential could be clearly identified\nby its mere suppression. The most significant signature occur in the\nradiation spectrum. However little polarization was produced for the ions\nwhich were considered.  \n\n    Spin dynamics was previously studied by us in harmonic oscillator\npotentials in non-relativistic dynamics. In ref.\\ \\cite{arv94,arv95,roz96}  \nwe have found a new\neffect that we have called the {\\em spin--orbit pendulum} for a spin--orbit\npotential with a constant radial part. This phenomenon is simply the\nperiodic collapse and revival of the average spin and an exchange of\nangular momentum between spin and the orbital angular momentum. \nThe analysis is quite parallel to that of the Jaynes-Cummings model \n\\cite{jaynes",
    "title": "\\newpage"
}