{
    "address": "Department of Mathematics and Statistics\\\\ University of Edinburgh\\\\\nKing's Buildings, Mayfield Road\\\\ Edinburgh EH9 3JZ\\\\ Scotland.}\n\\address{Centre de Math{\\'e}matiques\\\\ Ecole Polytechnique\\\\ UMR 7640 du\n  CNRS\\\\ F-91128 Palaiseau\nCedex\\\\ France.}\n\\email{davidmjc@maths.ed.ac.uk}\n\\date{\\thismonth}\n\\begin{abstract}\n  Weyl derivatives, Weyl-Lie derivatives and conformal submersions are\n  defined, then used to generalize the Jones-Tod correspondence between\n  selfdual $4$-manifolds with symmetry and Einstein-Weyl $3$-manifolds with an\n  abelian monopole. In this generalization, the conformal symmetry is replaced\n  by a particular kind of conformal submersion with one dimensional fibres.\n  Special cases are studied in which the conformal submersion is holomorphic,\n  affine, or projective. All scalar-flat K{\\\"a}hler metrics with such a\n  holomorphic conformal submersion, and all four dimensional hypercomplex\n  structures with a compatible Einstein metric, are obtained from solutions of\n  the resulting ``affine monopole equations''.  The ``projective monopole\n  equations'' encompass Hitchin's twistorial construction of selfdual Einstein\n  metrics from three dimensional Einstein-Weyl spaces, and lead to an explicit\n  formula for carrying out this construction directly. Examples include new\n  selfdual Einstein metrics depending explicitly on an arbitrary holomorphic\n  function of one variable or an arbitrary axially symmetric harmonic\n  function.  The former generically have no continuous symmetries.\n\\end{abstract}\n\\maketitle\n%\n\\section*{Introduction}\n\nThe aims of this paper are threefold: firstly, to advertise the notion of a\nWeyl derivative both as a simple, but useful, tool in differential geometry,\nand also as an object of study in its own right; secondly, to apply this tool\nto the theory of conformal submersions, with particular attention to the case\nof selfdual conformal $4$-manifolds; and thirdly to give explicit\nconstructions of selfdual Einstein metrics. The key discovery is a class of\nconformal submersions with one dimensional fibres which admit a holomorphic\ninterpretation on the twistor space. This class includes the conformal\nsubmersions generated by conformal vector fields and provides a natural\nsetting for a generalized Jones-Tod correspondence~\\cite{JT}.\n\nA Weyl derivative on a manifold $M$ is nothing more than a covariant\nderivative on a real line bundle naturally associated to the differential\ngeometry of $M$. Weyl derivatives can be used to define Lie derivatives along\nfoliations with one dimensional leaves, generalizing the usual Lie derivative\nalong a vector field. They also occur naturally in the geometry of conformal\nsubmersions. These two situations have in common the conformal submersions\nwith one dimensional fibres, to which most of this paper is devoted. I focus\nin particular on the case that the total space is a selfdual $4$-manifold $M$\nand define the notion of a selfdual conformal submersion. In Theorem\nI~\\eqref{JonesnTod}, the base $B$ of such a submersion is shown to be not just\nconformal, but Einstein-Weyl, generalizing the Jones-Tod correspondence to a\ncontext which also includes Hitchin's construction of selfdual Einstein\nmetrics with Einstein-Weyl conformal infinity~\\cite{Hitchin3}.\n\nThe central part of the paper deals with special cases of this construction.\nIn Theorem II~\\eqref{complex",
    "author": "David M. J. Calderbank"
}