{
    "address": "Saha Institute of Nuclear Physics, Calcutta 700064, India}}\n\n\n\\date{}\n\n\\begin{document}\n\n\n\n\\maketitle \n\n%%%%%%%%%%%%%%%%%%%%%%%%% \n\\section{Motivation}\n%%%%%%%%%%%%%%%%%%%%%%%%%\nNeutrino interactions in strong magnetic fields have gained a lot of\nattention because of the problem of neutrino emission from a\nproto-neutron star. It has been argued that a small asymmetry in the\nneutrino emission can explain the high peculiar velocities of\npulsars. Based on earlier work\\cite{magdisp} on neutrino dispersion\nrelations in an external magnetic field, it has been shown\\cite{KuSe}\nthat neutrino oscillations can probably account for the pulsar\nkicks. On the other hand, there is a parallel stream of argument with\nthe idea that neutrino opacities may change appreciably in magnetic\nfields. Asymmetric opacities can presumably account for the kicks. The\nopacity has recently been calculated by Roulet\\cite{roulet}, assuming\nthe matrix element for the interactions remain unchanged in a magnetic\nfield. He found that the opacities do change appreciably compared to\nthe no-field case. However, he did not find any asymmetry vis-a-vis\nthe direction of the magnetic field. The aim of the present work is to\nredo these calculations from first principles and show that the\nrelevant cross-section is indeed asymmetric.\n\n\n%%%%%%%%%%%%%%%%%%%%%%%%% \n\\section{Solutions of the Dirac equation in a uniform magnetic\nfield}\n%%%%%%%%%%%%%%%%%%%%%%%%%\nWe take the magnetic field $B$ in the $z$-direction, and choose\n%\n\\begin{eqnarray}\nA_0 = A_y = A_z = 0 \\,, \\qquad A_x = -By\\,.\n\\label{A}\n\\end{eqnarray}\n%\nThe Dirac equation in this field can be exactly solved. The energy\neigenvalues are given by\n%\n\\begin{eqnarray}\nE_n^2 = m^2 + p_z^2 + 2neB \\,,\n\\label{En}\n\\end{eqnarray}\n%\nwhere $n$ is a non-negative integer signifying the Landau level. All\n$n>0$ levels are doubly degenerate, whereas the $n=0$ level is\nnon-degenerate. The eigenstates are of the form \n%\n\\begin{eqnarray}\ne^{-ip\\cdot X {\\omit y}"
}