{
    "affiliation": "nter for Astrophysics, 60 Garden St., Cambridge, MA 02138, USA}\n\\author{R. D. Jeffries}\n\\affil{Dept.\\ of Physics, Keele University, Staffordshire, ST5 5BG, UK}\n\\author{E. L. Mart\\'{\\i}n}\n\\affil{Planetary Sciences Division, Caltech 105-21, Pasadena, CA 91125, USA}\n\\author{D. M. Terndrup}\n\\affil{Dept.\\ of Astronomy, Ohio State University, Columbus, OH 43210, USA}\n\n\n% Notice that some of these authors have alternate affiliations, which\n% are identified by the \\altaffilmark after each name.  The actual alternate\n% affiliation information is typeset in footnotes at the bottom of the\n% first page, and the text itself is specified in \\altaffiltext commands.\n% There is a separate \\altaffiltext for each alternate affiliation\n% indicated above.\n\n% The nice thing about this method is that it saves space on the first page!\n\n\n% BUT if you've used \\altaffiltext and you think you'll be adding \n% *footnotes*, then you need to update the footnote counter!\n\n%\\setcounter{footnote}{3}\n\n% The abstract is entered in a LaTeX \"environment\", designated with paired\n% \\begin{abstract} -- \\end{abstract} commands.  Other environments are\n% identified by the name in the curly braces.\n\n\\begin{abstract}\n\nWe provide a review of the current status of several topics on the\nages, distances, and mass functions of open clusters, with a\nparticular emphasis on illuminating the areas of uncertainty.\nHipparcos has obtained parallaxes for nearby open clusters that have\nexpected accuracies much better than has been previously achievable.\nBy using the lithium depletion boundary method and isochrone fitting\nbased on much improved new theoretical evolutionary models for low mass\nstars, it is arguable that we will soon have have much better age\nscales for clusters and star-forming regions.   With improved optical\nand near-IR cameras, we are just now beginning to extend the mass\nfunction of open clusters like the Pleiades into the regime below the\nhydrogen burning mass limit.   Meanwhile, observations in star-forming\nregions are in principle capable of identifying objects down to of\norder 10 Jupiter masses.\n\n\\end{abstract}\n\n% Keywords should be included, but they are not printed in the hardcopy.\n% They will be used by the Editors to help organize poster papers by\n% category though!\n\n\\keywords{stellar ages, stellar masses, open clusters}\n\n% That's it for the front matter.  On to the main body of the paper.\n% We'll only put in tutorial remarks at the beginning of each section\n% so you can see entire sections together.\n\n% \n% OK - to make things easier for the Editors, we're going to put\n% all of our object aliases up front since we only have to declare\n% them once in the paper.  Some people prefer to use NGC 7078 for\n% M 15, but we like good old Messier, so that's what we'll index by.\n% But we'll cross-reference it here so that people who do like NGC 7078\n% won't have to remember that it's also M 15!\n%\n% Remember - we identify objects by putting an asterisk in front of the name!\n%\n\\section{Introduction",
    "author": "R.\\,J. Garc\\'\\i a L\\'opez, R. Rebolo, M.\\,R. Zapatero Osorio, eds.",
    "title": "The eleventh Cool Stars, Stellar Systems and the Sun"
}