{
    "address": "School of Mathematical Sciences,\\\\ Dublin City University,\\\\\nGlasnevin, Dublin 9,\\\\ Ireland.}\n%\\date{\\today}\n\\maketitle\n%\\newpage\n\\begin{abstract}\nThe gravitational strength of the central singularity in spherically symmetric\nspace-times is investigated. Necessary conditions for the singularity to be\ngravitationally weak are derived and it is shown that these are violated in\na wide variety of circumstances. These conditions allow conclusions to be drawn\nabout the nature of the singularity without having to integrate the geodesic \nequations. In particular, any geodesic with a non-zero\namount of angular momentum which impinges on the singularity terminates in a\nstrong curvature singularity. \n\\newline\n\\pacs{PACS: 04.20.Dw, 04.20.Jb, 04.70.-s}\n\\end{abstract}\n\n\\section{Introduction}\nThe theorems of Hawking, Penrose and others predict the occurrence of space-time singularities in a variety of interesting physical situations \\cite{HE}. The singularities which have received the most attention over the last years are those which occur in gravitational collapse and the initial cosmological singularity. It seems fair to say that our understanding of these singularities remains at a preliminary stage; little is known about generic 4-d collapse and correspondingly, generic inhomogeneous cosmological singularities. However much progress has been made on the understanding of these singularities under certain simplifying assumptions, e.g. the assumption of spherical symmetry for black holes or of homogeneity for cosmological singularities. See for example the reviews of \\cite{burko-ori} and \\cite{berger}.\n\nIt is in this context that we analyse a particular feature of singularities, \nnamely their gravitational strength \\cite{tipler}, under the simplifying \nassumption of spherical symmetry. This continues the work initiated in \n\\cite{ssss}, but here we concentrate on the central singularity. The notion of the gravitational strength of a singularity was first introduced by Ellis and Schmidt \\cite{ellis+schmidt} with the aim of distinguishing between singularities which destroy objects impinging upon them and those which do not. A formal mathematical definition was given by Tipler, based on the familiar idea of modelling an object's physical extension using Jacobi fields along its world-line \\cite{tipler",
    "author": "Brien C. Nolan\\footnote{e-mail: nolanb@ccmail.dcu.ie}",
    "title": "The central singularity in spherical collapse"
}