{
    "address": "School of Physics, Georgia Institute of Technology,\nAtlanta, Georgia 30332-0430, USA}\n\n\\date{\\today}\n\\maketitle\n\\begin{abstract}\n\nWe investigate theoretical decoherence effects of the\nmotional degrees of freedom of a single trapped atomic/ionic\nelectronically coded qubit.\nFor single bit rotations from a resonant running wave\nlaser field excitation, we found the achievable\nfidelity to be determined by a single parameter\ncharacterized by the motional states.\nOur quantitative results provide a useful realistic view\nfor current experimental efforts in quantum information and computing.\n\n\\end{abstract}\n\\pacs{03.67.Lx, 89.70.+c, 32.80.-t}\n\n\\narrowtext\n\nSince the pioneering work by Shor \\cite{Shor} on efficient prime factorization\nwith a quantum computer in 1994, we have witnessed an explosive growth of\ninterests in quantum information and computing. Although still largely a\ntheoretical field, solid progress in experimental efforts have been made\nwithin the last few years. Most notably, pure state based\nquantum gate implementation \\cite{nist}, demonstrations of\nquantum teleportation \\cite{tele}, and GHZ state synthesis \\cite{anton}\nhave stimulated more vigorous experimental efforts.\n\nTwo of the most interesting proposals for potentially large scale\nquantum computing were suggested by the same\nInnsbruck group, based on trapped ions \\cite{Cirac}\nand cavity QED with atoms \\cite{Cirac2}. Various\nimplementations of these ideas are actively pursued in many\nexperiments around the world.\nIn their original analysis as presented in \\cite{Cirac,Cirac2},\nindividual qubits are coded in electronic degrees states of atoms/ions,\nand coherent evolution of the system state\nrequires the qubits to be in selected motional pure states.\nExperimentally, one needs to attain the\nstrong binding limit \\cite{side} and cooling to\nthe motional ground state is also required \\cite{monroe}.\nAs is well known, these limits are difficult to maintain\ndue to various decoherence processes \\cite{bf}\nwhich heat up the motional degrees of freedom.\nFurther more, maintaining motional ground state becomes\nproblematic when strong confinement is not satisfied.\nSeveral ideas were proposed recently for computing with\n`hot' qubits \\cite{Cirac3",
    "author": "L. You",
    "title": "Motional effects of single trapped atomic/ionic qubit"
}