{
    "address": "$^a$ FMF, University of Ljubljana and \nJ. Stefan Institute, 1000, Slovenia,\\\\\n$^b$Theory Division,\nLos Alamos National Laboratory, Los Alamos, NM  87545,}\n\\date{\\today}\n\\maketitle\n\\begin{abstract}\\widetext\n\nWe explore the properties of the bipolaron in a 1D Holstein-Hubbard\nmodel with dynamical quantum phonons.  Using a recently developed\nvariational method combined with analytical strong coupling\ncalculations, we compute correlation functions, effective mass, bipolaron \nisotope effect and the phase diagram.  The two site bipolaron has a\nsignificantly reduced mass and isotope effect\ncompared to the on-site bipolaron, and is\nbound in the strong coupling regime up to \ntwice the Hubbard $U$ naively expected.\n%$U_c\\sim 4 \\omega g^2$. \nThe model can be described in this regime as an effective\nt-J-V model with nearest neighbor repulsion.\nThese are the most accurate bipolaron calculations to date.\n%and the first calculation of the bipolaron isotope effect.\n\n\n\\end{abstract}\n\n\\pacs{PACS: 74.20.Mn, 71.38.+i,  74.25.Kc}]\n\n\n\\narrowtext\n\n\nWhile  there  is  a  generally  accepted   belief that  in high  $T_c$\nsuperconductors a dominantly electronic interaction is responsible for\nthe unusually high  transition temperatures, the interplay between the\nelectron-phonon   interaction   and   the  strong    electron-electron\ninteraction nevertheless plays a  significant role in  determining the\nphysical    properties   of   these    strongly   correlated   systems\n\\cite{bishop,alex}.  Although the study of lattice effects in strongly\ncorrelated           materials          is        steadily     growing\n\\cite{grilli,wellein,marsiglio,pao,takada},      the \nunderstanding of the  influence  of  the Hubbard\ninteraction  $U$  on  bipolaron  formation  is  still  incomplete.  In\nparticular, it is known that  in the strong coupling regime bipolarons\nhave an  extremely large effective mass\\cite{kabanov,ranninger}, which\nrepresents one of  the main objections \\cite{ranninger,chakra} against\nthe theory of  small bipolaron superconductivity \\cite{alex1",
    "author": " $^a$J. Bon\\v ca, $^a$T. Katra\\v snik, and  $^b$S. A. Trugman",
    "title": " Mobile Bipolaron"
}