{
    "affiliation": "pt. of Physics and Astronomy, University of New Mexico, 800 Yale\nBlvd, NE, Albuquerque, NM 87131}\n\n\n% Notice that each of these authors has alternate affiliations, which\n% are identified by the \\altaffilmark after each name.  The actual alternate\n% affiliation information is typeset in footnotes at the bottom of the\n% first page, and the text itself is specified in \\altaffiltext commands.\n% There is a separate \\altaffiltext for each alternate affiliation\n% indicated above.\n\n% The abstract environment prints out the receipt and acceptance dates\n% if they are relevant for the journal style.  For the aasms style, they\n% will print out as horizontal rules for the editorial staff to type\n% on, so long as the author does not include \\received and \\accepted\n% commands.  This should not be done, since \\received and \\accepted dates\n% are not known to the author.\n\n\\begin{abstract}\n\nWe present interferometric observations of CO $J=1-0$ emission in the\ncentral regions of the edge-on galaxy NGC 4631, known for its extended\ngaseous halo and its tidal interactions.  Previous single-dish\nobservations revealed that almost all of the CO emission arises from a\ncentral ring or bar-like structure of length $\\sim$ 4 kpc.  We confirm\nthis structure at higher resolution, and find that it is bent at the\ncenter, reflecting the overall bend in this galaxy apparent from\noptical images.  The kinematic evidence favors a rigidly rotating ring\nover a bar.  The gaseous halo emission in several tracers is\nconcentrated above and below this molecular structure.  To the north\nof an emission peak at the eastern end of the structure is an\nextraplanar feature showing filamentary and shell-like properties\nwhich we interpret as an energetic molecular outflow.  The energies\ninvolved are difficult to estimate, but are probably of order\n10$^{54}$ ergs or more.  The CO concentration in the disk below this\nstructure coincides with a bright HII region complex, a peak of radio\nemission, and the brightest X-ray feature in the inner disk of the\ngalaxy seen in a ROSAT HRI map, all suggesting intense star formation.\nA filament of radio continuum emission may also have a footprint in\nthis region of the disk.  The origin of the outflow is unclear.\n\n\\end{abstract",
    "author": "Richard J. Rand",
    "title": "Interferometric $^{12"
}