{
    "address": "Centre for Laser Science, Department of Physics, \\\\\nUniversity of Queensland, QLD 4072, Brisbane, Australia.}\n\\date{\\today}\n\n\\maketitle\n\\begin{abstract}\nWe present a strategy to engineer a simple cavity-QED two-bit universal quantum\ngate using  mesoscopic distinct quantum superposition states. The dissipative\neffect on decoherence and amplitude damping of the quantum bits are analyzed and\nthe critical parameters are presented.\n\\pacs{03.67.-a, 03.67.Lx, 32.80.-t, 42.50.-p}\n\\end{abstract}\n\n\n\\vspace{5mm}\n\n%\\begin{multicols}{2}\n\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n\\section{Introduction}\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n%\nQuantum Mechanics is now fundamental to the modern world we live\nand interact with, not being just the abstract realm of theoretical physics.\nMany new areas of emerging technology depend on the principles contained\nwithin it \\cite{dec}. One of the most striking features of \nquantum systems are superposition states. \nThey have given rise to a large amount of discussion in the literature\n\\cite{despagnat} and now play a central role for the\nrecent developments made in the area of quantum\ninformation. This is due to their possibility to encode\ninformation in a way impossible to be attained by any classical system.\nQuantum computation has become a significant subject within quantum information theory,\ndue to the powerful property of superposition states to execute large\nparallel processing. Quantum information research has also\nimproved significantly the understanding about the quantum systems involved on\nthe factual realisation of a quantum computer\nand has raised many interesting \nproblems such as in the encoding of information\n\\cite{inf}, entanglement of states \\cite{entang} and quantum cryptography\n\\cite{cryp}.\n\n\n\nA number of core technologies are currently under investigation for\nconstructing a quantum computer which is necessary to  fully implement \nquantum algorithms. These\ninclude ion-traps\\cite{wineland,wineland2}, cavity QED\\cite{sleator,domokos,nogues}, solid \nstate\\cite{kane,vrijen} and \nliquid state NMR\\cite{chuang} to name but a few.\nThe proposals to engineer a quantum computer or as a first step a single\nlogic gate in the realm of quantum optics are generally based on discrete\natomic states and cavity field number states of zero and one photons.\nA central proposal which has gained much attention in recent years is \nthe Cirac and\nZoller \\cite{zoller} trapped ions scheme to encode a n-conditional gate.\nWe also cite the proposals of Sleator and Weinfurter \\cite{sleator} \nand of Domokos {\\it\net al.}\\cite{domokos",
    "author": "M. C. de Oliveira\\cite{marcos} and W. J. Munro",
    "title": "Quantum computation with mesoscopic superposition states"
}