{
    "address": "Department of Physics and Astronomy, University of Basel,\n Klingelbergstrasse 82, CH-4056 Basel, Switzerland}\n\\date{\\today}\n\\maketitle\n\n\\begin{abstract}\n\nWe study a double quantum dot each dot of which is tunnel-coupled to\nsuperconducting leads.  In the Coulomb blockade regime, a\nspin-dependent Josephson coupling between two superconductors is\ninduced, as well as an antiferromagnetic Heisenberg exchange coupling\nbetween the spins on the double dot which can be tuned by the\nsuperconducting phase difference. We show that the correlated spin\nstates---singlet or triplets---on the double dot can be probed via the\nJosephson current in a dc-SQUID setup.\n\n\\end{abstract}\n\\pacs{PACS numbers: 73.23.-b, 73.23.Hk, 74.50.+r}\n\n%73.23.-b Mesoscopic systems\n%73.23.Hk Coulomb blockade; single-electron tunneling\n%74.50.+r Proximity effects, weak links, tunneling phenomena, and Josephson\n%effects\n]\n\nIn recent years, electronic transport through strongly interacting\nmesoscopic systems has been the focus of many investigations\n\\cite{curacao}. In particular, a single quantum dot coupled via tunnel\njunctions to two non-interacting leads has provided a prototype model\nto study Coulomb blockade effects and resonant tunneling in such\nsystems. These studies have been extended to an Anderson impurity\n\\cite{Glazma89} or a quantum dot coupled to superconductors\n\\cite{Ralph95,Levy97,Rozhko99}. In a number of\nexperimental\\cite{Ralph95} and theoretical \\cite{Levy97} papers, the\nspectroscopic properties of a quantum dot coupled to two\nsuperconductors have been studied. Further, an effective dc Josephson\neffect through strongly interacting regions between superconducting\nleads has been analyzed \\cite{Matveev93,Bauern94,Fazio96,Siewert96}.\nMore recently, on the other hand, research on the possibility to\ncontrol and detect the spin of electrons through their charges has\nstarted. In particular in semiconducting nanostructures, it was found\nthat the direct coupling of two quantum dots by a tunnel junction can\nbe used to create entanglement between spins \\cite{Lossxx98}, and that\nsuch spin correlations can be observed\n\n\\begin{figure}\\centering\n%\\epsfig{file=sdds_fig1.eps,clip=,width=5.5cm}\n\\epsfig{file=sdds/fig1.eps,clip=,width=5.5cm",
    "author": "Mahn-Soo Choi, C. Bruder, and Daniel Loss"
}