{
    "address": "${}^{\\dag}$Department of Physics and Center for\nComputational Science,\\\\ Boston University, Boston, MA 02215}\n\n\\address{${}^{\\pm}$Department of Physics, Clark University,\nWorcester, MA 01610}\n\n\\address{${}^{\\star}$Department of Physics, Kalamazoo College,\nKalamazoo, MI 49006}\n\n\\address{${}^{\\S}$CIC-3, Los Alamos National Laboratory, Los Alamos,\nNM 87545}\n\n\\maketitle\n\n\\begin{abstract}We show that the structure of the fluctuations\nclose to spinodals and\n\\mf\\ critical points is qualitatively different than the\nstructure close to non-mean-field critical points. This difference\nhas important implications for many areas including the formation of\nglasses in supercooled liquids. In particular, the divergence of\nthe measured static structure function in\n\\nmf\\ systems close to the glass transition is suppressed relative\nto the\n\\mf\\ prediction in systems for which a spatial symmetry is broken.\n\\end{abstract}\n\n\\pacs{64.70.Pf, 05.70.Jk, 64.60.Fr, 64.60.My}\n\n]\n\nThe structure of the fluctuations near critical points and spinodals\nand their relation to the behavior of quantities\nobserved in experiments and simulations is important for\nunderstanding the properties of many materials. For \ncritical phenomena in non-mean-field Ising systems this relation was\nfound by mapping the thermal critical point onto a percolation\ntransition~\\cite{KF,CK}. In these systems the properties of the\nclusters at the percolation threshold are identical to those of\nthe fluctuations at the thermal critical point. In particular, the\nmean cluster diameter is the correlation length, the density of the\nspanning cluster scales as the order parameter, and the mean\nnumber of sites in the spanning cluster is the\nsusceptibility~\\cite{CK,ahrostauff}.\n\nFor mean-field Ising models there is a line of spinodal critical\npoints as well as the usual critical point. These \\mf\\ thermal\nsingularities also can be mapped onto percolation\ntransitions\\cite{wk1}, but the relation between percolation\nclusters and critical fluctuations is qualitatively different. This\ndifference has important consequences for supercooled \\mf\\\nliquids, which also exhibit spinodals\\cite{gk}, and for\n``near-mean-field'' systems, which are characterized by long, but\nfinite range interactions and which exhibit many of the\ncharacteristics of\n\\mf\\ systems including pseudospinodals. Many dense systems with\nshort-range interactions exhibit\n\\nmf\\ behavior under certain\ncircumstances\\cite{wk1,hks,johnson,yang",
    "author": "W.\\ Klein,${}^{\\dag}$ Harvey Gould,${}^{\\pm"
}