{
    "address": "\nDepartment of Physics, Georgetown University, \\\\\n Washington, D.C. 20057-0995, U.S.A. }\n\\maketitle\n\\begin{abstract}\n{\\sloppy \nWe formulate a fully self-consistent, microscopic model to study the \nretardation and correlation effects of the barrier within a Josephson junction. \nThe junction is \ndescribed by a series of planes, with electronic correlation included through \na local self energy for each plane. \nWe calculate current-phase relationships for various junctions, which include \nnon-magnetic impurities in the barrier region, \nor an interfacial scattering potential. \nOur results indicate that the linear response of the supercurrent to phase \nacross the barrier region is a good, but not exact indicator of the critical \ncurrent. Our calculations of the local density of states show the \ncurrent-carrying Andreev \nbound states and their energy evolution with the phase difference across \nthe junction. \n\nWe calculate the figure of merit for a Josephson junction, which is the \nproduct of the critical current, $I_{c}$, \nand the normal state \nresistance, $R_{N}$, for junctions with different barrier materials. \nThe normal state resistance is calculated using \nthe Kubo formula, for a system with zero current flow and no superconducting \norder. Semiclassical \ncalculations would predict that these two quantities are determined by the \ntransmission probabilities of electrons in such a way that the product \nis constant for a given superconductor at fixed temperature. \nOur self-consistent solutions for different types of barrier indicate that \nthis is not the case. We suggest some forms of barrier which could increase \nthe $I_{c}R_{N}$ product, and hence improve the frequency response of a \nJosephson device.\n}\n\\end{abstract}\n\n\\pacs{74.50.+r,74.80.Fp,73.20.-r,73.40.-c}\n\n\\section{Introduction}\n\nSome of the most successful and most promising electronics \napplications of superconductors \ninvolve Josephson junctions, where two superconducting regions are coupled \nthrough a barrier region, made from a non-superconducting material~\\cite{Jose",
    "author": " P. Miller and J. K. Freericks "
}