{
    "address": "Instituto de F\\'{\\i}sica, Universidade de \nS\\~ao Paulo, C. P. 66.318, 05315-970 S\\~ao Paulo, Brazil}%\n\\thanks{On leave of absence from : Secci\\'{o}n F\\'{\\i}sica, Departamento de Ciencias, Pontificia Universidad Cat\\'olica del Per\\'u,\nApartado 1761, Lima, Per\\'u.}\nH. Nunokawa\\address{Instituto de F\\'{\\i}sica Gleb Wataghin, \n    Universidade Estadual de Campinas, 13083-970 Campinas, Brazil}\nand \nR. Zukanovich Funchal$^{\\mbox{\\scriptsize a}}$}\n\n\\begin{document}\n\n\\begin{abstract}\nWe have found that long-wavelength neutrino oscillations induced \nby a tiny breakdown of the weak equivalence principle of general \nrelativity can provide a viable solution to the solar neutrino problem.\n%\\vspace{1pc}\n\\end{abstract}\n            \n\\maketitle\n\n\n\\section{INTRODUCTION}\n\nNeutrinos have had, since their childhood in the early 30's, profound\nconsequences on our understanding of the forces of nature. In the past they\nled to the discovery of neutral currents and provided the first indication\nin favour of the standard model of electroweak interaction. They may be today\nat the very hart of yet another breakthrough in our perceptions of the\nphysical world.   \n\nToday the results coming from solar neutrino \nexperiments~\\cite{homestake,sage,gallex,sk99} as well as \nfrom atmospheric neutrino experiments~\\cite{atmospheric} \nare difficult to be understood without admitting neutrino flavour\nconversion. Nevertheless the dynamics underlying such conversion \nis yet to be established and in particular does not have to be a priori \nrelated to the electroweak force. \n\nThe interesting idea that gravitational forces may induce neutrino mixing \nand flavour oscillations, if the weak equivalence principle\nof general relativity is violated, was proposed  \nabout a decade ago~\\cite{gasper,hl}, \nand thereafter, many works have been performed on this\nsubject~\\cite{muitas",
    "author": "A. M. Gago\\address{Instituto de F\\'{\\i"
}