{
    "address": "The Center for Laser Sciences, Department of Physics,} \n\\address{The University of Queensland, St. Lucia, Brisbane, Qld 4072,Australia} \n\\date{May 3, 2000}\n\\maketitle  \n\\begin{abstract} \n\nWe consider continuous observation of the\nnonlinear dynamics of single atom trapped in an optical cavity  by a standing wave\nwith intensity modulation. The motion of the atom changes the phase of the\nfield which is then monitored by homodyne detection of the output field. We\nshow that the conditional Hilbert space dynamics of this system, subject to\nmeasurement induced perturbations, depends strongly on whether the\ncorresponding classical dynamics is regular or chaotic. If the classical\ndynamics is chaotic the distribution of conditional Hilbert space vectors\ncorresponding to different observation records tends to be orthogonal. This is\na characteristic feature of hypersensitivity to perturbation for quantum\nchaotic systems.  \n\\end{abstract} \n\\pacs{}   \n\\narrowtext \n\n\\section{Introduction}\nThe study of quantum nonlinear dynamics, especially systems which classically\nexhibit Hamiltonian chaos, has recently begun to focus on the response of such\nsystems to external sources of noise and decoherence\\cite{Zurek94,Schack94}.\nThis direction was prompted by the observation that nonintegrable classical\nsystems, when quantized will exhibit dynamics that departs from that expected\nclassically on a very short time scale\\cite{Fishman82,Shepelyansky86,Chirikov89},\nso short that even macroscopic\nsystems should show observable quantum features in their motion\\cite{Zurek}. \nThere have now been numerous experimental observations of the short time\ndeviations between quantum and classical dynamics of nonlinear\nsystems\\cite{Galvez88,Bayfield89,Arndt91,Moore95}. The nonlinear dynamics of\ncold atoms in optical dipole potentials has proved to be a particularly fertile\nfield for quantum nonlinear dynamics. Recently the effects of decoherence in\nquantum chaotic dynamics was studied using cold atoms\n\\cite{Klappauf1,Klappauf2,Ammann98}.  However in all experimental observations\nso far, the results were obtained from an ensemble of systems, not from\nrepeated observations on a single quantum system. Recent progress in single\natom dynamics in small optical cavities\\cite{Ye} indicate that it will soon be\npossible to study the quantum nonlinear dynamics of a single quantum system\nsubject to repeated measurements\\cite{doherty99} and it is towards describing\nsuch systems that this paper is directed.  \n\nIt is in the context of such single\nsystem dynamics that the information approach of Schack and Caves\\cite{Schack",
    "author": "X.~M.~Liu , M.~Hug , and G.~J.~Milburn"
}