{
    "affiliation": "rro Tololo Interamerican\nObservatory, Casilla 603, La Serena, Chile\\\\ rblum@noao.edu}\n\n\\author{P. S. Conti} \\affil{JILA, University of Colorado\\\\Campus Box\n440, Boulder, CO, 80309\\\\pconti@jila.colorado.edu}\n\n\\author{A. Damineli}\n\\affil{ IAG-USP, Av. Miguel Stefano 4200, 04301-904, S\\~{a}o Paulo, Brazil\n\\\\damineli@iagusp.usp.br}\n\n\\altaffiltext{1}{Visiting Astronomer, Cerro Tololo Interamerican\nObservatory, National Optical Astronomy Observatories, which is\noperated by Associated Universities for Research in Astronomy, Inc.,\nunder cooperative agreement with the National Science Foundation}\n\n\\begin{abstract}\n\nWe present near infrared $J$, $H$, and $K$ images and $K-$band spectroscopy\nin the giant H~II region W42. A massive star cluster is revealed; \nthe color--color plot and $K-$band \nspectroscopic morphology of two of the brighter objects suggest the\npresence of young stellar objects. The spectrum of\nthe bright central star is similar to unobscured stars with MK \nspectral types of O5--O6.5. If this star is on the zero age main \nsequence, then the derived spectrophotometric distance\nis considerably smaller than previous estimates. The \nLyman continuum luminosity of the cluster is a few times that of the\nTrapezium. The slope of the $K-$band luminosity function is similar to\nthat for the Trapezium cluster and significantly steeper than that for\nthe massive star cluster in M17 or the Arches cluster near the Galactic center. \n\n\\end{abstract}\n\n\\keywords{H~II regions --- \ninfrared: stars --- stars: early--type --- stars: fundamental\nparameters --- stars: formation}\n\n\\section{INTRODUCTION}\n\nIn this paper we continue the exploration of the stellar content of \nobscured Galactic\ngiant H~II regions begun by \\citet[ hereafter Paper I]{bdc99}. \n$J$, $H$, and $K$ images are used to make a broad assessment of the stellar\ncontent of obscured star forming regions in the Milky Way. Infrared spectroscopy\nfollows, providing details of the brightest cluster members which can be\nused to make distance, mass, and luminosity estimates. \nThe spectra\nare placed in proper context by comparison to new infrared spectral \nclassification systems for massive stars \\citep{hcr96, brcfs97, fmn97,\nhrl98}. The known hot star content of the Galaxy is rapidly expanding \non the strength of the sophisticated infrared detector gains of the last\n10 years. \\cite{hhc97",
    "author": "R. D. Blum\\altaffilmark{1}",
    "title": "The Stellar Content of Obscured Galactic Giant H~II Regions: II. W42"
}