{
    "address": "\n$^1$Department of Materials and Interfaces,\nWeizmann Institute of Science,\nRehovot 76100, Israel\n}\n\n\\address{\n$^2$School of Physics and Astronomy,\nRaymond and Beverly Sackler Faculty of Exact Sciences, \\\\\nTel Aviv University, Ramat Aviv 69978, Tel Aviv, Israel\n}\n\n\n\\date{\\today}\n\\maketitle\n\n\n\n\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n%  Abstract  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n\n\n\\begin{abstract}\nAdhesion between membranes is studied using a phenomenological model,\nwhere the inter-membrane distance is coupled to the\nconcentration of sticker molecules on the membranes.\nThe model applies to both adhesion of two flexible membranes and\nto adhesion of one flexible membrane onto a second membrane\nsupported on a solid substrate.\nWe mainly consider the case where the sticker molecules form bridges\nand adhere directly to both membranes.\nThe calculated mean-field phase diagrams show an upward shift of the\ntransition temperature indicating that the lateral phase separation\nin the membrane is {\\it enhanced} due to the coupling effect.\nHence the possibility of adhesion-induced lateral phase separation\nis predicted.\nFor a particular choice of the parameters, the model exhibits a\ntricritical behavior.\nWe also discuss the non-monotonous shape of the inter-membrane\ndistance occurring when the lateral phase separation takes place.\nThe inter-membrane distance relaxes to the bulk values with two\nsymmetric overshoots.\nAdhesion mediated by other types of stickers is also considered.\n\\end{abstract}\n\\pacs{87.22.Bt, 68.10.-m, 82.70.-y}\n\n\n\n\n%\\begin{multicols}{2}\n%\\narrowtext\n%%%%%%%%%%%%%%%%%%\n%  Introduction  %\n%%%%%%%%%%%%%%%%%%\n\\section{Introduction}\n\\label{sec:intro}\n\n\nAdhesion of membranes and vesicles has attracted considerable\nexperimental and theoretical interest because of its prime importance\nto many bio-cellular processes \\cite{Alberts,Sackmann}.\nTheoretical treatments of membranes composed of single component\nlipid bilayers have revealed that generic interactions such as van der\nWaals, electrostatic or hydration interactions govern the adhesive\nproperties of interacting membranes.\nIt is also worthwhile to mention that\nrelated phenomena are found in  unbinding transition of nearly\nflat membranes \\cite{LL} or adhesion of vesicles to surfaces \\cite{SL}.\n\n\nIn addition to general non-specific interactions\nmentioned above, it is known from the works of Bell and coworkers\n\\cite{Bell,BDB} as well as others \\cite{Evans},\nthat highly\nspecific molecular interactions play an essential role in\nbiological adhesion.\nThis interaction acts between complementary pairs of proteins\nsuch as ligand and receptor, or antibody and antigen.\nWell studied example of such coupled systems is the biotin-avidin complex.\nThe avidin molecule has four biotin binding sites, two on each side,\nand forms a five-molecules biotin-avidin-biotin complex.\nThe resulting specific interaction is highly\nlocal and short-ranged.\nMeasurements by surface force apparatus \\cite{LISK} or atomic force\nmicroscopy \\cite{FMG,MFG} have shown that the  force required to\nbreak a biotin-avidin bond is about 170pN.\nIn related experiments measuring chemical equilibrium constants \\cite{M},\nit was found that\nthe biotin-avidin binding energy is about 30--35 $k_BT$ which is larger\nthan thermal fluctuations. Other coupled systems are those of selectins and\ntheir sugar ligands where the bond is much weaker, of the order of\n5$k_B T$ \\cite{ZB95,ZB98}.\n\n\nMore recently several models taking into account thermal fluctuations in\nmembrane adhesion have been proposed. Zuckerman and Bruinsma\n\\cite{ZB95,ZB98} used a statistical mechanics model which is  mapped\nonto a two-dimensional Coulomb plasma with attractive interactions.\nThey predicted an enhancement of the membrane adhesion due to thermal\nfluctuations.\nIn another work, Lipowsky considered the adhesion of lipid\nmembranes which includes anchored stickers, {\\it i.e.}, anchored molecules\nwith adhesive segments \\cite{Lipowsky96,Lipowsky97}. It was shown that\nflexible membranes can adhere if the sticker concentration exceeds a\ncertain threshold.\nIf the multi-component membranes, including lipids and\nsticker molecules, undergo a phase separation, the adhesion is dominated\nby the sticker-rich domains.\nFurther studies in this direction using\nmean-field theory and Monte Carlo simulations \\cite{WNL",
    "title": "Adhesion-induced lateral phase separation in membranes"
}