{
    "address": "Center for Gravitational Physics and Geometry,\n104 Davey Laboratory, The Pennsylvania State University,\nUniversity Park, PA 16802-6300, U.S.A.\\\\\n{\\tt hayward@gravity.phys.psu.edu}}\n\\date{21st January 2000}\n\\maketitle\n\\begin{abstract}\nA quasi-spherical approximation scheme,\nintended to apply to coalescing black holes,\nallows the waveforms of gravitational radiation to be computed \nby integrating ordinary differential equations.\n\\end{abstract}\n\\pacs{04.30.-w, 04.25.-g, 04.70.Bw, 04.20.Ha}\n\nThe coalescence of binary black holes is expected to be \none of the main astrophysical sources for upcoming gravitational-wave detectors.\nThe initial phase of inspiral and the final phase of ringdown are understood\nin terms of post-Newtonian and close-limit approximations respectively,\nbut the coalescence is only qualitatively understood and generally thought \nto be tractable only by numerical methods\\cite{BBH1,BCT,P,BBH2}.\nConsiderable problems have been encountered \nand currently there are no reliable predictions of waveforms.\n\nThis article presents an approximation scheme \nto compute the gravitational waveforms \nfor space-times close to spherical symmetry.\nThis is intended to apply to binary black holes once they have coalesced,\ni.e.\\ when a marginal surface encloses both sources.\nThe quasi-spherical approximation will be best when \nthe angular momentum is small,\nbut note that \neven the maximally rotating Kerr black hole is $70\\%$ spherically symmetric \naccording to the ratio of the areal and equatorial radii of the horizon.\nThus rough estimates may still be possible \neven for appreciable angular momentum.\n\nThe basic idea of a quasi-spherical approximation \nis to make a 2+2 decomposition of the space-time \nand linearize only those parts of the extrinsic curvature \nwhich vanish in spherical symmetry, cf.\\ Bishop et al.\\cite{BGLW}.\nThus when the linearized fields vanish, spherical symmetry is recovered in full.\nThis can be a highly dynamical situation; \nthere will be no assumption of quasi-stationarity.\nLikewise, there will be no assumption of an exactly spherical background.\nUnlike previous work on null-temporal formulations\\cite{BBH2,BGLW,BGLMW,W},\na dual-null formulation is adopted here,\ni.e.\\ a decomposition of the space-time \nby two intersecting foliations of null hypersurfaces.\nThis is adapted to the radiation problem in that \nthe imposition of no ingoing radiation \nand the extraction of the outgoing radiation are immediate.\nIt also allows a remarkable simplification \nfrom partial to ordinary differential equations.\n\nA general Hamiltonian theory of dual-null dynamics\\cite{dn} \nhas been applied to Einstein gravity\\cite{dne} and is summarized as follows.\nDenoting the space-time metric by $g$\nand labelling the null hypersurfaces by $x^\\pm$, \nthe normal 1-forms $n^\\pm=-dx^\\pm$ therefore satisfy\n\\begin{equation}\ng^{-1",
    "author": "Sean A. Hayward",
    "title": "Gravitational waves from quasi-spherical black holes"
}