{
    "address": "Graduate School of Human and Environmental Studies, \n          Kyoto University, \\\\\n  Sakyo-ku, Kyoto 606--8501, Japan\n}\n\n\\author{Jiro SODA\n\\footnote{E-mail: jiro@phys.h.kyoto-u.ac.jp}\n}\n\\address{Department of Fundamental Sciences, FIHS,\n          Kyoto University, \\\\\n  Sakyo-ku, Kyoto 606--8501, Japan\n}\n\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n\n\\abstract{\nFor the BTZ black hole in the Einstein gravity, a statistical \nentropy has been calculated to be equal to the Bekenstein-Hawking \nentropy. In this paper, its statistical entropy in the higher \ncurvature gravity is calculated and shown to be equal to the one \nderived by using the Noether charge method. This suggests that the \nequivalence of the geometrical and statistical entropies of the \nblack hole is retained in the general diffeomorphism invariant \ntheories of gravity. A relation between the cosmic censorship \nconjecture and the unitarity of the conformal field theory on the \nboundary of $AdS_3$ is also discussed. \n}\n\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n\n\\section{Introduction}\\label{sec-intro}\n\nThe profound understanding of the black hole thermodynamics is a \nclue for approaching the quantum gravity. Although the final form of \nthe quantum gravity is covered with a veil of mystery, it would be \nlegitimate to regard the diffeomorphism invariance as the key to the \nmystery. Hence the black hole thermodynamics in the diffeomorphism \ninvariant theories of gravity should be studied to obtain the \ninsights into the quantum gravity. The first law of black holes in \nsuch theories of gravity has already been established \\cite{ref-IW1} \n\\cite{ref-JKM1}. The zeroth and second laws, especially in the \nhigher curvature gravity, have been investigated, for example in \nref. \\cite{ref-JKM2}. All the black hole entropies treated in the \nabove works are of the integral of geometrical quantities on a \nspatial section of the event horizon. The geometrical entropy in an \nN-dimensional higher curvature gravity can be calculated by using \nthe Noether charge method \\cite{ref-IW1} \n\\cite{ref-JKM1} to give\n  \\sikib\n    S_{IW} =\n      -\\frac{1}{8G} \\oint_{H} dx^{N-2} \\sqrt{h} \\,\n      \\frac{ \\maru f }{ \\maru R_{\\mu\\nu\\al\\be} } \\,\n      \\epsilon_{\\mu\\nu}\\epsilon_{\\al\\be} \\, ,\n  \\label{eq-I1}\n  \\sikie\nwhere $H$ is the spatial section of the event horizon, $h$ is the \ndeterminant of the induced metric on $H$, $f$ is the higher \ncurvature Lagrangian and $\\epsilon_{\\mu\\nu}$ is the binormal to \n$H$ \\cite{ref-JKM1"
}