{
    "address": "A.C.: Institut f\\\"ur Mathematik, Universit\\\"at Wien,\nStrudlhofgasse~4, A--1090 Wien, Austria, and International Erwin\nSchr\\\"odinger Institute for Mathematical Physics, Boltzmanngasse 9, A-1090\nWien, Austria\\newline\\indent J.S.: Department of Algebra and Geometry,\nMasaryk University, Jan\\'a\\v ckovo n\\'am. 2a, 662~95~Brno, Czech Republic}\n\n\\email{Andreas.Cap@esi.ac.at, slovak@math.muni.cz}\n\n\\begin{abstract}\nMotivated by the rich geometry of conformal Riemannian manifolds and\nby the recent development of  geometries modeled on homogeneous spaces\n$G/P$ with $G$ semisimple and $P$ parabolic,  Weyl structures and\npreferred \nconnections are introduced in this general framework. In particular, we\nextend the notions of scales, closed and exact Weyl connections, and\nRho--tensors, we characterize the classes of such objects, and we use the\nresults to give a new description of the Cartan bundles and connections for all\nparabolic geometries.\n\\end{abstract}\n\n\\subjclass{53C15, 53A40, 53A30, 53A55, 53C05}\n\\maketitle\n\\section{Introduction}\\label{1}\n\nCartan's generalized spaces are curved analogs of the homogeneous\nspaces $G/P$ defined by means of an absolute parallelism on a principal\n$P$--bundle. This very general framework was originally built in connection\nwith the equivalence problem and Cartan's general method for its\nsolution, cf. e.g. \\cite{Cartan-conf}. Later on, however, these ideas got\nmuch more attention. In particular, several well known geometries were\nshown to allow a canonical object of that type with suitable choice of\nsemisimple $G$ and parabolic $P$, see e.g. \\cite{Kob}. Cartan's original \napproach was generalized and extended for all such groups, cf. \n\\cite{Tan, Mor, Yam, CS}, and links to other areas were discovered, see e.g.\n\\cite{BE, Bas, CheM}. The best known examples are the conformal Riemannian, \nprojective, almost quaternionic, and CR structures and the common name\nadopted is {\\em parabolic geometries\\/}.\n\nThe relation to twistor theory renewed the interest in a good\ncalculus for such geometries, which had to improve the techniques in\nconformal geometry and to extend them to other geometries. \nMany steps in this direction were done, see for \nexample \\cite{Tho1,Tho2, Wuensch, Gov2} for classical methods \nin conformal geometry, and \\cite{BEG, BaiE, Gov1, Gov3, Gov4} for\ngeneralizations. \n\nA new approach to this topic, motivated mainly by \\cite{Och, Bas, BE}, was\nstarted in \\cite{CSS1-3, CSS4}. The novelty consists in the combination of\nLie algebraic tools with the frame bundle approach to all objects and we\ncontinue in this spirit here. Our general setting for Weyl structures and \nscales has been also inspired by \\cite{BaiE, Gau}.\n\nIn Section \\ref{2} we first outline some general aspects of parabolic\ngeometries and then we present the basic objects like tangent and cotangent\nbundles and the curvature of the geometry in a somewhat new perspective.\nThis will pave our way to the Weyl structures in the rest of the paper. Our\nbasic references for Section \\ref{2} are \\cite{CS} and \\cite{Sl-notes}, the\nreader may also consult \\cite{CSS4}.  For the classical point of view of\nover--determined systems, we refer to \\cite{Tan, Yam} and the references \ntherein.\n\nThe Weyl structures are introduced in the beginning of Section \\ref{3",
    "author": "Andreas \\v Cap and Jan Slov\\'ak",
    "title": "Weyl structures for parabolic geometries"
}