{
    "address": "1. Department of Physics, University of Kaiserslautern, D-67653 Kaiserslautern, Germany\\\\\n2. Institute of Theoretical Physics and Department of Physics, Shanxi University, Taiyuan, Shanxi 030006, People's Republic of China\\\\\n3. Department of Physics, Kyungnam University, Masan, 631-701, Korea\\\\\n4. Institute of Physics and Center for Condensed Matter Physics, Chinese Academy of Sciences, Beijing 100080, People's Republic of China and Department of Physics,\nGuangzhou Normal College, Guangzhou 510400, People's Republic of China}\n\\maketitle\n\n\\begin{abstract}\nThe point--particle--like Hamiltonian of a biaxial spin\n particle with external magnetic field along the hard axis is obtained in terms of the potential field description of\nspin systems with exact spin--coordinate correspondence. The Zeeman energy term turns out to be an effective gauge potential which  leads to a nonintegrable phase of \nthe Euclidean Feynman propagator.\n The phase interference\nbetween clockwise and anticlockwise\n under barrier propagations  is recognized explicitly as the Aharonov-Bohm\neffect. An additional phase which is significant for quantum phase interference is discovered with the quantum theory of spin systems besides the known\n phase obtained with the semiclassical treatment of spin. We also show the energy dependence of the effect and obtain the tunneling splitting at excited \nstates with the help of periodic instantons.\n\\end{abstract}\n\\begin{center}\n PACS numbers 75.10.Jm, 75.30.Gw, 03.65.Sq, 75.45.+j, 11.10.Ef\n\\end{center}\n\\section{Introduction}\n\\label{sec:1}\nQuantum tunneling in spin systems\n has attracted considerable attention\n both theoretically and experimentally\n in view of a possible experimental test of the tunneling effect\nfor mesoscopic single domain particles in\n which case it is known\n as macroscopic quantum\n tunneling\\cite{leggett,gunther",
    "author": "J.--Q. Liang$^{1,2}$\\footnote{e-mail:jqliang@mail.sxu.edu.cn",
    "title": "Quantum Phase Interference  for Quantum Tunneling in Spin Systems"
}