{
    "address": "$^1$Dipartimento di Fisica, Universit\\`a di Milano,\n\t Via Celoria 16, I-20133 Milano, Italy}\n\n\\address{$^2$INFM, Sezione di Milano, Via Celoria 16, I-20133 Milano, Italy}\n\n\\address{$^3$INFN, Sezione di Milano, Via Celoria 16, I-20133 Milano, Italy}\n\n\\address{$^4$The Niels Bohr Institute, University of Copenhagen,\n\t D-2100 Copenhagen, Denmark}\n\n\\address{$^5$Istituto Nazionale per la Fisica della Materia -\n\t Dipartimento di Fisica dell' Universit\\`a di Roma Tor Vergata,\n\t Via della Ricerca Scientifica, I--00133 Roma, Italy}\n\n\\date{\\today}\n\\maketitle\n\n\\begin{abstract}\nThe matrix elements of the deformation potential of C$_{70}$ are calculated\nby means of a simple, yet accurate solution of the electron-phonon\ncoupling problem in fullerenes, based on a parametrization of the\nground state electronic density of the system in terms of $sp^{2+x}$ \nhybridized orbitals.\nThe value of the calculated dimensionless \ntotal electron-phonon coupling\nconstant is $\\lambda\\approx0.1$, an order of magnitude smaller than in \nC$_{60}$, consistent with the lack of a superconducting\nphase transition in C$_{70}$A$_3$ fullerite, and in overall\nagreement with measurements of the broadening of Raman peaks in C$_{70}$K$_4$. \nWe also calculate the photoemission cross section of C$_{70}^-$, which is\nfound to display less structure than that associated with C$_{60}^-$, in \noverall agreement with the experimental findings.   \n\\end{abstract}\n\n\\bigskip\n\\leftline{PACS: 74.70.Wz, 63.20.Kr, 33.60.-q, 61.48.+c}\n\n\\newpage\n\\section{Introduction}\nThe discovery that some alkali-doped C$_{60}$ compounds are superconducting\n\\cite{Flemin,Hebard,Hokzer,Rossem,Taniga} with a transition temperature as\nhigh as 40 K for the fulleride C$_{60}$Cs$_3$ under pressure \n\\cite{Palstr} has triggered considerable interest in the study of\nfulleride doped materials at low temperatures. Much effort has been\nconcentrated in trying to understand whether such large values of $T_c$ can\nbe caused by the coupling of electrons to phonons. The electron-phonon\ncoupling constants for C$_{60}$ have been estimated both from experiments \n\\cite{Winter} and calculations \\cite{Gunnar}. There exists some consensus on \nthe fact that C$_{60}$ compounds are\n$s-$wave BCS-like superconductors driven by the coupling to selected\nintramolecular phonons \\cite{Gunnar}. On the other hand, no calculation of this \ncoupling exists in the literature for the case of C$_{70}$. \nSince the associated alkali compounds display no superconductivity, \nwith a smooth and continuous behavior of the resistivity down to \nabout 1 K~\\cite{Wang}, it is an important issue \nto compare the electron-phonon coupling constant for C$_{70}$ with those of \nC$_{60}$.\n\nIn the present paper we address this problem from a theoretical point of view,\ncomputing the deformation potential of C$_{70}$ and\nextracting the associated total electron--phonon coupling constant, $\\lambda$.\nIt will be concluded that the resulting value of $\\lambda$ is much smaller \nthan in C$_{60}$, essentially ruling out the possibility of a superconducting\nphase at low temperatures for doped fullerides built out of C$_{70}$. \n\nThis negative result, which can be understood in rather general, qualitative \nstructural terms, as well discussed at the end of Sec. III, has two positive\noucomes: first, it provides further evidence for the $s-$wave BCS-like \nmechanism at the basis of alkali-doped fullerides superconductivity. Second, it\nsheds light on the properties fullerenes have to exhibit to be ``good'' building \nblocks of eventual organic superconductors, indicating the direction of the \nhighly symmetric, small fullerenes (cf. also Refs.~\\cite{Cot98,Dev98",
    "author": "D. Provasi$^{1}$, N. Breda$^{1,2}$, R.A. Broglia$^{1,3,4",
    "title": "Electron-phonon interaction in C$_{70}$"
}