{
    "address": "\nNicolaus Copernicus Astronomical Center,\nBartycka 18, 00-716 Warszawa,Poland}\n\n%\\lefthead{LEFT head}\n%\\righthead{RIGHT head}\n\\maketitle\n\n\n\\begin{abstract} \nWe use a  stellar binary population synthesis\ncode to find the lifetimes and velocities of  several types of\npossible GRB progenitors: double neutron stars, black hole\nneutron stars, black hole white dwarfs, helium star mergers. \nAssuming that they are born in different types of galaxies we\ncompute their spatial distribution and compare it  with the\nobserved locations of GRB afterglows within  their hosts. We \ndiscuss constraints on the compact object merger model of GRBs\nimposed by this comparison and find that the observations of\nafterglows and their host galaxies appear inconsistent with the\nGRB compact object merger model.\n \\end{abstract}\n\n\n\n\\section*{Introduction}\n\nIn the last few years the astronomical community has moved much\ncloser to unveiling the nature  of GRBs. The discovery of\nafterglows and identification of host  galaxies for several\nbursts clearly links GRBs to  some type of \n stellar events. Yet the nature of\nthese events is unknown, and we still do not know what the GRB\ncentral engines are. Observations of GRB host galaxies and\nprecise locations of  GRBs within hosts provide a tool to test\nsome of the possible central engine models. In this paper we\ndiscuss the consistency between the current observations and the\nresults of binary  population synthesis. \n\n\n\n\n\\section*{The Model}\n\nThe population synthesis code used here is described in\n\\cite{bbrhere}. One of the most important parameter\ndeterimining the properties of the populations of binaries is\nthe kick velocity a newly formed compact object receives at \nbirth. However, several studies  \\cite{cordeschernoff,fryer98} \nindicate that the distribution of kick velocities  consists of\ntwo components: a low velocity with the width of approximately\n$200\\,$kms$^{-1}$, and a high velocity with the characteristic\nvelocity around $800\\,$kms$^{-1}$.  About 80\\% of the kicks are\ndrawn from the first  component.  It is also known that the\nproduction rate  of compact object binaries falls off\nexponentially with increasing kick velocity, see Fig.~1 in\n\\cite{bbrhere}. Thus the population  of compact object binaries\nwill be dominated by the objects formed in the systems that\nreceived the kicks  drawn from the low velocity component of the\ndistribution. In the following we will consider the properties\nof  the compact object binaries for the case when the kick\nvelocity is drawn from a Gaussian distribution with the width \n$200\\,$kms$^{-1}$.\n\nLittle is known a priori about the masses and gravtational\npotentials of host galaxies where GRB progenitrs reside.\nTherefore to find the expected distribtion of merger  sites\naround galaxies  we consider two extreme cases: propogation in a\npotential of a large galaxy like the Milky Way and propagation\nin the empty space~\\cite{bbzmn}.\n\n\n\n\\begin{figure}[t!] % fig 1\n\\centerline{\\epsfig{file=T-30-fig01.ps,width=\\textwidth}}\n\\vspace{10pt",
    "author": "Tomasz Bulik and  Krzysztof Belczy{\\'n}ski",
    "title": "Distribution of binary mergers around galaxies"
}