{
    "address": "\n$\\dagger$\nGaAs IC Prototyping Facility,\nCSIRO Telecommunications and Industrial Physics,\nPO Box 76, Epping NSW 1710, Australia\n}\n\n\\address{\n$\\ddagger$\nDepartment of Theoretical Physics,\nResearch School of Physical Sciences and Engineering,\nThe Australian National University,\nCanberra ACT 0200, Australia\n}\n\n\\maketitle\n\n\\begin{abstract}\nWe analyze high-field current fluctuations in degenerate\nconductors by mapping the electronic Fermi-liquid correlations\nat equilibrium to their semi-classical non-equilibrium form.\nOur resulting Boltzmann description is applicable\nto diffusive mesoscopic wires.\nWe derive a non-equilibrium connection between thermal fluctuations\nof the current and resistive dissipation. In the weak-field limit this\nis the canonical fluctuation-dissipation theorem.\nAway from equilibrium, the connection enables explicit\ncalculation of the excess ``hot-electron'' contribution\nto the thermal spectrum. We show that\nexcess thermal noise is strongly inhibited by Pauli exclusion.\nThis behaviour is generic to the semi-classical metallic regime.\n\\end{abstract}\n\n\\bigskip\n\\pacs{73.50.Td, 72.10.Bg, 73.50.Fq}\n\n%IOP+ \\maketitle\n\n\\section{Introduction}\n\nIn this paper we address a technologically important open problem:\nnon-equilibrium noise in strongly driven degenerate conductors.\nNano-fabrication has made possible a variety of\nrefined measurements of transport and noise, for many different\nstructures at sub-micron dimensions\n\\cite{liefr,rez,ksgje,smd,sbkpr,poth,depic,sami}.\nAlongside the experiments\nthere has been much theoretical activity\n\\cite{theor,khlus,lesovik,but,beebut,thmldr,nagaev1,djb2}.\n\nA thriving topic is the behaviour of current fluctuations in\ndiffusive wires. Typically, this concerns structures\nshorter than the bulk inelastic mean free path but\nstill much longer than that for elastic scattering.\nThey are in an operating region where randomness of the\ncarrier motion prevails. This is our regime of interest.\n\nTwo theories have come to the fore as\nmethods of choice for describing mesoscopic transport.\nThese are inherently {\\it weak-field",
    "title": "High-field noise in metallic diffusive conductors"
}