["digital life, people are increasingly accumulating long-term tracking data, ranging from short bursts of tracking\nto multiyear records of activity or health data. We are just starting to understand how this introduces new\nopportunities, as well as challenges [3]. Building upon a workshop conducted at CHI 2018 [4], we subsequently\nidentify key features of long-term tracking, present a model for long-term tracking, and suggest a research\nagenda.", "Incompleteness of data: Although trackers may be used every day in the short term, this may change in the\nlong term, as people will undoubtedly stop tracking for a few hours or days, or for weeks, months, or years,\nintentionally or accidentally, resulting in incomplete data [8]. Gaps in the data, which in the short term are\noften considered an exception, are therefore the rule and can even carry information of their own.", "Implicit tracking with secondary sources: With the increasing digitization of daily life, we collect tremen-\ndous amounts of data about ourselves in secondary sources such as social networks, chats, workplace pro-\nductivity software, and online services. Although such data may be unstructured, heterogeneous, and frag-\nmentary, the longitudinal coverage makes it a particularly interesting supplementary source to understand\ncharacteristics such as context and connectedness over the long term.", "Subjectivity of data: Data is not just an objective measurement. It may be amenable to multiple interpreta-\ntions [8]. It may also tell a story of a person’s context, situation, setting, and memories at the time it was\ncollected [5], making it a memento of experiences such as happy changes in life, stressful times, or diseases.", "Secondary user: Parents of small children, medical experts, formal or informal caregivers, and other sec-\nondary users may have a legitimate reason to access the tracked data but are not involved in the challenges\nof the tracking itself. In the long term, this raises additional issues such as changing data ownership and\nresponsibility from the parents to an adolescent.", "Ethical, legal, and social implications: With long-term tracking, data becomes a virtual representation of\nthe person, capable of surfacing trends in the person’s health and relationships. Long-term data therefore\nbecomes a highly personal and lifelong asset that requires even more attention to questions about data\nprotection, access rights, security, privacy, or data ownership.", "As existing models of short-term tracking such as those of Li et al. [2] do not account for these aspects, we\npropose the long-term tracking feedback loops in Figure 1. Here, the user is both a producer of data and consumer\nof services, with potentially conflicting demands. As a producer of data, users may decide to trade off data quality\nbecause they want to reduce the effort they need to make for data collection. This may result in less data or lower-\nquality data. As a consumer of the services delivered by applications, there is a need for enough high-quality data.\nConsequently, we distinguish two different types of tracking: purposeful and incidental.", "Purposeful tracking is driven by a user’s need for a certain form of support or service. The application delivering\nthis therefore requires certain data, which must come from relevant tracking devices and sources. Ultimately,", "of data. These two loops are affected by a potential conflict between minimizing the demands upon the user and the need", "the purpose drives the tracking behavior required of the user. Changes in the users’ tracking goals and their\ncommitment to tracking have often compromised adherence [8], resulting in incomplete or missing data.", "By contrast, in incidental tracking, users not have a specific need. Tracking happens as a side effect of routinely\nusing devices or feeding secondary sources. Type, amount, and quality of data are determined by a user’s tracking\nroutine, not by potential future needs. These potential limitations of the data may in turn limit the types of\nservices that an application can offer.", "Long-term and short-term tracking share many properties and challenges. However, for many reasons, research\nso far has primarily focused on people’s short-term goals and needs. We suggest that the research community\nis missing an understanding of the specific opportunities of long-term tracking. This requires understanding\nhow long-term tracking is different from short-term tracking that we identified previously. It is more incidental\nrather than purposeful, and it is less likely to be for a specific, proximal goal. It may involve repurposing data,\ngiving it value the user did not anticipate. It can change as people’s long-term goals and understanding of them\nevolve. The data and its quality are defined by the user’s willingness to track, and applications must be satisfied\nwith whatever data is there. Therefore the main challenge is to maximize the value of existing data. This calls\nfor future research, including, but not limited, to the following:", "Systems issues for implicit tracking: This requires infrastructure, specifically designed to ensure security,\nuser control of privacy, and data provenance and methods to manage and analyze diverse data sources with\nheterogeneous data.", "Interfaces to visualize long-term data: Visualizing and exploring one’s own data is the initial step to self-\nunderstanding. However, short-term approaches do not scale well when it comes to unstructured, heteroge-\nneous, and large long-term data. New visualization techniques are needed to make long-term data accessible\nand support sense making by the layperson.", "Interfaces for long-term analyses: Beyond visualization, we also need systems that can analyze and un-\nderstand the heterogeneous, incomplete, and subjective data. We foresee systems that use rich analyses to\nidentify changes in life and in the user’s context, using the same, available data to answer different ques-\ntions as the user evolves, with a person’s changing context over a lifetime and the impact of new medical\nknowledge.", "Practice for long-term interventions: Long-term data offers tremendous opportunities for lifelong support.\nConcepts from short-term interventions cannot directly be applied in the long term. We need generic con-\ncepts for long-term interventions that can easily be applied in concrete use cases by designers and devel-\nopers.", "Making sense of physical activity tracker data. Proceedings of the ACM on Interactive, Mobile, and Ubiquitous Technologies 2, 1 (March"]