["A basic shortcoming in studying the connection between web searches and disease onset is that web searches\nare almost always anonymous when accessible to researchers. This means that linking actual medical infor-\nmation, such as exact disease diagnosis and its date, is limited to indirect inference. An exception to this rule\nis studies where patients consent to contribute their medical records and their online activity for study [14].\nHowever, such studies are necessarily limited by their scale and the diversity of the cohort they recruit. Thus, as\nnoted earlier, most studies collect data from anonymous sources and need to infer the medical status of users.\nThis can be done, for example, using search queries of self-identified users (SIUs).", "The most widely adopted approach to obtaining clinical indicators of disease is through clinical questionnaires.\nFor example, de Choudhury et al. [2] used questionnaires to assess the level of depression of crowdsourced\nworkers as a basis for using their social media posts to distinguish depressed from non-depressed individuals.\nHere, this approach is adopted to focus on cancer and correlate the score of a clinically validated questionnaire\nto medical symptom searches. In contrast to depression, the incidence of cancer is significantly lower than that\nof depression (creating a recruitment challenge). Moreover, people are more likely to ask for medical symptoms,\nespecially those of a personal nature, on search engines rather than on social media [16]. Therefore, here I used\na targeted advertising campaign and search engine logs as the primary data source.", "Users were requested to provide their data for the experiment. In the first study, the scores were correlated\nwith searches of users who consented. In the second study, a conversion indicator was given to the advertising\nsystem for users with high scores.", "The first study was conducted using the Bing ads system and required privileged access to the search system\ndata to obtain past user queries. The second study was conducted using the Google ads system, with no such\nprivileged access to past queries. The latter was done to demonstrate that public health organizations with no\nprivileged access could also utilize these systems. In both studies, the campaign budget was set to $15 per day,\nwhich meant that not all people who issued the relevant queries could be shown the ads. This was done so as to\nallow the ads system in the second study to select relevant participants from all users issuing relevant queries.", "People were recruited through ads and asked to complete questionnaires. The ads were shown between Decem-\nber 7, 2017, and April 13, 2018, to people in the United States. I extracted all queries made on Bing by users who\ncompleted a questionnaire, consented to contribute their data to the study, and were logged into Bing at the time\nof ad display. The queries were extracted from 3 months before the questionnaire completion and until 20 days\nafter that date. Queries of each person were represented by the following:", "The SCS was predicted from query data of participants for whom at least 14 days of query data prior to\nquestionnaire completion were available. The independent attributes for prediction included the query terms, as", "Throughout the experiment, 1,285 questionnaires were started and 681 were completed (53% completion rate).\nIt took an average of 126 seconds to complete the questionnaires. After excluding people who did not consent\nto the participate in the study and people who did not have a query history of at least 14 days, the data from 288\nremaining people (185 lung, 81 colon, and 22 breast) were analyzed.", "Trained separately, AUCs for the different cancers are 0.74 (colon), 0.56 (lung), and 0.50 (breast). Thus, colon\ncancer is the easiest one to identify, followed by lung cancer. The data do not allow the prediction of breast\ncancer outcome.", "system have limited access data from these systems. A rank regression model was fit to the impression rate per\nday over the duration of the campaign. The model fit (R2), slope of the impression rate over time, its p-value, and\nthe average impression rate are reported in Table 1. As the table shows, two of the five keywords used to trigger\ncolon cancer ads saw decreased impression rates over time. As expected, their average conversion rates (3.0% and\n4.4%) were well below the overall conversion rate of the campaign. Thus, the system identified these keywords\nas leading many people who did not have suspected cancer to click on the ads. Conversely, the impression rate\nincreased for two keywords related to breast cancer, and the impression rate for these was higher than the first\ntwo keywords. Interestingly, the impression rate for one demographic group (females 18–24 years old) increased\nduring the campaign and had a high conversion rate. It is noted that NICE for breast cancer suggests referring\nwomen in this age group for medical attention only if they have an unexplained breast lump with or without\npain.", "Understanding the reason people access the questionnaires. People might search for diagnostic information for\ndifferent reasons, including as a way to decide if they should visit a medical doctor, to validate the findings given\nto them by a medical professional, or in lieu of a medical professional. The latter can happen when access to\nthe medical system is restricted either by its availability or by cost (e.g.„ if the patient does not have medical\ninsurance). Thus, to understand who made use of the campaign ads, I modeled the data from 40 countries where\nads were shown at least 150 times.", "The outcomes of the first study indicate that queries are predictive of SCS for two of the cancer types (colon\nand lung), especially for those people for which the strength of the prediction is highest. It is noted that it is\ndifficult to identify whether the dearth of data or a lack of relevant information in the data was the cause for the\nlow performance in the case of lung and breast cancer.", "Our study has several limitations. First, although the questionnaires are designed to identify people with\nsuspected cancer, our data does not contain diagnostic information. Obviously, not all people who received a\nhigh SCS will be diagnosed with cancer. NICE questionnaires are designed to balance errors (false positives and\nfalse negatives) in a way that is cost effective (e.g., see Table 3 of Section 4.4 at https://www.nice.org.uk/guidance/\nng12/evidence/appendices-ae-pdf-74333342). However, the fact that a high SCS is not proof of cancer should\nnot detract from the usefulness of the SCS in screening. Indeed, accepted screening tests have relatively modest\ntrue-positive rates: it is estimated that around 6.3% of women in their 50s with an abnormal mammography\nhave invasive breast cancer [11], and studies report that around 4.6% of people with positive fecal occult blood\ntest are verified as having colon cancer [21]. Nevertheless, these screening tests are considered useful and are\nrecommended by health authorities. Future work will focus on a follow-up with people who completed their\nquestionnaire until after diagnosis to measure their detection rates.", "Studies using Internet data have mostly concentrated on improving population health [22, 33, 35] and showing\nthe feasibility to detect illness [8, 24, 28] but without providing this information in actionable form to people.\nThe current study opens the door for health authorities to (indirectly) use Internet data for screening and to\nprovide medical advice and nudges in a way that empowers users to choose if they would like to utilize it.", "Analysis of archival search data. Acta Diabetologica 56, 10 (2019), 1149–1154.", "Crutchley, David A. Asch, and Raina M. Merchant. 2015. Linking social media and medical record data: A study of adults presenting"]