["Online content\nAny methods, additional references, Nature Research reporting \nsummaries, source data, extended data, supplementary informa-\ntion, acknowledgements, peer review information; details of author \ncontributions and competing interests; and statements of data and \ncode availability are available at https://doi.org/10.1038/s41558-\n019-0635-1.", "Acknowledgements\nThe authors thank M. Mori for providing data from the MIROC simulations and \nfor useful discussions. We acknowledge the individuals and modelling groups that \ncontributed to the Facility for Climate Assessments (FACTS) multimodel dataset and the \nCESM Large Ensemble Project.", "\nmatters arisingNature Climate ChaNge\nmethods\nIn Fig. 1a,c,e, we use the exact same data as Mori et al.1. Briefly, observational \nresults come from the ERA-Interim reanalysis for the period 1979–2014 and \nmodelled results come from seven AGCM simulations in which observed sea \nsurface temperatures and sea ice have been specified. Further details on these \nmodel simulations can be found in Mori et al.1. In Fig. 1b,d,f, we also analyse two \nexperiments performed as part of the Community Earth System Model (CESM) \nLarge Ensemble project18. The first is a 200-year section (years 401–600) of a pre-\nindustrial control run of the CESM configured with the Community Atmosphere \nModel version 5 (CAM5). CESM–CAM5 is a global coupled climate model with \na horizontal resolution of approximately 1° in all model components. The second \nadditional experiment is a 200-year simulation with CAM5 in which sea surface \ntemperatures and sea ice were specified from years 401–600 of the parent  \nCESM–CAM5 simulation. External forcing is the same in both simulations. \nInitially in Fig. 1a, we employed the same methodologies as Mori et al.1 to  \ncalculate the WACE pattern, the WACE time series and the Barents–Kara sea-ice \nindex (see Mori et al.1 for details), with one exception. We computed the WACE \nand Barents–Kara sea-ice time series from monthly averages, whereas Mori et al.1 \nused winter averages. The purpose of this modification is to facilitate subseasonal \nlead–lag correlations. Projecting near-surface temperatures for December,  \nJanuary and February separately onto the winter mean WACE pattern produced \nmonthly WACE time series. Figure 1a shows the total and sea-ice-driven variance \nfor the three winter months combined. To construct Fig. 1b, we performed an \nanalogous analysis but substituted data from ERA-Interim with that from  \nCESM–CAM5. More specifically, we derived the WACE pattern as the leading \nmode of covariability from singular value decomposition applied to the  \nCESM–CAM5 and CAM5 simulations. The r2 value was then calculated by \ncorrelating the corresponding WACE time series with the Barents–Kara sea-ice \nindex from CESM–CAM5. In this so-called perfect model comparison19,20,  "]