["Climate change induced phenological shifts in primary pro-\nductivity result in trophic mismatches for many organisms1–4, \nwith broad implications for ecosystem structure and function. \nFor birds that have a synchronized timing of migration with \nresource availability, the likelihood that trophic mismatches \nmay generate a phenological response in migration timing \nincreases with climate change5. Despite the importance of a \nholistic understanding of such systems at large spatial and \ntemporal scales, particularly given a rapidly changing cli-\nmate, analyses are few, primarily because of limitations in the \naccess to appropriate data. Here we use 24 years of remotely \nsensed data collected by weather surveillance radar to quan-\ntify the response of a nocturnal avian migration system within \nthe contiguous United States to changes in temperature. The \naverage peak migration timing advanced in spring and autumn, \nand these changes were generally more rapid at higher lati-\ntudes. During spring and autumn, warmer seasons were pre-\ndictive of earlier peak migration dates. Decadal changes in \nsurface temperatures predicted spring changes in migratory \ntiming, with greater warming related to earlier arrivals. This \nstudy represents one of the first system-wide examinations \nduring two seasons and comprises measures from hundreds \nof species that describe migratory timing across a continent. \nOur findings provide evidence of spatially dynamic phenologi-\ncal shifts that result from climate change.", "Advances in remote-sensing technologies have enhanced our \nability to quantify phenological changes. These platforms provide \nrepeated and consistent observations over time. Most notably, \nthey have led to the development of large-scale vegetation indi-\nces20. Remote-sensing platforms for animals are rarer, but the US \nweather surveillance radar (WSR) network is emerging as a com-\nprehensive source of information about flying animals. Radars have \nrevealed numerous insights into avian migration21, but only recent \nadvances in data access and processing allow the examination of \nweather radar archives to study long-term phenological change22. \nThe use of WSRs avoids many of the sampling biases associated with \nindividual-based examinations by providing a comprehensive rep-\nresentation of the entire migration signal across the full migration  \nseason and across a considerable portion of the longitudinal breadth \nof the migration system. The methods employed in this study  \ncan be readily replicated annually, which allows for the long-term ", "monitoring of migration phenology in a consistent and rigorous \nfashion. To this end, we examined the past 24 years of radar data \ncollected over the continental United States to study the phenol-\nogy of nocturnally migrating birds. We provide the first system-\nbased indices of migration phenology and test whether migration \ntiming has shifted at these large scales. We focus on peak migra-\ntion, defined as the date by which 50% of the cumulative passage ", "studies hinted at the value of such an analysis16,26, but it was pre-\nviously impossible in the absence of a combination of advanced \nmachine learning, data accessibility and interoperability.", "The integration of additional information on species-specific \npatterns, for example, from citizen science or individual tracking, is \na priority to clarify specific mechanisms of phenology change30,31,33. \nAcquiring sufficient time-series data from these sources of informa-\ntion is challenging, but increasingly possible. Furthermore, a greater \nunderstanding of the spatial resolution of phenological change is \nimportant, as the macroclimate and microclimate may interact \nwithin regions for numerous species. Although species’ responses \nto changes in climate may vary, system-level phenology measure-\nments at large spatial and temporal scales can inform how rapidly \ndisruptions are affecting large assemblages of species. Our measures \nshow that migration systems are exhibiting widespread phenologi-\ncal changes.", "Online content\nAny methods, additional references, Nature Research reporting \nsummaries, source data, extended data, supplementary informa-\ntion, acknowledgements, peer review information; details of author \ncontributions and competing interests; and statements of data and \ncode availability are available at https://doi.org/10.1038/s41558-\n019-0648-9.", " 22. Lin, T. et al. MISTNET: Measuring historical bird migration in the US using \narchived weather radar data and convolutional neural networks. Methods \nEcol. Evol. 10, 1908–1922 (2019).", "\nLettersNaTUre ClimaTe CHaNge\nMethods\nWeather radar data acquisition. We quantified the intensity of avian migration \nto measure the phenology of migratory movements and computed the speed and \ndirection to integrate traffic flows through the night from civil dusk to civil dawn \n(the Sun 6° below the horizon). We sampled nocturnal time periods because they \ncapture the majority of migratory species that move through North America \n(~80% of migratory species)34. However, some taxonomic groups will not be \nrepresented in our analysis, including most soaring species (for example, those \nof Accipitridae, Cathartidae, Falconidae and Pelecanidae), aerial insectivores (for \nexample, those of Hirundinidae) and some diurnally migrating passerines (for \nexample, those of Fringillidae, Icteridae and Sturnidae). We used unfiltered (that is, \nlevel II) NEXRAD35 WSR data from 143 stations from spring (1 March to 15 June) \nand autumn (1 August to 15 November) that encompassed spring 1995 through \nto spring 2018. We acquired radar data through the Amazon Web Service portal \n(https://s3.amazonaws.com/noaa-nexrad-level2/index.html), extracting data every \n30 min from local sunset to sunrise. During the history of this sensor system, \nalgorithmic changes occurred, which influenced how the data are processed. \nAlthough this is not a concern for phenological analyses, because we do not make \ncomparisons of absolute magnitude across years, it is a concern when comparing \nabsolute magnitudes. For this reason, we did not include changes in abundance \nbecause we sought to analyse the entirety of the NEXRAD archive. Rosenberg \net al.36 give ten-year radar-derived comparisons of abundance.", "Clutter removal from weather radar data. Prior to constructing height profiles \nof migratory activity, we created binary masks separately for each calendar year \nand radar to remove stationary clutter (for example, buildings, wind turbines and \nterrain blockage) from the lowest elevational scan. We created masks by summing \na minimum of 100 low-elevation scans (0.5°), starting on 1 January (16:00 utc to \n18:00 utc) and continuing to 15 January. If 100 samples were unavailable by 15 \nJanuary, we expanded the window of selection until the threshold was met. We \nclassified any pixel above the 85th percentile of the summed reflectivity as clutter \nand masked it from our analyses21.", "Precipitation removal from WSR. To remove weather contamination, we trained \na deep convolutional neural network (CNN) to segment regions of precipitation \nfrom the biology in WSR volume scans and set the reflectivity of any pixel to zero \nif it was classified as precipitation22. Precipitation and migratory movements tend \nto be mutually exclusive, with precipitation, especially heavy precipitation, halting \nthe movement of migrants37,38. We trained the CNN using scans sampled at 30 min \nintervals for the first 3 h after the local sunset for all WSR stations in April, May, \nSeptember and October 2014–2016 (239,128 scans in total). We assigned per-pixel \ntraining labels using polarimetric variables: if the correlation coefficient exceeded \n0.95, reflectivity was classified as rain, otherwise it was classified as biological. The \nCNN used an FCN8 architecture39 with a VGG-16 backbone40 modified to the \ndimensions of the radar data, and was trained by back-propagation41 and stochastic \ngradient descent42. The trained CNN classifies pixels using only legacy radar \nvariables (for example, reflectivity, radial velocity and spectrum width), and may \nbe run on any historical radar scan. We evaluated the performance on manually \nsegmented scans that were both historically and geographically representative; the \nCNN retained 95.9% of all the biomass (summed reflectivity of the pixels classified \nas biology) with a false-positive rate of 1.3%.", "Quantifying migration activity from filtered WSR data. From clutter- and \nprecipitation-free data, we calculated the height profiles of migration intensity, \nspeed and direction using the lowest elevation scans (0.5–4.5°), at distances \nbetween 5 and 37.5 km from the radar. We determined the migration intensity \nfrom reflectivity (η (cm2 km−3)) and migrant flight direction (that is, track) and \nground speed from the radial velocity from 100 to 3,000 m above ground level \nwithin 100 m altitudinal bins43–46. When necessary, we de-aliased the radial velocity \nmeasures using the WSRLIB package47,48. To limit the influence of migratory \ninsects, we excluded altitudinal bins with velocity azimuth displays with a root \nmean squared error less than one, and we removed samples with a root mean \nsquared error greater than ten to limit the poor fits49,50. We further restricted \nsampling nights to measures with seasonally appropriate flight directions, \nallowing only samples with a northward component in the spring and a southward \ncomponent in the autumn (between 90 and 270°, depending on the season).", "Quantifying change in the surface air temperature. To relate interannual \nvariation in the peak migration with climate, we extracted data on the diurnal air \ntemperatures (°C) at 2 m above ground from the NCEP North American Regional \nReanalysis54 for the same dates for which WSR data were analysed. We extracted \ndiurnal temperature measures from the radar coverage area (37.5 km from the \nradar) and averaged the daily measures within each year, which resulted in a \nseasonal time series per WSR station. To quantify the seasonal change in surface \ntemperature, we averaged the temperatures with season (spring or autumn) \nand used a ridge-regression linear model with WSR ID as a fixed effect and an \ninteraction between WSR ID and year. This yielded site-specific coefficients of \nchange for each WSR station. We used a penalty of 0.00001.", "Data availability\nThe datasets generated during and/or analysed during the current study are \navailable at https://doi.org/10.6084/m9.figshare.10062239.v1.", "WSR-88D data. Bull. Am. Meteorol. Soc. 74, 645–653 (1993).\n 36. Rosenberg, K. V. et al. Decline of the North American avifauna. Science 366, ", "Author contributions\nAll the authors worked to conceive and design this study. K.G.H., F.A.L., D.S. and \nA.F. drafted the manuscript. T.-Y.L., K.W., G.B., S.M., K.G.H. and D.S. designed the \nradar algorithms, and processed and summarized the radar data. K.G.H. generated the \nfigures and D.S., W.M.H. and K.G.H. designed the analyses. All the authors provided \neditorial advice, approved the final version of this manuscript and are in agreement to be \naccountable for all aspects of the work."]