["Emissions of nitrous oxide (N2O) from the world’s river net-\nworks constitute a poorly constrained term in the global N2O \nbudget1,2. This N2O component was previously estimated as \nindirect emissions from agricultural soils3 with large uncer-\ntainties4–10. Here, we present an improved model representa-\ntion of nitrogen and N2O processes of the land–ocean aquatic \ncontinuum11 constrained with an ensemble of 11 data prod-\nucts. The model–data framework provides a quantification \nfor how changes in nitrogen inputs (fertilizer, deposition and \nmanure), climate and atmospheric CO2 concentration, and \nterrestrial processes have affected the N2O emissions from \nthe world’s streams and rivers during 1900–2016. The results \nshow a fourfold increase of global riverine N2O emissions \nfrom 70.4 ± 15.4 Gg N2O-N yr−1 in 1900 to 291.3 ± 58.6 Gg \nN2O-N yr−1 in 2016, although the N2O emissions started to \ndecline after the early 2000s. The small rivers in head water \nzones (lower than fourth-order streams) contributed up to \n85% of global riverine N2O emissions. Nitrogen loads on \nheadwater streams and groundwater from human activities, \nprimarily agricultural nitrogen applications, play an important \nrole in the increase of global riverine N2O emissions.", "the subgrid routine processes without conducting model simulation \nat fine resolution (Supplementary Fig. 1b). To quantify the influ-\nences of natural and human activities on riverine N2O emissions, \nthe model was driven by many factors including climate (shortwave \nradiation, precipitation, air temperature, maximum temperature \nand minimum temperature), land use and land cover, and nitro-\ngen inputs (fertilizer, deposition, manure and sewage) from 1900 \nto 2016 (Supplementary Fig. 2). The simulated river discharges and \nnitrate (NO3−), ammonium (NH4+) and dissolved organic nitrogen \nconcentrations were calibrated using observations from 50 large \nriver basins across the globe (Supplementary Fig. 3). The simulated \ngroundwater-dissolved N2O concentration and riverine-dissolved \nN2O concentration agreed well with observations both spatially \nand temporally (Supplementary Table 1 and Supplementary  \nFigs. 4–6). To assess the uncertainty of riverine N2O emissions,  \nsix datasets of N inputs and five estimates of river surface area \n(Methods and Supplementary Fig. 7) were used to drive the model. \nThe average of the ensemble N2O outputs was taken as the best \nestimation. Moreover, factorial experiments (Fig. 1b) were con-\nducted to attribute the contribution of each factor (climate, CO2, \nfertilizer, manure and N deposition) to riverine N2O emissions \n(Supplementary Table 2).", "biogeochemical processes; measurements and driving data also \nneed to improve. In particular, model parameters were the largest \nsource of uncertainty, followed by river surface area and nitrogen \ninputs (Supplementary Fig. 7). A rainfall event can increase the sur-\nface area of the first-order streams greatly but the high flow veloci-\nties make surface area prediction difficult22. Gas exchange rates also \nshow large variations by streams which requires further investiga-\ntion30. We simulated the N2O production from nitrification and \ndenitrification using a Q10-based empirical method, in which water \ntemperature is the only determinant (the first-order mechanism). \nAlthough some deficits exist in this method to explicitly account \nfor other critical factors, such as carbon availability, microbe activ-\nity and the level of dissolved oxygen (Supplementary Fig. 7), the \nparameterization of nitrification and denitrification rates at the \nreference temperature does implicitly consider impacts of other \nfactors. Moreover, the method is further validated by this study \n(Supplementary Table 1)25. Currently, the process-based subsurface \nhydrodynamic model requires variables such as thickness or extent \nof the hyporheic zone, hyporheic denitrification rate21. However, \nthese variables remain highly uncertain due to the lack of field mea-\nsurements globally. Therefore, the rigorous interaction between \nprocess-based modelling and field experimentation will be essential \nto reduce estimate uncertainty in the lateral N2O emission for clos-\ning the global N2O budget.", "Online content\nAny methods, additional references, Nature Research reporting \nsummaries, source data, extended data, supplementary informa-\ntion, acknowledgements, peer review information; details of author \ncontributions and competing interests; and statements of data and \ncode availability are available at https://doi.org/10.1038/s41558-\n019-0665-8.", "\nLetters Nature Climate ChaNge\nmethods\nWe collected site-level observations of dissolved N2O concentration, riverine \nN2O flux and groundwater N2O concentration from literature, to calibrate and \nvalidate our riverine N2O model within the DLEM framework (Supplementary \nInformation). Meanwhile, six collected datasets of nitrogen input and an \nestimate of river water surface area were used to evaluate the input data-induced \nuncertainties in riverine N2O emissions. The detailed information on the model \nand input data are given as follows.", "The annual land use/land cover change data were derived from a potential \nnatural vegetation map (synergetic land cover product31) and a prescribed \ncropland area dataset from the history database of the global environment v.3.2 \n(HYDE 3.2, ftp://ftp.pbl.nl/hyde/). The daily climate variables (precipitation, \nmean temperature, maximum temperature, minimum temperature and shortwave \nradiation) were obtained from the CRU–NCEP dataset (https://vesg.ipsl.upmc.fr)  \nfor 1900–2016. Annual atmospheric CO2 concentration from 1900 to 2015 was \nobtained from the NOAA GLOBALVIEW-CO2 dataset (https://www.esrl.noaa.\ngov). Long-term atmospheric N2O concentration was obtained from the AGAGE \ndataset (https://agage.mit.edu/data/agage-data).", "Model simulations were driven by multiple data sources of N deposition and \nN fertilizer use, including two datasets of N deposition at a resolution of 0.5° × 0.5° \nfrom the atmospheric chemistry and climate model intercomparison project \n(ACCMIP)32 and chemistry–climate model initiative (CCMI) models33. Three \ndatasets of agricultural N fertilizer use were obtained from refs. 34–36.A spatially \nexplicit dataset of manure N application on global croplands developed by Zhang \net al.37 was also used to drive DLEM. Additional detailed information about \nnitrogen inputs can be found in Supplementary information and other published \ndocuments32–36.", "The ACCMIP deposition data and the fertilizer data34 were selected as the \nnitrogen inputs for our attribution analysis experiment (Fig. 1b and Supplementary \nTable 2) and model calibration (Supplementary Figs. 3–6). The historical global \ngross domestic product and population data obtained from the intersectoral \nimpact model intercomparison project (ISIMIP, https://esg.pik-potsdam.de/search/\nisimip/) are used for estimating sewage N exports, using the method proposed by \nVan Drecht et al.38.", "Uncertainty analysis. We have evaluated three main sources of uncertainty in \nestimating riverine N2O emissions: (1) N input data-induced uncertainty, (2) \nriver surface area-induced uncertainty and (3) parameter-induced uncertainty. To \nevaluate uncertainty of riverine N2O emissions induced by nitrogen input data, \nwe carried out four simulations by using different nitrogen input datasets. We first \nchose ACCMIP deposition32 data and fertilizer data34 as a benchmark and then \nsubstituted N fertilizer data with datasets35,36 for two other separate experiments. \nWe also replaced ACCMIP N deposition data with CCMI N deposition data33 for \nrunning another simulation.", "Theoretically, uncertainties from model parameters and input data are \nindependent from each other, and thus their joint uncertainty was calculated as the \nsquare root of the quadratic sum of the three uncertainties44.", "Data availability\nThe relevant datasets of this study are archived in the box site of International \nCenter for Climate and Global Change Research at Auburn University  \n(https://auburn.box.com/v/GriverineN2O). Source data for Figs. 1–4 and \nSupplementary Figs. 1–10 are provided with the paper.", " 37. Zhang, B. et al. Global manure nitrogen production and application in \ncropland during 1860–2014: a 5 arcmin gridded global dataset for Earth \nsystem modeling. Earth Syst. Sci. Data 9, 667–678 (2017)."]