["Results\nOur empirical analysis of the drivers of energy use patterns and car-\nbonization is based on data on population, gross domestic prod-\nuct (GDP), fuel-specific primary energy and CO2 emissions from \nthe International Energy Agency (IEA)15. This includes data for 24 \ncountries in SSA (another 25 are aggregated into Other Africa) for \nthe period 1971–2015. As the main focus of our analysis is on coun-\ntries that are building up their energy systems, we exclude South \nAfrica from the SSA aggregate.", "We then project the development of power sector emissions in \nthe near future, on the basis of the Platts database16, which provides \ncountry-level information on power plant capacities that already \nexist, are under construction or are in the planning process. Finally, \nwe compare these results with projected emissions in the Shared \nSocioeconomic Pathways (SSPs)17 that have been derived from \nintegrated assessment model studies. All data and methods are \ndescribed in more detail in the Supplementary Information.", "Economic development in sub-Saharan Africa has increased carbon emissions and will continue to do so. However, changes \nin emissions in the past few decades and their underlying drivers are not well understood. Here we use a Kaya decomposition \nto show that rising carbon intensity has played an increasingly important role in emission growth in sub-Saharan Africa since \n2005. These changes have mainly been driven by the increasing use of oil, especially in the transportation sector. Combining \ninvestment data in the power sector with economic and population projections, we find that investments in new coal-fired \ncapacity may become a major driver of future carbonization. Our results highlight the importance of making low-carbon tech-\nnologies available and financially attractive to sub-Saharan African countries to avoid a lock-in of emission-intensive energy \nuse patterns.", "Online content\nAny methods, additional references, Nature Research reporting \nsummaries, source data, extended data, supplementary informa-\ntion, acknowledgements, peer review information; details of author \ncontributions and competing interests; and statements of data and \ncode availability are available at https://doi.org/10.1038/s41558-\n019-0649-8.", "Projected data. The projected data for 2025 result from combining three data \nsources by the IEA15, Platts16 and Shearer et al., with a set of assumptions. A \nsummary diagram of the methodology used to compute the Kaya factors is \nprovided in Supplementary Fig. 1. For instance, GDP and population data over \n2005–2015 were taken from the IEA15 and were linearly extrapolated to 2025.", "The associated CO2 emissions were estimated using carbon intensities from \nthe previous periods for all fossil fuels. More specifically, the carbon intensities of \ncoal, oil and gas power plants are about 950, 850 and 400 g CO2 kWh−1, respectively. \nThese were computed using IEA data15 and were relatively constant between \n2000 and 2015. They are in good agreement with the 2006 IPCC Guidelines for \nNational Greenhouse Gas Inventories35. In other words, CO2 emissions in 2025 are \ncalculated using the projected energy consumption in the power sector and other \nsectors multiplied by the relevant CO2 emission factors.", "On the basis of these data and assumptions, we generated two polar scenarios: \n30% and All. In 30%, we assumed that only 30% of the pre-construction coal power \nplant projects will be successful while all shelved projects will not. This assumption \nreflects historical rates as indicated in Shearer et al.22 (Africa and the Middle East: \n27%, World: 34%; see Table 2 in the report). We also considered all coal power \nplants to run at 30% of their capacities, which is also in line with historical data \n(Supplementary Fig. 3). In All, we assumed that all planned coal plants (pre-\nconstruction and shelved) will successfully come online by 2025 and that all coal \nplants have a load factor of 48% (Supplementary Fig. 3). In both scenarios we also \nassumed that all coal power plants existing in the previous period are still operating \nand that all plants in construction will be fully operating in 2025. The assumptions \nunderlying these two scenarios cover a broad range of highly disputed values. The \nfuture will probably lie somewhere between the two scenarios. We emphasize, \nhowever, that our results indicate an influence on short-term emission growth in \ngeneral; that is, they do not necessarily depend on the year 2025 specifically but \nrather sometime around this year.", "Data availability\nThe data used in this study are not publically available (except Shearer et al.22 and \nWirth34). Data on emissions and energy are available from the IEA15, and data \non power plants are available from Platts16, but fees and restrictions apply to the \navailability of both databases that we used under license for the current study. \nData are available from the authors on reasonable request and with permission \nof the IEA and Platts, respectively. Data on SSP scenarios rely on peer reviewed \npublications and are available from the respective modelling teams23–28.", "Code availability\nAll code and figures and their underlying data are available at https://github.com/\njhilaire/ssawosacarb.git", "Acknowledgements\nThe authors acknowledge funding from the German Federal Ministry of Education \nand Research (BMBF), funding code 011A1807A (DECADE). We also thank K. Calvin \n(PNNL), N. Bauer (PIK), D. van Vuuren and M. Hamsen (PBL), S. Fujimori (NIES) and \nO. Fricko (IIASA) for sharing IAM data with us. We thank L. Montrone and L. M. Puerto \nChaves for excellent research assistance.", "Author contributions\nAll authors conceived and planned the project. J.C.S., J.H. and M.J. analysed the data. \nJ.H., J.C.S. and M.J. designed the simulations. J.H. and J.C.S. developed the code and ran \nthe simulations. J.C.S, M.J. and J.H. wrote the paper.", "Data collection We used the \"Professional Browser\" provided by IEA to extract data from the \"World Energy Balances 2017\" and \"CO2 emissions from \nFuel Combustion 2017\" databases.", "Data analysis We developed R scripts to analyse the data. All scripts are publicly available on GitHub: https://github.com/jhilaire/ssawosacarb.git", "All manuscripts must include a data availability statement. This statement should provide the following information, where applicable: \n- Accession codes, unique identifiers, or web links for publicly available datasets \n- A list of figures that have associated raw data \n- A description of any restrictions on data availability", "ata used in this study are not publically available (with the exception of Shearer et al. 2018,2019 and Wirth 2018). Data on emissions and energy are available from \nthe International Energy Agency (IEA) and data on power plants are available from PLATTS, but fees and restrictions apply to the availability of both databases that \nwe used under license for the current study. Data are available from the authors upon reasonable request and with permission of IEA and PLATTS, respectively. Data \non SSP scenarios rely on peer reviewed publications are available by the respective modeling teams.  \n• Bauer et al (2017) Shared Socio-Economic Pathways of the Energy Sector – Quantifying the Narratives. Global Environmental Change, 42, pp 316-330. \ndoi.org/10.1016/j.gloenvcha.2016.07.006  \n• Calvin et al (2017) The SSP4: A world of deepening inequality. Global Environmental Change, 42, pp 284-296. doi.org/10.1016/j.gloenvcha.2016.06.010  \n• Fricko et al (2017) The marker quantification of the Shared Socioeconomic Pathway 2: A middle-of-the-road scenario for the 21st century. Global Environmental \nChange, 42, pp 251-267. doi.org/10.1016/j.gloenvcha.2016.06.004  ", "• Fujimori et al (2017) SSP3: AIM implementation of Shared Socioeconomic Pathways. Global Environmental Change, 42, pp 268-283. doi.org/10.1016/\nj.gloenvcha.2016.06.009  \n• Kriegler et al (2017) Fossil-fueled development (SSP5): An energy and resource intensive scenario for the 21st century. Global Environmental Change, 42, pp \n297-315. doi.org/10.1016/j.gloenvcha.2016.05.015  \nAll code and figures and their underlying data are available at https://github.com/jhilaire/ssawosacarb.git ", "Study description We perform a data decomposition analysis of carbonization patterns in Sub-Saharan Africa (without South Africa) using Kaya \ndecomposition methods. We also generate near-term projections until 2025 and compare them to recent scenario data (Shared \nSocio-economic Pathways) from the IAM community.", "Data collection We gathered data on CO2 emissions by fossil fuel, primary energy consumption by energy carrier, GDP and population for each Sub-\nSaharan African country from 1970 until 2015 (IEA 2017), current data on operating and planned power plant capacities (PLATTS \n2017, Shearer et la 2018) for all Sub-Saharan African countries. We collected data for SSP scenarios from the respective modeling \nteams when not publically available. "]