{
    "address": "$^1$NCAR, Boulder, CO 80307-3000;\n$^2$Mathematics, University of Newcastle, NE1 7RU, UK}\n\n\\maketitle\n\n\\begin{abstract}\nAnalysis using new calculations with 3 times the resolution of\nthe earlier linked magnetic flux tubes confirms the transition \nfrom singular to saturated\ngrowth rate reported by Grauer and Marliani \\cite{GrauerMar99} \nfor the incompressible cases is confirmed. However, all of the\nsecondary tests point to a transition back to stronger growth rate\nat a different location at late times.  \nSimilar problems in ideal hydrodynamics are discussed, pointing out\nthat initial negative results eventually led to better\ninitial conditions that did show evidence for a singularity of Euler.\nWhether singular or near-singular growth in ideal MHD is eventually\nshown, this study could have bearing on\nfast magnetic reconnection, high energy\nparticle production and coronal heating.\n\\end{abstract}\n\\pacs{PACS number: 52.30.Jb, 52.65.Kj}\nThe issue currently leading to conflicting conclusions about\nideal 3D, incompressible MHD is similar \\cite{KerrB99,GrauerMar99}\nto what led to conflicting results\non whether there is a singularity of the 3D incompressible Euler.\nWith numerical simulations, it was first concluded that \nuniform mesh calculations with symmetric initial conditions such\nas 3D Taylor-Green were not yet singular \\cite{Brachetetal83}.  \nNext, a preliminary \nspectral calculation \\cite{KerrH89} found weak evidence in\nfavor a singularity in a series of Navier-Stokes simulations\nat increasing Reynolds numbers, but larger\nadaptive mesh or refined mesh calculations \ndid not support this result \\cite{PumirS90,Shelleyetal93}. \nEventually, numerical evidence in favor of\na singularity of Euler was obtained using several independent tests applied\nto highly resolved, refined mesh\ncalculations of the evolution of two anti-parallel vortex tubes \\cite{Kerr93}.\nTo date, these calculations have met every analytic test for whether\nthere could be a singularity of Euler.\n\nSeveral other calculations have also claimed numerical\nevidence for a singularity of Euler \\cite{BoratavPZ92,BoratavP94,GrauerMG98}.\nWhile in all of these cases the evidence is plausible, with the perturbed\ncylindrical shear flow \\cite{GrauerMG98} using the BKM\n$\\|\\omega\\|_\\infty$ test \\cite{BKM84}, for none has\nthe entire battery of tests used for the anti-parallel case been applied.\nWe have recently repeated one of the orthogonal cases \\cite{BoratavPZ92",
    "author": "Robert M. Kerr$^1$ and Axel Brandenburg$^2$",
    "title": "New tests for a singularity of ideal MHD"
}