{
    "address": "Department of Inorganic and Physical Chemistry\\\\\nIndian Instittue of Science\\\\\nBangalore 560012\\\\\nIndia}\n\\title{BARRIER CROSSING BY A LONG CHAIN MOLECULE - \\\\\nTHE KINK MECHANISM}\n\\maketitle\n\n\\begin{abstract}\n\\large\nWe consider the generalization of the Kramers escape over a barrier problem\nto the case of a long chain molecule. The problem involves the motion of a\nchain molecule of $N$ segments across a region where the free energy per\nsegment is higher, so that it has to cross a barrier. We consider the limit\nwhere the length of the molecule is much larger than the width of the\nbarrier. The width is taken to be sufficiently wide that a coninuum\ndescription is applicable to even the portion over the barrier. We use the\nRouse model and analyse the mechanism of crossing a barrier. There can be\ntwo dominant mechanisms. They are: end crossing and hairpin crossing. We\nfind the free energy of activation for the hairpin crossing is two times\nthat for end crossing. In both cases, the activation energy has a square\nroot dependence on the temperature $T$, leading to a non-Arrhenius form for\nthe rate. We also show that there is a special time dependent solution of\nthe model, which corresponds to a kink in the chain, confined to the region\nof the barrier. The movement of the polymer from one side to the other is\nequivalent to the motion of the kink on the chain in the reverse direction.\nIf there is no free energy difference between the two sides of the barrier,\nthen the kink moves by diffusion and the time of crossing $t_{cross}\\sim\nN^2/T^{3/2}$. If there is a free energy difference, then the kink moves with\na non-zero velocity from the lower free energy side to the other, leading to \n$t_{cross}\\sim N/\\sqrt{T}$. We also consider the translocation of\nhydrophilic polypeptides across hydrophobic pores, a process that is quite\ncommon in biological systems. Biological systems accompolish this by having\na hydrophobic signal sequence at the end that goes in first. We find that\nfor such a molecule, the transition state resembles a hook, and this is in\nagreement with presently accepted view in cell biology.\n\\end{abstract}\n\n\\large\n\n\\section{Introduction}\n\nThe escape of a particle over a one dimensional barrier has been the subject\nof a large number of investigations. The problem, often referred to as the\nKramers problem \\cite{Kramers,Chandra}, has been the subject of detailed\nreviews \\cite{Hanggi,Melnikov}. Kramers found solutions in the limit of weak\nfriction and also in the limit of moderate to strong damping \\cite{Chandra}.\nThe intermediate regime has been an active area of investigation \\cite\n{Hanggi}. The reason for this extensive activity is that this forms a model\nfor a chemical reaction occuring in a condensed medium. Kramers problem for\nfew degrees of freedom has also been the topic of study \\cite\n{Hanggi,Melnikov}. The quantum problem of escape/tunneling through a barrier\ntoo is of considerable interest. In the case where the system has an\ninfinite number of degrees of freedom, this has been referred to as the\ndecay of metastable vaccum, a problem that has attracted quite a bit of\natttention in field theory, cosmology and mesoscopic quantum phenomena \\cite\n{Coleman,Kleinert",
    "author": "K.L. Sebastian and Alok K.R. Paul"
}