{
    "address": "Center for Theoretical Physics and Department of Physics \\\\\nLaboratory for Nuclear Physics\nMassachusetts Institute of Technology\\\\\nCambridge, Massachusetts 02139\\\\E-mail: jaffe@mit.edu\\\\[1ex]\n{\\small In Memoriam  Kenneth A. Johnson\n1931--1999}}\n\n\\maketitle\n\n\\abstracts{\nA simple generalization of the Breit Interaction explains many \nqualitative features of the spectrum of hadrons.\\hfill\nhep-ph/0001123\\qquad  {MIT CTP \\# 2938}\n}\n\n\\thispagestyle{empty}\n\n\\section{Introduction}\n\\label{section1}\nI did not know Gregory Breit, but two of his closest associates \ninfluenced me deeply.  I did research in Gerry Brown's group as\nan undergraduate at Princeton.  Gerry welcomed young students into his\nresearch family and gave us wonderful problems to work on.  He taught\nus that complicated problems often have simple answers -- something\nthat has proved true in particle physics over the past quarter\ncentury.  Vernon Hughes invented deep inelastic spin physics in the\nearly 1970's and has championed it relentlessly ever since. \nHe and his collaborators have literally rewritten the book on the\nquark and gluon structure of the nucleon.  It is a pleasure to speak\nat a symposium celebrating their teacher, Gregory Breit.\n\nMy talk will be largely pedagogical.  I would like to show how a\ngeneralization of the ``Breit Interaction'' can account for some of\nthe regularities of hadron physics.  Although the basic ideas\ndescribed here date back to the 1970's, they have not been presented\nquite this way before, and some developments are still at the\nforefront of modern research in QCD\\null. This subject was a special\nfavorite of my friend and collaborator, Ken Johnson, who died this\npast winter.  Ken had many friends at Yale.  He would have liked to\nhear this story, so I dedicate my talk to his memory.\n\nIt is hard to make definite statements about hadrons made of the light\n$u$, $d$, and $s$ quarks.  The nonperturbative regime is too\ncomplicated.  It may never be solved to our satisfaction except on a\ncomputer.  Nevertheless, the spectrum and interactions of baryons and\nmesons display remarkable regularities, which correlate with simple\nsymmetry properties of the fundamental quark/gluon interactions.  The\nrole of models in QCD is to  build simple physical pictures that connect the\nphenomenological regularities with the underlying structure.\n\nThe QCD ``Breit Interaction'' is the spin-dependent part of one-gluon\nexchange between light quarks in the lowest state of some unspecified\nmean field.  It is summarized by an effective Hamiltonian acting on\nthe quarks' spin and color indices,\n%\n\\begin{equation}\n        {\\cal H}_{\\rm eff} \\propto\\, -\\!\\sum_{i\\ne j}\n        {\\undertilde{\\lambda}}\\,_{i}\\cdot {\\undertilde{\\lambda}}\\,_{j}\n        \\vec{\\sigma}_{i}\\cdot\\vec{\\sigma}_{j} \n        \\la{0.1}\n\\end{equation}\n%\nwhere $\\vec\\sigma_{i}$ and ${\\undertilde\\lambda}\\,_{i}$ are the spin\nand color operators of the $i^{\\rm th}$ quark.  The spin operators are\nrepresented by the three $2\\times 2$ Pauli matrices, normalized to\n$\\mathop{\\rm Tr}(\\sigma_{i}^{k",
    "author": "R.L.~Jaffe",
    "title": "\\uppercase{#1}}"
}