{
    "address": "Kurchatov Institute, Kurchatov sq. 1, Moscow 123182,\n%Russia\\\\E-mail: Y.Ivanov@gsi.de}\n\n%\\author{J. KNOLL}\n\n\\address{Gesellschaft f\\\"ur Schwerionenforschung mbH, Planckstr. 1,\n64291 Darmstadt, Germany\\\\\nE-mail: Y.Ivanov@gsi.de, J.Knoll@gsi.de, D.Voskresensky@gsi.de}\n\n%\\author{D. N. VOSKRESENSKY}\n\n%\\address{Moscow Institute for Physics and Engineering, \n%Kashirskoe sh. 31, Moscow 115409, Russia\\\\E-mail: \n%voskre@tpri6k.gsi.de}\n\n\n\\maketitle\\abstracts{ The effects of the propagation of particles which have a\n  finite life-time and an according width in their mass spectrum are discussed\n  in the context of transport descriptions. In the first part the coupling of\n  soft photon modes to a source of charged particles is studied in a classical\n  model which can be solved completely in analytical terms. The solution\n  corresponds to a re-summation of certain field theory diagrams. The general\n  properties of broad resonances in dense finite temperature systems are\n  discussed at the example of the $\\rho$-meson in hadronic matter. The second\n  part addresses the problem of transport descriptions which also account for\n  the damping width of the particles. The Kadanoff--Baym equation after\n  gradient approximation together with the $\\Phi$-derivable method of Baym\n  provides a self-consistent and conserving scheme. Memory effects appearing in\n  collision term diagrams of higher order are discussed.  We derive a\n  generalized expression for the nonequilibrium kinetic entropy flow, which\n  includes corrections from fluctuations and mass-width effects. In special\n  cases an $H$-theorem is proved. Memory effects in collision terms provide\n  contributions to the kinetic entropy flow that in the Fermi-liquid case\n  recover the famous bosonic type $T^3 \\ln T$ correction \n  to the specific heat of liquid Helium-3. \n  }\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%% JK\n\nWith the aim to describe the collision of two nuclei at intermediate or even\nhigh energies one is confronted with the fact that the dynamics has to include\nparticles like the delta or rho-meson resonances with life-times of less than\n2 fm/c or equivalently with damping widths above 100 MeV. Also the collisional\ndamping rates deduced from presently used transport codes are of the same \norder, whereas typical mean temperatures \nrange between 50 to 150 MeV depending on beam energy. Thus, the damping width\nof most of the constituents in the system can by no means be treated as a\nperturbation.  As a consequence the mass spectrum of the particles in the\ndense matter is no longer a sharp delta function but rather acquires a width\ndue to collisions and decays. One thus comes to a picture which unifies {\\em\n  resonances",
    "author": "J. KNOLL",
    "title": "SOFT MODES, QUANTUM TRANSPORT  AND  KINETIC ENTROPY$^{\\S}$\\footnotetext{$^{\\S"
}