{
    "address": "$^{1}$Laboratoire de Physique de la Mati\\`{e}re Condens\\'{e}e,\\\\\nC.N.R.S. Ecole Polytechnique, 91128 Palaiseau, France \\\\\n$^{2}$Centre de Math\\'{e}matiques et de leurs Applications,\\\\\nEcole Normale Sup\\'{e}rieure, 94140 Cachan, France}\n\\date{\\today }\n\\maketitle\n\n\\begin{abstract}\nA numerical study of the transfer across random fractal surfaces shows that\ntheir response are very close to the response of deterministic model\ngeometries with the same fractal dimension. The simulations of several\ninterfaces with prefractal geometries show that, within very good\napproximation, the flux depends only on a few characteristic features of the\ninterface geometry: the lower and higher cut-offs and the fractal dimension.\nAlthough the active zones are different for different geometries, the\nelectrode responses are very nearly the same. In that sense, the fractal\ndimension is the essential ''universal'' exponent which determines the net\ntransfer.\n\\end{abstract}\n\n\\pacs{{\\bf PACS:} 41.20.Cv - 82.65.Jv - 61.43.Hv}\n\nMany random processes such as aggregation, diffusion, fracture and\npercolation, build fractal objects \\cite{Vicsek,Meakin}. Fractal geometry\nessentially describes hierarchical structures \\cite{Mandel}. If properties\nof these random systems depend on the hierarchical character of their\ngeometry, then the study of a deterministic structure with the same fractal\ndimension may provide a good approximation of the random system properties \n\\cite{sapfrac}. The question is significant since fractal and pre-fractal\ngeometries are widely used in mathematical approaches or numerical\nsimulations as a convenient model of irregularity. They are also more simply\naddressed by algebraic calculations and incorporated into numerical models\nfor computer simulation. It is then an important matter to decide whether\nsimple deterministic, {\\it artificial,} fractals could help determine the\nproperties of random, {\\it natural,} fractals~\\cite{MandelGiven,deArcangelis}%\n. In particular, it is a question whether experiments performed on model\nfractal geometries \\cite{Sapoval96} may help understand the behavior of real\ncomplex structures.\n\nThe property which is discussed here is the Laplacian transport to and\nacross irregular and fractal interfaces. Such transport phenomena\\ are often\nencountered in nature or in technical processes: properties of rough\nelectrodes in electrochemistry, steady-state diffusion towards irregular\nmembranes in physiological processes, the Eley-Rideal mechanism in\nheterogeneous catalysis in porous catalysts, and in NMR relaxation in porous\nmedia. In each of these examples, the interface presents a {\\it finite}\ntransfer rate, like a redox reaction, or a finite permeability, or reaction\nrate which is due to specific physical or chemical processes.\n\nThe mathematical formulation of the problem is simple. One considers the\ncurrent flowing through an electrochemical cell as shown in Fig.~\\ref\n{fig:cell}. The current $\\vec{J}$ is proportional to the Laplacian field $%\n\\vec{\\nabla}V$, which can be viewed as an electrostatic field in\nelectrochemistry, or a particle concentration field in diffusion problems.\nThen the flux and field are related by classical equations of the type $\\vec{%\nJ}=-\\sigma \\vec{\\nabla",
    "author": "M. Filoche$^{1}$ and B. Sapoval$^{1,2}$"
}