{
    "affiliation": "x-Planck-Institut f\\\"ur Astronomie, Heidelberg, Germany}\n\n\\begin{abstract}\nThe stellar-dynamical evolution of bound star clusters during the\nfirst few~Myr is dominated by binary-binary and binary-star\ninteractions, the rapid sinking of the most massive stars to the\ncentre of the clusters and mass loss from evolving stars. The\nconsequences of these processes for the binary and stellar population\nin clusters, and for the star clusters as a whole, are studied by\nfollowing the evolution over 150~Myr of a library of compact cluster\nmodels containing up to $10^4$~stars.\n\\end{abstract}\n\n\\keywords{cluster dynamics -- mass segregation -- stellar ejection -- \nbinary systems -- massive stars -- brown dwarfs}\n\n\\section{Introduction}\nThe evolution of the primordial binary population, mass segregation,\nthe ejection of massive stars, and the effect of mass loss through\nevolving stars, are dynamical processes that shape the stellar content\nand structure of young clusters.  A particularly interesting problem\nis the attempt to reconstruct the initial configuration of young\nclusters, such as the Orion Nebula Cluster and the Pleiades, by using\nthe binary population as a memory agent for the dynamical history of a\npopulation.  Since most stars probably form in clusters of some sort,\nthe multiple-star properties of the stellar population in the Galactic\nfield is expected to be significantly shaped by the dynamical\nprocesses in these.\n\nTo understand the appearance of star clusters of any age, their\ndynamical and astrophysical evolution needs to be treated accurately\nand consistently.  Direct $N$-body integration with special\nmathematical methods to treat accurately and efficiently multiple\nclose stellar encounters as well as perturbed binary and higher-order\nsystems, together with modern stellar evolution algorithms, is\nachieved with the {\\sc Nbody6",
    "author": "Pavel Kroupa\\footnotemark[1]",
    "title": "Stellar-Dynamics of Young Star Clusters"
}