{
    "address": "Institute of Physics, University of Tokyo \\\\                \n Komaba, Meguro-ku, Tokyo 153, Japan}\n\\author{Koo-Chul Lee\\footnote{kclee@phya.snu.ac.kr}}\n\\address{Department of Physics and Center for Theoretical Physics \\\\      Seoul National University,               \n Seoul, 151-742, Korea}\n\\date{\\today}\n\\maketitle \n\\begin{abstract}\n  We calculate the exact  zeros of the partition function for a continuum system where the probability distribution for the order parameter is given by two asymmetric Gaussian peaks. When the positions of the two peaks coincide, the two separate loci of zeros which used to give first-order transition touch each other, with density of zeros vanishing at the contact point on the positive real axis. Instead of the second-order transition of Ehrenfast classification as one might naively expect, one finds a critical behavior in this limit.   \n\\end{abstract}\n\\pacs{PACS numbers: 64.60.Fr, 02.30Dk, 02.50Cw, 05.70.Fh}\n\n\\setcounter{footnote}{0}\n\\narrowtext \n\n%\\newpage\n%\\twocolumn\n%\\vspace{0.5cm}\n\\section{Introduction}\nIt has been a central theme since the discovery of\nstatistical mechanics to  understand how the analytic partition\nfunction for a finite-size system acquires a singularity in the thermodynamic limit if the system undergoes a\nphase transition\\cite{yang72}. The Lee-Yang theory \\cite{ly}\nhas partly furnished the answer to this quest.   They proposed a scenario where the zeros of the partition function form a line and cut across the real axis. They showed that the discontinuity in the 1st order derivative of partition function is proportional to the angular density of zeros, using an analogy with the two dimensional electrostatics. Then they proved this scenario for Ising-like discrete systems under very general conditions. They could show that the zeros were distributed on a unit circle in this case. \n \nThere have been  many attempts to generalize the ``Lee-Yang circle theorem\" ever since.  Fisher\n\\cite{fisher65} initiated a study of zeros of the partition function in the complex temperature plane and  extensive studies of zeros of the \npartition function in complex temperature plane  followed  \n\\onlinecite{ono68,pearson82,abe67,itzykson83,privman87,bhanot87,kcl93,kcl94,kcl99}. In these works authors considered  continuous phase transitions or critical points.  \n\nThe conceptual basis of the Lee-Yang circle theorem was finally clarified in ref.\\cite{kcl}  by considering the first-order transition of a system with more general continuous degrees of freedom, with a doubly peaked probability distribution for the order parameter. Since the Ising-like models considered by Lee and Yang would be described by two symmetric Gaussian peaks in the thermodynamic limit, this result provides a simple conceptual basis for Lee-Yang unit circle theorem. Furthermore it is a generalization since general asymmetric configurations were considered, whose zeros form a curve which is not a unit circle in general.\n\nOne interesting problem to consider is what happens when the positions of the two Gaussian peaks coincide. Since this is the limit where the latent heat $l$ vanishes, one might naively expect that the system would exhibit a second-order transition  of the Ehrenfest classification\\cite{hwang}, where  there is a finite discontinuity in specific heat but no latent heat. (Fig.\\ref{fig:fig4",
    "author": "Julian Lee\\footnote{jul@hep1.c.u-tokyo.ac.jp}",
    "title": "Exact Zeros of the Partition Function for a Continuum System with Double Gaussian Peaks"
}