{
    "address": "$^a$Institut f\\\"ur Theoretische Physik, Universit\\\"at Regensburg,\nD-93040 Regensburg\\\\\n$^b$Institut f\\\"ur Physik, Universit\\\"at Augsburg, D-86135 Augsburg\\\\\n$^c$Department of Physics, University of Cincinnati, Cincinnati, OH\n45221}\n\\draft\n\\maketitle\n\\begin{abstract}\nWilson's Numerical Renormalization Group method is used to study the\nparamagnetic ground state of the periodic Anderson model within the\ndynamical mean-field approach.  For the particle-hole symmetric model,\nwhich is a Kondo insulator, we find that the lattice Kondo scale $T_0$\nis strongly enhanced over the impurity scale $T_K$; $T_0/T_K\\propto\n\\exp\\{1/3I\\}$, where $I$ is the Schrieffer-Wolff exchange coupling.  In\nthe metallic regime, where the conduction band\nfilling is reduced from one, we find characteristic signatures of \nNozi\\`eres exhaustion scenario, including a strongly reduced lattice Kondo \nscale, a significant suppression of the states available to screen \nthe f-electron moment, and a Kondo resonance with a strongly enhanced \nheight.  However, in contrast to the quantitative predictions of Nozi\\`eres,\nwe find that the $T_0\\propto T_K$ with a coefficient which depends\nstrongly on conduction band filling.\n\\end{abstract}\n\\pacs{71.27.+a,71.10.Fd,71.20.Eh}\n\\section{Introduction\\label{sec:1}}\nLanthanide or Actinide-based heavy fermion compounds\\cite{steglich} can \nbe viewed as a paradigm for strong correlation effects in solids. These \nsystems comprise a great variety of different low-temperature states, \nincluding paramagnetic metals with either a Fermi liquid or non-Fermi \nliquid properties\\cite{steglich,loehneysen}, long range magnetic order, \nsuperconductivity or coexistent magnetism and superconductivity\\cite{steglich}. \nWhile it is very interesting and challenging to understand the physics of\nthese ordered ground states, not even the basic ingredient, namely the \nphysics of the paramagnetic metal, has been fully captured yet on a\nmicroscopic basis. The common understanding is that the physical properties \nof heavy fermion compounds are largely determined by spin-flip scattering \nbetween spins localized on the Lanthanide or Actinide sites and delocalized \nconduction quasi particles usually formed by the $d$-states in the system. In \nthe case of dilute compounds this spin-flip scattering leads to the well-known\nKondo effect, i.e.\\ the screening of the localized spins by the\nconduction electrons and the formation of a Fermi liquid with a\nlow-energy scale set by the so-called Kondo temperature, $T_{\\rm K}$ depending\nexponentially and non-perturbatively on the system parameters\n\\cite{alex}. Interestingly,\nthe physics of the metallic phase of concentrated systems can in some\ncases, e.g.\\ CeAl$_3$, CeB$_6$ or CeCu$_6$ \\cite{steglich}, be at least\nqualitatively understood by a picture of independent, but coherent\nKondo scatterers, with the low-energy scale set by the Kondo\ntemperature of the dilute system. However, for UPt$_3$, URu$_2$Si$_2$\nor Yb$_4$As$_3$ \\cite{Yb4As3} or the compound LiV$_2$O$_4$ recently\ncharacterized as heavy fermion system \\cite{LiV2O4} there seem to\nexist two distinct energy scales; one high temperature scale, $T_{\\rm  K}$, \ndescribing conventional incoherent Kondo scattering, and a much\nsmaller scale, $T_0$, also called coherence scale in literature, which \nmarks the onset of Fermi liquid formation characterized by quasi particles\nwith strongly enhanced effective masses.\n\nThis apparent discrepancy in the experimental situation has triggered numerous \ntheoretical investigations, from which two dominant competing scenarios \nhave emerged.\n\nOne scenario, based on a diagrammatic\nperturbation theory \\cite{kuramoto,grewe}, succeeded in approximately\nmapping the concentrated system onto a set of independent, effective\nimpurities which at low temperature form a coherent Fermi liquid state\ndue to the lattice periodicity. The theory further predicts the\nexistence of a {\\em{single}} energy scale which uniquely determines the\nhigh energy properties like Kondo screening as well as the formation\nof the low-temperature Fermi liquid. Most important, apart from\nmoderate renormalizations which usually lead to an enhancement, this\nlattice scale is given in terms of the energy scale of the\ncorresponding diluted system \\cite{grewe",
    "author": "Th.\\ Pruschke$^a$, R.\\ Bulla$^b$ and M.\\ Jarrell$^c$",
    "title": "The low-energy scale of the periodic Anderson model"
}