{
    "address": "\n$^1$Nicolaus Copernicus Astronomical Center,\nBartycka 18, 00-716 Warszawa,Poland\\\\\n$^2$ Nicolaus Copernicus Astronomical Center,\nRabia{\\'n}ska 8, 87-100 Toru{\\'n},Poland\\\\\n$^3$ Toru{\\'n} Center for Astronomy, Nicolaus Copernicus \nUniversity, Gagarina 11, 87-100 Toru{\\'n}, Poland}\n\n%\\lefthead{LEFT head}\n%\\righthead{RIGHT head}\n\\maketitle\n\n\n\\begin{abstract}\nUsing stellar binary population synthesis code we calculate the\nproduction rates and lifetimes of several types of possible GRB\nprogenitors. We consider mergers of double neutron stars, black\nhole neutron stars, black hole white dwarfs and helium star\nmergers.  We calibrate the results with the measured star\nformation rate history.   We discuss the viability of each GRB\nmodel, and alternatively assuming that all bursts are connected\nwith one model we constrain the required collimation of GRBs. We\nalso show the importance of widely used evolutionary parameters\non  the merger rates of calculated binary populations.\n\\end{abstract}\n\n\n\n\\section*{Introduction}\n\nIt is surprising how little we know\nof GRB progenitors when we consider how much work\nis devoted to the subject. Different objects and models of progenitors were\nproposed, some already forgotten while others still being intensively studied.  \nConsidering the diversity of gamma ray bursts it is probable that they come \nfrom different types of astronomical objects, and this should promote the work\non different types of proposed progenitors. Recently much of the weight was\nplaced on collapsars, and connection  between supernovae and GRBs, although\nother models, as compact object  mergers, are still on the stage. \n\nCompact object binaries have recently drawn much attention in the astronomical\ncommunity. Several models of compact object binaries were proposed as GRBs\nprogenitors, namely: double neutron star mergers \n\\cite{meszrees97,ruffert97}, black hole -- neutron star mergers \n\\cite{lee95}, black hole -- white dwarf mergers \\cite{fryer99b} and  helium\nstar mergers \\cite{fryer98}. Mergers of compact object binaries are also most\noften considered sources of gravitational waves. As gravitational wave\ndetectors, LIGO and VIRGO, will soon be operational,  the question of these\nmerger rates arises \\cite{allen99}.\n\nTo predict compact object merger rates we use Monte Carlo simulations to\nproduce populations of different compact object binaries.\nIn this approach one generates massive binaries at ZAMS and evolves them\nthrough consecutive stages of single and binary star evolution, which may\neventually lead to formation of a compact object binary.\nFinal synthesis of large ensembles of compact object binaries allows then\nstatistical studies and calculation of expected merger rates.\n\nSeveral compact object merger\nrates estimates \\cite{narayan91,phinney91,tutukov93,zwart96b,bb1,bbz,fryer99a}\nhave been already published. However,\ncalculations of this rates are based on many assumptions and use parameters\nwith very uncertain values. Whereas the  evolution of single stars is reasonably well\nknown \\cite{eggleton89",
    "author": "Krzysztof Belczy{\\'n",
    "title": "Looking for GRB progenitors"
}