{
    "affiliation": "partment of Astronomy, The Ohio State University, Columbus, OH 43210;\naberlind,dhw@astronomy.ohio-state.edu}\n\\altaffiltext{1}{Present Address: Department of Astrophysical Sciences, \nPrinceton University, Princeton, NJ 08544-1001; vijay@astro.princeton.edu}\n\n\\begin{abstract}\n\nWe show that a regression of unsmoothed peculiar velocity measurements\nagainst peculiar velocities predicted from a smoothed galaxy density\nfield leads to a biased estimate of the cosmological density parameter \n$\\Omega$, even when galaxies trace the underlying mass distribution and\ngalaxy positions and velocities are known perfectly.  The bias arises\nbecause the errors in the predicted velocities are correlated with the\npredicted velocities themselves.  We investigate this bias using \ncosmological N-body simulations and analytic arguments.  In linear\nperturbation theory, for cold dark matter power spectra and Gaussian \nor top hat smoothing filters, the bias in $\\Omega$ is always positive,\nand its magnitude increases with increasing smoothing scale.\nThis linear calculation reproduces the N-body results \nfor Gaussian smoothing radii $R_s \\ga 10\\hmpc$, while non-linear\neffects lower the bias on smaller smoothing scales, and for $R_s \\la 3\\hmpc$ \n$\\Omega$ is underestimated rather than overestimated.  \nThe net bias in $\\Omega$ for a given smoothing filter depends on the\nunderlying cosmological model.  The effect on current estimates of $\\Omega$ \nfrom velocity-velocity comparisons is probably small relative to other\nuncertainties, but taking full advantage of the statistical precision of \nfuture peculiar velocity data sets will require either equal smoothing of\nthe predicted and measured velocity fields or careful accounting for the\nbiases discussed here. \n\n\\end{abstract}\n\n\\keywords{cosmology: theory, galaxies: distances and redshifts, \nmethods: numerical}\n\n\\section{Introduction}\n\nOne of the most popular approaches to constraining the mass density \nparameter $\\Omega$, the ratio of the average matter density to the critical\ndensity,  is based on comparisons between the galaxy density field mapped \nby redshift surveys and the galaxy peculiar velocity field inferred from \ndistance-indicator surveys (see the review by \\cite{strauss95",
    "author": "Andreas A. Berlind, Vijay K. Narayanan \\altaffilmark{1"
}