{"European Aviation Environmental Report 97[] EU, , Regulation (EU) / of the European Parliament and of the Council of  December  amending Directive //EC to continue current limitations of scope for aviation activities and to prepare to implement lobal market-based measure from .[] EEA, , EU ETS data viewer. Data extracted on //.[] EEX Group, , Market Data- Environmental markets.[] EU, , Directive (EU) / of the European Parliament and of the Council of  March  amending Directive //EC to enhance cost-eective emission reductions and low-carbon investments, and Decision (EU) /.[] ICAO, , Resolution A-: Consolidated statement of continuing ICAO policies and practices related to environmental protectiolobal Market-based Measure (MBM) scheme.Aviation Environmental Impacts[] Basner M, Babisch W, Davis A, Brink M, Clark C, Janssen S, Stansfeld S., , Auditory and non-auditory eects of noise on health.[] World Health Organization Europe, , Burden of disease from environmental noise Quantication of healthy life years lost in Europe.[] H.M.E. Miedema, , Annoyance caused by environmental noise: Elements for evidence-based noise policies.[] H.M.E. Miedema, C.G.M. Oudshoorn, , Annoyance from transportation noise: relationships with exposure metrics DNL and DENL and their condence intervals.[] Basner M, Clark C, Hansell A, Hileman JI, Janssen S, Shepherd K, et al., , Aviation noise impacts: state of the science.[] Forum Flughafen & Region Umwelt-und Nachbarschaftshaus, , NORAH Knowledge No. - NORAH Noise Impact Study Overview of Results.[] Guski, R., Klatte, M., Moehler, U., Muller, U., zur Nieden, A., Schreckenberg, D., , NORAH (Noise Related Annoyance, Cognition and Health): Questions, designs and main results.[] Forum Flughafen & Region Umwelt-und Nachbarschaftshaus, , NORAH Knowledge No. - Aircraft noise and nocturnal sleep.[] Zurich Airport, , Zurich Airport Regional Air Quality Study .[] ACI EUROPE, , Ultrane Particles at Airports.[] Zurich Airport, , Taxi-Emissions at Zurich Airport- Calculation Analysis and Opportunities.[] Zurich Airport, , Ultrane Particle Measurements at Zurich Airport.[] Barrett et al., , Global Mortality Attributable to Aircraft Cruise Emissions.[] Yim et al., , Global, regional and local health impacts of civil aviation emissions.[] Keuken et al., , Total and size-resolved particle number and black carbon concentrations in urban areas near Schiphol airport (the Netherlands), Atmospheric Environment  (), p. -.[] Syddansk Universitet et al., , Helbredsskader og partikelforurening iKbenhavns Lufthavn, Kastrup.":0}