{"European Aviation Environmental Report 102Population DataThe JRC Global Human Settlement population grid was used to calculate the number of people exposed to aircraft noise. This spatial dataset, developed in the European Copernicus Program, depicts the distribution and density of residential population. The dataset is generated using the  censuses provided by Eurostat/GEOSTAT and the best available sources by country. The initial  km resolution has been further disaggregated to based on information from Corine Land Cover Rened nd the European Settlement Map .Models and methodsIMPACTIMPACT is aweb-based modelling application used to assess the environmental impacts of aviation, and whose development, initiated in the context of the SESAR  programme, has since been steered and carried out by EUROCONTROL. It allows the consistent assessment of trade-os between noise and full-ght gaseous emissions thanks tcommon advanced aircraft performance-based trajectory model usincombination of the ANP database and the latest release of the BADA family. CO, NOX, HC, CO and PM emissions are computed using the LTO emission indices in the ICAO EDB and FOI Turboprop Emissions database combined with the Boeing Fuel Flow Method  (BFFM). PM emission indices of jet engines are estimated using the First Order Approximation (FOA.) method. Both BFFM and FOA. methods are detailed in the ICAO Airport Air Quality Manual (Doc ). The IMPACT methodology and data to assess fuel burn and emissions may dier from that used by Member States to report their emissions to UNFCCC or CLRTAP, hence the delta in estimates between these data sources.System for Airport Noise Exposure Studies (STAPES)STAPES imulti-airport noise model jointly developed by the European Commission, EASA and EUROCONTROL. It consists osoftware compliant with Annex II of Directive //EC and ECAC Doc  modelling methodology, combined with database of airports with information on runway and route layout, as well as the distribution of aircraft movements over these runways and routes. The  European airports within EU and EFTA modelled in STAPES are estimated to cover approximately three quarters of the total population exposed to aircraft noise levels of Lden nd above in this region.Aircraft Assignment Tool (AAT)AAT iet and operations forecasting model jointly developed by the European Commission, EASA and EUROCONTROL. AAT convertpassenger demand forecast into detailed operations by aircraft type and airport pair fogiven future year and scenario, taking into account aircraft retirement and the introduction of new aircraft into thet. It is now an integral part of the STATFOR -year forecast methodology. The forecast operations are processed through the IMPACT and STAPES models to assess the fuel burn, emissions and noise data in , , nd  presented in the Sector Overview chapter.AEROAERO is an application owned by EASA that is used to examine the impacts of dierent policies intended to reduce international and domestic aviation greenhouse gas emissions. AERO can assess the consequences owide range of policy measures aimed at reducing aviation emissions, including technological, operational and market-based measures. For this report, AERO was used to assess the impact of the EU Emissions Trading System in years ,  and  based on the STATFOR medium-term Base forecast (see Sector Overview and Market-Based Measures chapters) and trac data supplied by EUROCONTROL. No analysis was conducted beyond  due to on-going discussions on ways to implement CORSIA in the EU througrevision of the ETS Directive, which would be consistent with the EU  climate and energy framework.32 European Commission, Joint Research Centre (JRC) [Dataset] 33 Due to the lack of smoke number data for turboprop engines, PM estimates currently exclude this category. As an indication, turboprop aircraft represented approximately 1.5% of the tuel burn in 2017.":1}