{"European Aviation Environmental Report 101BADABADA (Base of Aircraft Data) is an Aircraft Performance Model developed and maintained by EUROCONTROL, in cooperation with aircraft manufacturers and operating airlines. BADA is based okinetic approach to aircraft performance modelling, which enables to accurately predict aircraft trajectories and the associated fuel consumption. BADA includes both model specications which provide the theoretical fundamentals to calculate aircraft performance parameters, and the datasets containing aircraft-specic coecients required to calculate their trajectories. The BADA  family is todays industry standard for aircraft performance modelling in the nominal part of theight envelope, and provides close to % coverage of aircraft types operating in the European region. The latest BADA  family provides increased levels of precision in aircraft performance parameters over the entirht envelope, and covers % of aircraft types operating in the European region. This report uses BADA , complemented by BADA  for aircraft types not yet covered in BADA .Aircraft Noise and Performance (ANP) DatabaseThe Aircraft Noise and Performance (ANP) database is maintained by the US Department of Transportation, EUROCONTROL and EASA. It provides the noise and performance characteristics for over  civil aircraft types, which are required to compute noise contours around civil airports using the calculation method described in Annex II of European Directive //EC relating to assessment and management of environmental noise, ECAC Doc  and ICAO Doc  guidance documents. ANP datasets are supplied by aircraft manufacturers for specic airframe-engine types, in accordance with specications developed by the ICAO and European bodies. EASA is responsible for collecting, verifying and publishing ANP data for aircraft which fall under the scope of Regulation (EU/.EASA Certication Noise LevelsEASA maintaindatabase of all aircraft noise certication levels which the Agency has approved. The database provides certied noise levels for over , aircraft variants, including jet, heavy and light propeller aircraft as well as helicopters. In this report, the certied noise levels are used to assess the Noise Energy Index, to attribute an ANP airframe-engine type to each aircraft type in thet using the ECAC Doc  th Edition recommended substitution method, as well as to create the noise charts in the Technology and Design chapter.ICAO Aircraft Engine Emissions Databank (EEDB)The ICAO Aircraft Engine Emissions Databank (EEDB) hosted by EASA contains Landing and Take-OLTO) emissions data for NOX, HC, CO as well as smoke number for over  jet engine types. The EEDB emission indices are used by the IMPACT model to compute NOX, HC, CO and PM, and to create the NOx charts in the Technology and Design chapter.FOI Turboprop Emissions DatabaseThe Swedish Defence Research Agency (FOI) hostdatabase of NOX, HC and CO emission indices for turboprop engine types. The data was supplied by the turboprop engine manufacturers, originally for the purposes of calculating emissions-related landing charges. It is used to complement the ICAO EEDB for the NOX, HC and CO estimates in this report.CODA Taxi Times DatabaseEUROCONTROLs Central Oce for Delay Analysis (CODA) collectght-by-ght data from around  airlines and  airports, such as actual o-block and take-oimes, and delay causes. Largely this is ovoluntary basis in return for performance and benchmarking information, but increasingly the data collection is inuenced by the EU performance regulations . CODA publishes aggregated performance statistics, such as on punctuality and all-causes delays from these data. The detailed actual taxi times from this source were used to assess taxi fuel burn and emissions.28 www.easa.europa.eu/easa-and-you/environment/easa-ceration-noise-levels29 www.easa.europa.eu/easa-and-you/environment/icao-aircraft-engine-emissions-databank 30 www.foi.se/en/our-knowledge/aeronautics-and-air-combat-simulation/fois-ctial-database-for-turboprop-engine-emissions.html 31 www.eurocontrol.int/coda ":1}