{"European Aviation Environmental Report 103AssumptionsFuel burn, emissions and noise assessmentFor consistency with other international emission inventories, full-ght emissions presented in this report are for alghts departing from EU or EFTA, i.e.ights coming from outside EU or EFTA are not included. In contrast, emissions below , feet and noise indicators include all departures and all arrivals. Historical fuel burn and emission calculations are based on the actuaght plans from PRISME, including the actuaght distance and cruise altitude by airport pair. Future year fuel burn and emissions are based on actuaght distances and cruise altitudes by airport pair in . Future taxi times are assumed to be equal to the  taxi times; where noavailable, ICAO default taxi times are applied. Helicopter operations are excluded from the assessment.For the STAPES noise assessments, the number of airports, together with their respective runway and route layout, were assumed to be constant over the full analysis perio i.e. only thet, the number and time of operations vary. The standard take-ond landing proes in the ANP database were applied. For historical noise, the day/evening/nighght distribution was based on actual local departure and landing times assuming the Environmental Noise Directive [] default times for the three periods: day = : to :, evening = : to :, night = : to :. For future years, the day/evening/nightight distribution at each airport was assumed to remain unchanged. Population density around airports was also assumed to remain unchanged throughout the analysis period. The mapping of thet to the ANP aircraft follows the ECAC Doc  th Edition recommended substitution method.In addition to the noise contours at the  airports modelled in STAPES, the noise generated by aircraft take-os and landings at all airports in the EU and EFTA area was estimated via the noise energy index, dened as:Noise EnergaircraftNdep + Narr LAT+FOAPP-()whereNdep and Narr are the numbers of departures and arrivals by aircraft type weighted for aircraft substitution;LAT, FO and APP are the certied noise levels in EPNdB at the three certication points (lateralyover, approach) for each aircraft type.Noise exposure-response curvesTo estimate the total population highly annoyed (HA) and highly sleep disturbed (HSD) by aircraft noise, the following exposure-response regression curves recommended by WHO for the European region were used []:Share of population highly annoyed (%HA. + . * Lden + . * LdenShare of population highly sleep disturbed (%HSD) = .. * Lnight + . * LnightThe total population at the  major airports in STAPES was assessed for Lden values between  and nd for Lnight values between  and  dB with one decibel increment, and then multiplied by the corresponding %HA and %HSD values. As the Lden and Lnight values represent outdoor noise levels, the annoyance and sleep disturbance estimates may not take into account the eect of local sound insulation campaigns for houses and buildings around airports.34 For Chapter 6 and 10 aircraft (light propeller), the unique ovt or take-el is used for the three values.":1}