{"increased knowledge and considering the disease as important.In this study, as we did not have enough data about the cost effectiveness of telephone follow-up, this issue is open for comments.  Cost effectiveness of this short-period study might beincreased as the frequency of hospital visits was increased. Nevertheless, our primary aim was to investigate the effect ofnurse telephone calls on glycemic parameters. Long-term application of this intervention may possibly cause reduction inthe frequency of hospital visits. As most patients (68.6%) in thestudy did not monitor their blood glucose levels at home, theywent to hospitals,  which could be the reason for the  increasednumber of hospital visits. Interventions to improve glycemic con-trol may help to prevent long-term complications, which maylead to cost savings that outweigh the costs of the intervention.Patients were satisfied with the nurse-led telephone follow-up.As the number of patients was limited, all patients could be sat-isfied with the follow-up. In a study about Automated TelephoneDisease Management (ATDM)  85% of patients reported thatthey were satisfied with the ATDM calls and the result of thisstudy supported our result. In the same study, 76% of patientsreported that they personally would choose to receive such callsin the future (29).Although the number of patients was low and the study periodwas short, this study showed that telephone follow-up can beused for the outpatient diabetes management. The number ofpatients was limited because the study was conducted by oneresearcher and  every patient was followed for at least threemonths.ConclusionThese findings indicate that a nurse telephone intervention mayimprove glycemic parameters including HbA1c, fasting bloodglucose, postprandial blood glucose, as well as diet, exercise,and medication adherence. In conclusion, in related clinics, a specialized nurse can be employed as a case director to meet counseling requirements ofdiabetic patients and this nurse-led phone follow-up programcan be improved and comprehensively served. AcknowledgementsThe authors thank clinical members of the Internal Medicine,Gulhane School of Medicine, for assistance with the conduct ofthe study. References1. King H, Rewers M. Global estimates for prevalence of diabetes mellitus and impaired glucose tolerance in adults: The WHO AdHoc Diabetes Reporting Group. Diabetes Care 1993; 16: 157-177.2. King H, Aubert RE, Herman WH. Global burden of diabetes, 1995-2025:Prevalence, numerical estimates, and projections. Diabetes Care 1998;21: 1414-1431.3. Satman I, Ylmaz T, Sengl A, Salman S, Uygur S, Bastar I, et al. Popula-tion-based study of diabetes and risk characteristics in Turkey, results ofthe Turkish diabetes epidemiology study (TURDEP). Diabetes Care 2002;25: 1551-1556.4. Diabetes Control and Complications Trial Research Group (DCCT). Theeffect of intensive treatment of diabetes on the development and progression of long-term complication in insulin dependent diabetesmellitus. The New England Journal of Medicine 1993; 329: 977-986. 5. United Kingdom Prospective Diabetes Study Group (UKPDS) (1998). Intensive blood-glucose control with sulphonylureas or insulin compared with conventional treatment and risk of complications in patients with type 2 diabetes (UKPDS 33). Lancet 1998; 352: 837-853.6. Diabetes Control and Complications Trial Research Group (DCCT). Lifetime benefits and costs of intensive therapy as practiced in the diabetes control and complications trial. Journal of the American Medical Association 1996; 276: 1409-1415.7. United Kingdom Prospective Diabetes Study Group (UKPDS) (1999). Quality of life in type 2 diabetic patients is affected by complications butnot by intensive policies to improve blood glucose or blood pressurecontrol (UKPDS 37). Diabetes Care 1999; 22: 1125-1136.8. American Diabetes Association. Standards of medical care in diabetes.Diabetes Care 2004; 27: 15-35.9. Aubert RE, Herman WH, Waters J, Moore W, Sutton D, Peterson BL, et al.Nurses case management to improve glycemic control in diabeticpatients in a health maintenance organization. Annals of Internal Medicine 1998; 129: 605-612.10. Cox K, Wilson E. Follow-up for people with cancer: nurse-led servicesand telephone interventions. Journal of Advanced Nursing 2003; 43: 51-61.11. Huber DL, Blanchfield K. Telephone nursing nterventions in ambulatorycare. Jona 1999; 29: 38-44.12. Piette JD, Weinberger M, Mcphee SJ, Mah CA, Kraemer FB, Crapo LM.Do automated calls with nurse follow-up improve self-care and glycemic control among vulnerable patients with diabetes? Am J Med2000; 108: 20-27. 13. Weinberger M, Kirkman S, Samsa GP, Shortliffe EA, Landsman PB, Cow-per PA, et al. A nurse-coordinated intervention for primary care patientswith noninsulin-dependent diabetes mellitus: Impact on glycemic control and health-related quality of life. Journal of General Internal Me-dicine 1995; 10: 59-66.14. Boucher JL, Pronk NP, Gehling EM. Telephone-based lifestyle counseling. Diabetes Spectrum 2000; 13: 190-194.15. Nauright LP, Moneyham L, Williamson J. Telephone triage and consultation: An emerging role for nurses. Nursing Outlook 1999; 47;219-226.16. Greenberg ME. Telephone nursing: Evidence of client and organizationalbenefits. Nursing Economic 2000; 18: 117-123.17. Coban S, Engin M. Telemedicine: Methods and Applications. BIYOMUT,National Symposium on Biomedical Engineering, Istanbul-TURKEY2005.18. Hall JA, Milburn MA, Epstein AM. A causal model of health status andsatisfaction with medical care. Med Care 1993; 31: 84-94.19. Piette JD, Kraemer FB, Weinberger M, McPhee SJ. Impact of automatedcalls with nurse follow-up on diabetes treatment outcomes in a department of Veterans Affairs health care system. Diabetes Care 2001;24: 202-208.20. Kim HS, Oh JA. Adherence to diabetes control recommendations: Impact of nurse telephone calls. Journal of Advanced Nursing 2003; 44:256-261.21. Chan YM, Molassiotis A. The relationship between diabetes knowledgeand compliance among Chinese with non-insulin dependent diabetesmellitus in Hong Kong. Journal of Advanced Nursing 1999; 30: 431-438. 22.Glasgow RE, Anderson RM. In diabetes care, moving from complianceto adherence. Diabetes Care 1999; 22: 2090-2094.23. Mcdonald PE, Tilley BC, Havstad SL. Nurses perceptions: Issues that arise in caring for patients with diabetes. Journal of Advanced Nursing1999; 30: 425-430.24. Wong FK, Mok MP, Chan T, Tsang MW. Nurse follow-up of patients withdiabetes: Randomized controlled trial. Journal of Advanced Nursing2005; 50: 391-402.25. McNabb WL. Adherence in diabetes: Can we define it and can we measure it? Diabetes Care 1997; 20: 215-219.26. Sadur CN, Moline N, Costa M, Michalik D, Mendlowitz D, Roller S, et al.Diabetes management in a health maintenance organization. Efficacyof care management using cluster visits. Diabetes Care 1999; 22: 2011-2017.27. Gozzoli V, Palmer AJ, Brandt A, Spinas GA. Economic and clinical impactof alternative disease management strategies for secondary preventionin type 2 diabetes in the Swiss setting. Swiss Medical Weekly 2001; 131:303-310.28. Brooten D, Naylor MD. Nurses effect on changing patient outcomes.The Journal of Nursing Scholarship. 1995; 27: 95-99.29. Piette JD. Satisfaction with automated telephone disease managementcalls and its relationship to their use. Diabetes Educ 2000; 26: 1003-10.nar et al.The Effectiveness of Nurse-led Telephone Follow-up in Patients with Type 2 Diabetes MellitusTurk Jem 2010; 14: 1-55":0}