"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 169 -   The research findings indicate that the ADP does have some kind of strategic approach to TNA practice since it is clear that it is committed to an analysis of needs at all three levels, taking into consideration, the overall requirements of the organisation, the jobs concerned, and the particular employees performing them. Hence, the ADP does not rely on just one source of data. In addition, the empirical data reveals that the majority of employees are aware of the importance of TNA and the positive impact of the process on training within the ADP.  It appears from the empirical evidence reported in this chapter that to a certain extent, all methods are used by the ADP to identify the training needs of employees. However, the most popular method is clearly performance appraisal  as indicated on the documentation associated with that, and formal job descriptions. This finding is of no surprise as performance appraisals are often considered the most common and widely used method in TNA (Brown, 2002; Agnaia, 1996). However, the practice is considered acceptable only if companies have fulfilled certain criteria and taken necessary measures as discussed in Chapter Twoin order to ensure that such appraisals are capable of accurately determining their training needs. Furthermore, there is also the concern that the ADP depends on this method without being seriously concerned as to whether or not it could produce meaningful TNA outcomes.  Evidence collected during the field work with the ADP reveals certain barriers which prevent the TNA process from being implemented effectively. These barriers are: training supervisors within the ADP lack expertise in conducting TNA; TNA techniques fail to produce reliable information for the employees; family, nepotism, kinship and personal relationships between the supervisors and employees disturb the selection process in respect of training in the ADP; organisational culture (norms, values, and beliefs), bureaucratic policies, and roles sometimes interfere with TNA; and there is a lack of communication between the employees and their supervisors.  It would appear from the evidence reported in this chapter that research findings support the development of the framework for TNA. The findings suggest that TNA within the ADP is determined by four main sets of constructs: involving TNA stakeholders in the ADP; application of O-T-P "