"References & Bibliography 2014  - 192 -  Ferdous, T. and Razzak, B.M. (2012) \"Importance of Training Needs Assessment in the Banking Sector of Bangladesh: A Case Study on National Bank Limited\", International Journal of Business and Management, vol. 7, no. 10, pp. 63-73.  Fernandez, J. (1988) Russir une activit de formation, Editions Saint-Martin.  Fitzgerald, W. (1992) \"Training versus Development\", Training and Development Journal, vol. 4, no. 5, pp. 81-84.  Flick, U. (2007) An Introduction to Qualitative Research, 3rd edn, Sage, London.  Floodgate, J.F. and Nixon, A. (1994) \"Personal Development Plans:: The Challenge of ImplementationA Case Study\", Journal of European Industrial Training, vol. 18, no. 11, pp. 43-47.  Foley, S. (1999) \"The UAE: Political Issues and Security Dilemmas\", Middle East, vol. 3, no. 1, pp. 25-45.  Ford, J.K. and Noe, R.A. (1987) \"Self-assessed training needs: the effects of attitudes toward training, managerial level, and function\", Personnel Psychology, vol. 40, no. 1, pp. 39-53.  Ford, J.K. and Noe, R.A. (1987) \"SelfAssessed Training Needs: The Effects of Attitudes Toward Training, Managerial Level, and Function\", Personnel Psychology, vol. 40, no. 1, pp. 39-53.  Freeman, R.E. (1984) Strategic Management: A Stakeholder Approach  , McGraw-HilI, New York.  Garavan, T.N. (1997) \"Training, development, education and learning: different or the same?\", Journal of European Industrial Training, vol. 21, no. 2, pp. 39-50.  Gasc, J.L., Llopis, J. and Gonzlez, M.R. (2004) \"The use of information technology in training human resources: An e-learning case study\", Journal of European Industrial Training, vol. 28, no. 5, pp. 370-382.  Ghauri, D. and Gronhaug, K. (2005) Research methods in Business Studies: A practical guide, 3rd edn, Prentice Hall., UK.  Ghauri, P. and Grnhaug, K. (2010) Research Methods in Business Studies, 4th edn, Financial Times Prentice Hall, Harlow. Ghuman, K. (2010) Management: Concepts, practice & cases, Tata McGraw-Hill Education.    Gibbs, G.R. (2002) Qualitative data analysis: Explorations with NVivo, Open University Press, London.  Gibson, W. and Brown, A. (2009) Working with qualitative data, Sage Publications Limited, London.  "