"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 152 -  reports may be unclear, may not have been prepared recently or may be subject to the family and friendship ties already mentioned, which are not surprising in a country like the UAE, where the individuals have strong solidarity with their family, friends and their tribes.   Criteria for selecting the Training Needs Analysis data collection methods In considering the criteria used to select the methods for collecting data for the TNA process in the ADP, group one and two of the participants were asked this question. All of the criteria in choosing data collection methods as suggested by Steadham (1980), and Brown (2002), were, to a certain extent, considered by the interviewees, but75% of all participants said that top management preferences, and employee acceptance are the main basis of the TNA data collection method in the ADP. In order of importance, the remaining criteria considered by the organisation were: Time required, Cost-effectiveness, Organisational Culture and values, Expertise of the HR staff, Ease of use, Sample size, and Confidentiality. In addition, the similarities of findings can be seen when comparing the top seven criteria considered important by organisations in four studies, namely those conducted by Jamil (2006), Elbadri (2001), Gray et al. (1997) and this study.  Table 6.30: Seven Most Important Criteria in Choosing Data Collection Methods Present research Jamil (2006)  Elbadri (2001) Gray et al.(1997) Top management preferences Desired outcomes Relevancy and quantifiable data Relevancy and quantifiable data Employee acceptance Organisational culture and values Incumbent involvement Acceptance likeliness by senior management, line managers, and target employees Time required Cost-effectiveness Cost Management and employee participation Cost-effectiveness Persons to be involved Tim Cost Organisational Culture Time required Ease of use Availability and expertise of HR staff to administer Expertise of the HR staff Degree of reliability and validity required __________ Time required Ease of use Top management preferences __________ Ease of use Source: Fieldwork; Jamil, 2006; Elbadri, 2001; and Gray et al., 1997   Sources of Data in different levels "