"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 134 -   Individual Level  Yes % Performance appraisal data 11 100 Skills, Knowledge and Abilities (KSAs) tests results 9 82 Supervisors suggestion 7 64 Attitude survey 3 27 Assessment survey 2 18 N=11, Source: Fieldwork(2011-2012)   Perceptions of TNA Practices: In answering the question relating to the overall perceptions of TNA practices in the ADP, the interviewees gave responses as presented in Table 6.16, where the data are shown according to the highest percentage. Table 6.16: Perceptions of TNA Practices Overall Perceptions Regarding TNA Practices  Yes % TNA emphasiseffectiveness 11 100 TNA ensures that organisational needs are linked with employee needs 11 100 The management of this organisation believes that the TNA process is cost effective 11 100  10 91 It provides a benchmark for evaluating training and records the justification for the training budget. 10 91 The management of this organisation believes that TNA is central for improving the training effectiveness 10 91 TNA methods used by the ADP produce clear, relevant, specific data on performance discrepancies 9 82 TNA is conducted to differentiate performance problems caused lack of skills, knowledge and abilities (KSAs) and problems caused by other factors 9 82 Top managers are committed to the TNA function 9 82 The planning of TNA initiatives is congruent with your corporate culture 9 82 TNA methods used by the ADP make it possible to distinguish between training that employees need and training that they want 7 64 The present volume of TNA is adequate to solve your current problems 7 64 Training needs will only be fulfilled if they are in line with the orstrategic needs 5 45 N=11, Source: Fieldwork(2011-2012)   Section C: Training Decisions This section, presents information on how training decisions are made in terms of who should attend and what training programmes are launched.   Involvement in selecting the trainees: In answering the question relating to the selection of trainees, six of the eleven interviewees stated that they were "