"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 155 -  highlighted by Amos-Wilson (1996) who reported a mismatch between the overall organisational strategic needs and the types of training actually delivered by NGOs in the United Kingdom.  Moreover, more the half of the participants in the study seemed quite confident with the methods they used to analyse training needs. They felt that the techniques they adopted were capable of producing clear, relevant, and specific data on performance discrepancies. Most of them also perceived that the methods could differentiate hods in use by producing accurate training needs. However, if we look at the overall results of the study, specifically the TNA methods used in the organisation, a different conclusion can be made. It was found earlier that the most commonly used TNA method was performance appraisal forms, but in Chapter Two, it was stressed that such documentation could only be a useful method of gathering data for the TNA process if the appraisal forms themselves were properly designed and the appraisal system properly implemented in a transparent manner. For that reason, it is difficult to say clear, relevant, and specific data on performance discrepancies, and whether these reflection of the situation, since there is no evidence of whether the method used (in this case, performance appraisal forms) was indeed effective. In that sense, the results of the study probably do not differ much compared to those obtained by Gray et al.(1997), and Elbadri (2001), who both found mixed evidence concerning the same two statements.  Moreover, the participants felt that TNA conducted in their organisation could caused by other non-KSAs factors. As mentioned in Chapter Two, this demarcation is critical for the success of training programmes and it is important for training needs analysts to understand the differences. The majority (86%) of the interviewees believed that the management of the ADP did think the TNA process was cost-effective and 80% of them also considered that the process provided a benchmark for evaluating training and also provided a justification for the training budget.  "