"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 151 -  that that direct observation of work practices followed by an examination of individual performance were the most important TNA techniques. And Agnaia (1996) found that the most commonly used assessment techniques by Libyan companies were performance appraisals followed by questionnaires, while interviews were the least used method. The results from this study show that to a certain extent, all methods were used by the ADP to identify the training needs of the employees. However, the most popular method was performance appraisal forms and the job descriptions of individuals. This finding is of no surprise as performance appraisals are often considered the most common and widely used method in TNA (Brown, 2002; Agnaia, 1996), as in theory, they provide information about the achievements and productivity levels of individual employees. However, as discussed in Chapter Two, the use of this method is filled with shortcomings, and many researchers have warned of its weaknesses (Roberts, 2002; Leat and Lovell, 1997; Herbert and Doverspike, 1990). And certainly in a Middle Eastern environment where tribal affiliation, and personal relationships brought about by kinship affect the work environment, performance appraisals cannot be guaranteed as objective.  To sum up this discussion, it can be assumed from the results that the ADP does rely heavily on performance appraisals as a method to gather TNA data. This practice is considered acceptable only if companies have fulfilled certain criteria and taken necessary measures as discussed in Chapter Two in order to ensure that such appraisals are capable of accurately determining their training needs. However, there is also the fear that the ADP depends on this method without being seriously concerned as to whether or not it could produce meaningful TNA outcomes. Moreover, the least used methods were interviews with employees, and KSAs tests, which indicate that the ADP pays more attention to the job than to the individual. It can be seen from the practice of using appraisals that the organisation avoids meeting the employees directly, and simply tries to collect data from supervisors/line managers through the performance appraisal reporting system or from the job description. Sometimes this is because the aim of management is to analyse the job performance, and not to diagnose other factors relating to the individual doing his/her job. However, assessing training needs by performance reports does not precisely reflect the true situation of employees for many reasons. For example, the "