"References & Bibliography 2014  - 199 -  McClelland, S.B. (1993) \"Training Needs Assessment: An 'Open-systems' Application\", Journal of European Industrial Training, vol. 17, no. 1, pp. 12-17.  McClelland, S.D. (2002) A training needs assessment for the united way of Dunn County Wisconsin, MSc edn, University of Wisconsin-Stout, USA.  McConnell, J.H. (2003) How to identify your organization's training needs: A practical guide to needs analysis, Amacom Books, New York.  McCoy, C.P. (1993) Managing a small HRD department: You can do more than you think, Jossey-Bass Publishers, San Franscisco.  McCracken, M. and Wallace, M. (2000) \"Exploring strategic maturity in HRDrhetoric, aspiration or reality?\", Journal of European Industrial Training, vol. 24, no. 8, pp. 425-426.  McCutcheon, D.M. and Meredith, J.R. (1993) \"Conducting case study research in operations management\", Journal of Operations Management, vol. 11, no. 3, pp. 239-256.  McEnery, J. and McENERY, J. (1987) \"Selfrating in management training needs assessment: A neglected opportunity?\", Journal of Occupational Psychology, vol. 60, no. 1, pp. 49-60.  McGehee, W. and Thayer, P.W. (1961) Training in business and industry. Wiley, New York.  McGoldrick, J., Stewart, J. and Watson, S. (eds) (2002) Understanding Human Resource Development: Philosophy, Processes & Practices, Routledge, London.  Michalak, D.F. and Yager, E.G. (2001) Making the training process work, Writers Club Press, USA.  Miles, M.B. and Huberman, A.M. (1994) Qualitative data analysis: An expanded sourcebook, 2nd edn, Sage Publications, London.  Miller, J.A. and Osinski, D.M. (2002) Training needs assessment, White Paper edn, Society For Human Resource Management (SHRM), USA.  Mishra, P.C. (2011) \"Models and Relevance of Training Needs Analysis for Effective Design, Delivery and Evaluation of Training Activities and Improvement of Organizational Performance\", SAARANSH, vol. 2, no. 2, pp. 1-8.  Moore, M.L. and Dutton, P. (1978) \"Training needs analysis: Review and critique\", Academy of Management Review, vol. 3, no. 3, pp. 532-545.  "