"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 144 -  Table 6.29: Age Group of the Participants  Respondents Group  25 < 34 35 < 44 45 and above Senior Executives 5 11 4 Trainers 6 5 0 Trainees 12 8 0 Total 23 24 4 N= 51, Source: Table 6.3, 6.12, and 6.21  6.3.2 Current Practices of Training Needs Analysis at ADP The review of the literature on training and TNA provided in Chapter Two shows that a systematic approach to training should begin with TNA. Understanding employee training needs has been shown to be important, not least because it ensures the effective use of resources, and provides the answer as to whether training is the appropriate solution for employee performance deficiencies (Guthrie and Schwoerer, 1994; Brookes, 1995). In this regard, Bee and Bee (2003) assert that assessing training needs plays a very important role in identifying individuals who need to be trained, in designing the programme that relates to the needs of both individuals and the organisation, allocating the required time, determining the programme objectives and the required skills, and determining the required resources for implementing the programme. It is accepted that TNA should be based on analysing organisational tasks or jobs and personal needs, and not simply on one source of analysis.  Consequently, this section focuses on investigating the practice of TNA from different perspectives, that is to say, from the viewpoints of senior executives, trainers, and trainees.  In order to understand the whole picture of the TNA process in the ADP, participants were asked different important questions regarding the regularity of conducting the TNA process, discussion on training needs between supervisors and trainees, TNA methods, criteria used when selecting the TNA data collection methods, the importance of TNA in the ADP, levels of TNA in the ADP, sources of data in different levels, and level of perceptions of TNA practices. The responses are discussed and analysed under several themes.   "