"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 136 -  providers external to the Force. The reason given was to take advantage of the expertise of such professional organisations in developing strategic training plans in the training process in general.   Section D: Effectiveness of Training Needs Analysis This section provides information on the strategic nature of the training function and the role it plays in shaping the overall strategy of the ADP Force.   Application of learning from the training programmes in the ADP: In answering this question, only five of the interviewees in this group stated that the employees of the ADP apply what they have learned in their training programmes in their service life. They did at the same time say it was sometimes difficult for them to actually do that. The remaining six interviewees in this sample did not agree with this statement. According to one of the participants, not everything learned through training could be applied in the reality because the employee has to be willing and eager to put the theory into practice, and that cannot be guaranteed.  Effectiveness of existing method of conducting TNA in the ADP: Five of the interviewees in this group stated that the methods of TNA in the ADP were actually ideal, but the other six (more than half,) disagreed with this statement.  Assessing the Effectiveness of Training Needs Analysis: In answering the question regarding the process of assessing the effectiveness of TNA in the ADP, the participants gave opinions as shown in Table 6.19, where data are presented based on the highest percentage. Table 6.19: Effectiveness of Training Needs Analysis Effectiveness of Training Needs Analysis  Yes % Employees are motivated to participate in the TNA process  11 100 The job-related competency requirements are ranked according to their importance 10 91 Before considering training, you carefully assessed if the problem could have been somewhere else (such as the work environment, the tools, and reward systems) 10 91 The organisation has a clear on-going plan for training 10 91  10 91 Training objectives are in harmony with the Abu Dhabi Police culture 10 91 The relationship between the training staff/external training specialists and line managers is based on mutual understanding and an exchange of ideas to solve problems related to human resource development 9 82 "