"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 153 -  The participants of group one and two were asked to rate the extent to which they had referred to several sources of data as recommended by Blanchard and Thacker (2012). In performing TNA at the organisational level, 90% of the respondents claimed they referred to their organisational goals and objectives as the main data source. The next two most referred sources were management requests and changes in the system and sub-system. Skills inventory, manpower inventory, and organisational climate indices were not referred to as often as thought by the participants. It is assumed from this finding that the organisations paid sufficient attention to ensuring that their training efforts were in line with their strategic objectives.  The most important documents referred to in performing operational analysis were the Job Description, and Person Specification. And in the individual analysis, the participants claimed that they referred mainly to performance appraisal data and suggestions from supervisors. These results coincide with the overall findings of the important elements in their organisational TNA practices.  A few similarities and differences can be found when comparing these findings to those of the study by Erffmeyer et al.(1991). Firstly, organisational goals and objectives were considered important organisational level data sources in both studies. However, the findings of the present study are probably more encouraging as Erffmeyeret al. (1991) found management judgment the most important source of data, which could suggest an informal TNA approach. Secondly, all three data sources referred to mostly at the operational level were also considered as important in the Erffmeyer el al. (1991) study. However, the judgment of the top management was again prioritised in their study. The data sources referred to by the senior executives and trainers in the ADP at the individual level analysis were also more favourable compared to the data sources referred to by the ASTD members in the study by Erffmeyer et al. (1991), as the only important data source they referred to    Perceptions of Training Needs Analysis Practices "