"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 138 -  interviewees. The data in this respect appears in Table 6.20, and the age group of the interviewees is given in Table 6.21.  Table 6.20: Educational Background - Sample Group Three Respondents Group High School Diploma Bachelor Master Not specified Trainees 8 2 6 2 2 Total 8 2 6 2 2 N=20, Source: Fieldwork(2011-2012)  Table 6.21: Age Group - Sample Group Three Respondents Group 25 < 34 35 < 44 45 and above Trainees 12 8 0 Total 12 8 0 N= 20, Source: Fieldwork(2011-2012)   Section B: Current Practices of Training Needs Analysis The questions relating to the current practices of TNA in the ADP were asked in this section, and the responses are presented below:  Discussion on training needs between Supervisor and the Trainees: Fifteen (15) of the trainees concurred that their supervisor asked them about their training needs, while five interviewees reported that they were never asked for their opinions in this matter. Sixteen of the trainees stated that they had been appraised less than 12 months ago, while the remaining four said that they had been appraised more than 12 months ago. Concerning the recommendations of their supervisors, fourteen trainees said that they were recommended for specific training while six of them reported that they had not been recommended for any specific training.  Job Description and Responsibilities: All twenty trainees said that they had been given a job description, and all but one of these confirmed that all their duties and responsibilities had been clearly stated in it. Fourteen trainees said that to a great extent the job description was related to their job, four believed the job description was only related to their job to some extent, and the remaining two felt that it was only related to a little extent.  Methods of Assessing Training Needs: Table 6.22 shows the methods used in the ADP to identify the needs of the trainees, with data being presented according to the highest percentage.  "