"Chapter Seven: Research Contributions, Conclusions & Recommendations 2014  - 174 -  TNA was obtained from multiple participants with different views, perceptions and experiences. The main advantages in using semi-structured interviews in this research was that they provided ample opportunities to ask follow-up questions and clarify issues and check the participants understanding of the topics until adequate answers and interpretations were gained. By using multiple sources of evidence, and being able to actually observe the participants at work, we were able to mitigate many potential sources of bias. Interpretative phenomenological analysis (with utilisation of  NVivo 8, qualitative data analysis software package) was the technique used for analysing the empirical data in this study.  In chapter Six, the empirical data collected in the qualitative interviews with the participants of the three groups of management, trainers, and trainees have been presented. The data gathered from the interviews participants have been reported on the basis of the five themes of the study namely: beginning with the demographic data of the participants, current practices of TNA, training decisions, effectiveness of TNA, and the barriers to its implementation, which collectively have addressed key issues concerning TNA, and how this is seen to operate in the ADP. This chapter also offered a discussion of the key findings yielded in a revised (enhanced) conceptual framework for TNA effectiveness. This revised model can be used as a reference point for organisations wanting to ensure the effectiveness of TNA. The revised framework illustrates that TNA success is influenced by four sets of factors. These are: the degree of stakeholder involvement; the model applied for conducting TNA (in this case, the O-T-P model); the degree to which the barriers to TNA can be identified and overcome; and the way in which the information obtained in TNA is utilised.  7.3 Recommendations On the basis of the aforementioned conclusions, the following recommendations are offered as a guide to reform the TNA process in the ADP.   Academic Qualification of the Trainees: Academic qualifications should be prioritised at the time of recruitment of employees for the ADP, as it is found that the average academic profile is very low. It is obvious that if the trainees are of poor "