"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 157 -   The least popular methods of selecting employees for training were discussing the course with the training manager and putting their names forward (37%) by the training managers, and the method of being chosen by colleagues to represent the department was acknowledged by 22% of interviewees.  This practice coincides with recommendations in the literature. In particular, Stanley (2002) stated that immediate supervisors were the most common and important sources of data because they were in the best position to observe the strengths and weaknesses of their subordinates. Likewise, Noe (2005) confirms this observation, noting that as middle-level managers, supervisors have the major concern of determining how their subordinates in their respective units could work towards the strategic goals of their organisation.  To conclude, the study found that the most important party involved in the selection of potential training participants within the ADP was the line manager, in effect, the immediate supervisors of lower level employees. They played the biggest part in recommending names for training and their views/approvals were considered the most important factor in determining candidates for training.  This scenario suggests a lack of two-way communication in the selection process, a shortcoming which was confirmrepresented the second most common way of choosing individuals for training. This finding runs parallel with findings from other parts of the study which indicated performance appraisals as an important element in the TNA process, and which showed performance data as a key source of information in conducting individual-level analysis in the organisation. This situation is in line with results reported in previous studies, for example, Jamil (2006) found that the most common ways of selecting participants were direction from supervisors (84% of his sample said this), and information from performance appraisals (69% of his sample said this). Agnaia(1996) also found that similar opinions among his research participants, with 83% citing direction from their bosses, and 50% referring to evidence of job performance as being the most common ways of selecting employees for training. In addition, Abdalla and Al-Hamoud (1995) report in their study of Kuwaiti companies, that 90% of these organisations rely on the direction of supervisors, and 72% on performance appraisals. "