"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 142 -   Appropriateness of existing TNA Methods in the ADP: Responding to the question relating to the appropriateness of the existing methods of TNA used by the ADP, thirteen of the interviewees stated that these were appropriate whereas the other seven said that they were not ideal.   Section E: Barriers to Training Needs Analysis In this section, questions relating to the general, cultural and technological barriers to the implementation of TNA were asked, and the responses are given below, ranked in order of frequency.  Lack of personnel to identify training needs  Needs analysis technique fails to produce reliable information  Family, nepotism, kinship and personal relationships between the supervisors and employees  Organisational culture (norms, values, beliefs, bureaucratic policies, etc)  Top management in our organisation is only interested in the result of the training  Lack of support for needs assessments from top management - Further improvement of the ADP: In answering the question relating to the further improvement of TNA within the ADP, the trainees all believed that there was a need for better communication with the top management and for further involvement of the employees themselves in the process.  6.3 Discussion and Analysis of Data This section discusses the findings and the results that have emerged from the analysis of the data collected in the empirical work presented earlier in this chapter. It focuses on the main aim and the related objectives of the research, and in so doing, it links the theory as espoused in the literature with the findings obtained from the empirical aspect of the study. The chapter interprets the results, triangulates these, and reflects upon them, making comparisons with the results secured in other related studies. In each aspect of the findings, reference to existing theoretical perspectives is made. On the basis of the overall discussion, a recommended conceptual framework is constructed which aims to achieve greater effectiveness of the TNA function. "