{"International Journal of Computer Applications (0975  8887)  Volume 117  No. 23, May 2015 9 main idea of the Back propagation algorithm is to minimize this error, until the ANN learns the training data.  Abhishek et. al. (2012) estimated average rainfall using back propagation algorithm along with the multilayered artificial neural network. By using artificial neural network model two phases of learning cycle, one to propagate the input pattern through the network and other to adopt the output by enhancing the weights in the network have been analyzed. It is found that as the number of neurons increases in an ANN, the MSE decreases and BPA is the best algorithm out of the three tested [15].  Adamowski, J. and Karapataki, C. (2010) compared three different type artificial neural network and multiple linear regression model for peak weekly water demand forecasting. 20 Levenberg-Marquardt artificial neural network models, 20 resilient back-propagation ANN models, and 20 conjugate gradient Powell Beale ANN, 20 multiple linear regression models, models were developed and their relative performance was compared .This study indicated ANN method was a more accurate prediction method with respect to other conventional data mining approaches[17]. Adamowski (2008) compared multiple linear regression, time series analysis and artificial neural networks as techniques for peak daily water demand forecast modelling. [18]. Agarwal, A., and Singh, R. D. (2004) have developed a Multi-layer back propagation artificial neural network (BPANN) model to simulate rainfall-runoff process [31].  An emerging field of research characterized by a wide variety of techniques for the application of rainfall-runoff modelling and flood forecasting using ANN has been discussed. This review underline the need for clear guidance in current modelling practice, as well as the analogy of ANN methods with more conventional statistical models [37]. A depth discussion of the development and application of artificial neural networks to flow forecasting in two flood prone UK catchments using real hydrometric data carried out. The results obtained for validation forecasts were of comparable quality to those obtained from operational systems for the River Amber. The strength of the ANN to adjust with missing/nullified data and to \"learn\" from the event currently being forecast in real time makes it an appealing alternative to conventional flood forecasting models [38]. Devi, C. J. et. al. (2012) present a neural network-based algorithm for predicting the temperature. [37]. Edossa and Babel have been modelled a nonlinear stream flow forecasting modelling technique along with ANN for study the drought forecasting. In this available dataset was divided into two independent sets using a split sampling tool of neural network software. The stream flow predicted using the model on weekly time step compared with the major stream flow during the validation period [39]. Hsieh et. al. investigated the prediction system with single-point river stage, upstream-downstream river flow forecasting, and rainfall-runoff hydrological process [40].  Kumar and Yadav (2013) have been introduced ANN as one of most important modern tool used for data processing and hydrological forecasting. Feed forward neural network trained with Levenberg-Marquardt back propagation algorithm for rainfall forecasting. The regression coefficient was measured for accuracy of developed model [41].  Kumarasiri, A. D., and Sonnadara, U. J. (2008) have been attempted to implement both short term and long term forecasting with the help of feed forward back propagation artificial neural network for daily occurrence and annual depth of rainfall at a single meteorological station. Two neural network models were developed and trained with back propagation algorithm for one day ahead and one year ahead prediction [42]. Luc, K. C. et.al. (2001) presented the results of a study investigating the application of ANNs to forecast the spatial distribution of rainfall for an urban catchment. Artificial neural network technique is used for rainfall forecasting. Three different type of ANNs ( MLFN, PRNN, TDNN ) were developed and their performance are compared. All three networks had comparable performance when they were developed and trained to reach their optimal complexities [43].  This research evaluated the capacity of ANNs to model with accuracy the monthly rainfall-runoff process [44]. A survey of 43 papers handling with the implementation of neural network models for the forecasting and prediction of water resources variables is undertaken with respect of the modelling process adopted[45].  Minns, A.W. and Hall, M.J. developed a ANN model for rainfall runoff forecasting. ANN model is trained with back propagation algorithm. The application of different standardization factors to both training and verification sequences have underlined the importance of such factors to network performance [46]. Mittal et. al. (2012) proposed a Dual Artificial Neural Network, to improve the model performance in terms of extreme values. Proposed model performance compared with feed forward ANN and extracted result indicate that D-ANN model perform better than FF-ANN model [19].  Mutlu et. al. (2008) presented an evolution to use of ANN models to forecast daily flows at multiple gauging station in Eucha watershed. In this study the MLP and radial basis feed forward neural network (RBFNN) were developed and their abilities to predict stream flow were compared [47]. The performance analysis of the neural network is compared with the statistical technique of synthetic inflow generation [48]. Riadet.et. al. (2004) developed an ANN model to analyze the rainfall runoff relationship. Multilayer perceptron neural network based model is more confined to predict river runoff than classical regression model [49]. Sarkar A. and Kumar R. (2012) examined the study to model the event based rainfall runoff process. A case study has been done to develop event based rainfall runoff model for the basin to simulate the runoff. Obtained result demonstrates that ANN model are able to provide a good simulation for event based forecasting [50].  A performance comparison of three artificial neural network techniques for adding simulated river flows, based on three different neural network structures has been done. These network structures are: the radial basis function neural network (RBFNN), the simple neural network (SNN), and the multilayer perceptron neural network (MLPNN)[51]. Sharda et. al. (2006) analyzed three hilly micro watersheds to assess the impact of morphological characteristics on water flow. To predict runoff and base flow, a artificial intelligence model is developed using multivariate adaptive regression splines method. The predicted value from proposed model found good and it is observed that MARS model have good capability to simulate runoff in hilly area [52]. A wide variety of standard statistical performance evaluation measures were employed to evaluate the performance of various ANN models [53]. Wu et. (2005) demonstrated an application of ANN for runoff and stream flow forecast. [54]. 4.2 Regression Based Neural network Approach The general regression neural network (GRNN) is a one-pass learning algorithm with a highly parallel structure [52]. The GRNN is used for estimation of continuous variables, as in standard regression techniques. It is related to the radial basis function network and is based on a standard statistical technique called kernel regression. The algorithmic form can be used for any regression problem in which an assumption of linearity is not justified. Cigizoglu, H. K. (2005) employed an ANN algorithm, generalized regression neural network (GRNN), in monthly mean flow forecasting[55]. Cigizoglu, H. K. and Alp, ":1}