"International Journal of Computer Applications (0975  8887)  Volume 117  No. 23, May 2015 15 Changes of Total Suspended Solids and Sediments in Journal of River Engineering, Vol. 2 , Issue 1. [33] Tesfaye, Y. G., Meerschaert, M. M. and Andersonet, P. L., average models and their application to the modelling of Water Resources Research, Vol. 42, p.p. no 1-11. [34] River AJER, Vol-02, Issue-06, pp-49-54. [35] of short-term rainfall prediction models for real-time flood Journal of Hydrology, Vol -239, p.p. no.132147. [36] Chakraborty, S., Denis, D.M., and Sherring, A. prediction of rainfall and runoff in Kelo Watershed International Journal of Advances in Engineering Science and Technology, Vol- 2, p.p. no. 153-163. [37] Devi, C. J., Reddy, B. S. P., Kumar, K. V., Reddy, B. M., and Nayak, N. R. (2012), ANN Approach for Weather Prediction using Back Propagation, IJETT. [38] Dreiseitl, S., and Ohno-Machado, L. (2002), Logistic regression and artificial neural network classification models: a methodology review, SCIENCE DIRECT. [39] Edossa, D. C., Mukand, S., Babel, Forecasting Hydrological Droughts Using Artificial Neural Network Modeling Technique. [40] Hsieh, B. B., Bartos, C. C. L., and Zhang, B. , USE OF ARTIFICIAL NEURAL NETWORKS IN A STREAMFLOW PREDICTION SYSTEM. [41] Kumar, R., and Yadav, G. S. (2013), Forecasting of Rain Fall in Varanasi District, Uttar Pradesh Using Artificial Neural Network, JECET.  [42] Kumarasiri, A. D., and Sonnadara, U. J. (2008), Performance of an artificial neural network on forecasting the daily occurrence and annual depth of rainfall at a tropical site, Hydrological process, 22, pp 35353542 [43] Luc, K. C., Ball, J. E., and Sharma, A. (2001), An Application of Artificial Neural Networks for Rainfall Forecasting, ELSEVIER, 33(67), pp 683693. [44] Machado, F., Mine, M., Kaviski, E., and Fill, H. (2011), Monthly rainfallrunoff modelling using artificial neural networks, Hydrological Sciences Journal,  56(3). [45] Maier, H. R., Jain, A.,Dandy, G.C.and Sudheer, K. P. (2010), Methods used for the development of neural networks for the prediction of water resource variables in river systems: Current status and future directions, environmental modeling & software, 25, pp 891-909. [46] Minns, A. W., and Hall, M. J. (1996), artificial neural networks as rainfall runoff models, Hydrological Sciences Journal.  [47] Mutlu, E., Chaubey, I., Hexmoor, H., and Bajwa, S. G. (2008), Comparison of artificial neural network models for hydrologic predictions at multiple gauging stations in an agricultural watershed, Hydological Process. [48] Raman, H. and Sunilkumar, N. (1995), Multivariate modelling of water resources time series using artificial neural networks, Hydrological Sciences Journal, 40(2). [49] Riad, S.  Mania, J., Bouchaou, L., and Najjar, Y. (2004), Rainfall-Runoff Model Using an Artificial Neural Network Approach, Mathematical and Computer Modelling 40  pp 839-846. [50] Sarkar, A. And Kumar, R. (2012), Artificial Neural Network for Event Based Rainfall-Runoff modelling, Journal of Water Resource and Prediction, 4, pp 891-897. [51] (2002), Comparison of different forms of the Multi-layer Feed-ForwardNeural Network method used for river flow forecasting, Hydrology and Earth System Sciences, 6(4), pp 671684. [52] Sharda, V. N., Patel, R. M., Prasher, S.O., Ojasvi, P.R., and Prakash, C. (2006), Modeling runoff from middle Himalayan watersheds employing artificial intelligence techniques, agricultural water management 83, pp 233  242. [53] Srinivasulu, S. and Jain, A. (2006), A comparative analysis of training methods for artificial neural network rainfall-runoff models, applied soft computing, 6, pp 295-306. [54] Wu, J.S., P.E., Asce, M., Han, J., Annambhotla, S. and Bryant, S. (2005), Artificial neural network for forecasting watershed runoff and stream flows, Journal of Hydrologic Engineering, pp 216-222. [55] Cigizoglu, H. K. (2005), Generalized regression neural network in monthly flow forecasting, Civil Engineering and Environmental Systems, 22 (2). [56] Cigizoglu, H. K., and Alp, M. (2006), Generalized regression neural network in modelling river sediment yield, ELSEVIER [57] regression neural networks for evapotranspiration modelling, IAHS. [58] Kisi, O. (2006), Generalized regression neural networks for evapotranspiration modelling, IAHS. [59] Wang, Z. L., and Sheng, H. H. (2010), Rainfall Prediction Using Generalized Regression Neural Network: Case study Zhengzhou, IEEE. [60] Cannas, B., Fanni, A., Sias, G., Tronci, S., and Zedda, M. K. (2005), River flow foreasting using neural networks and wavelet analysis, European Geosciences Union. [61] Adamowski, J. and Sun, K. (2010), Development of a coupled wavelet transform and neural network method ofr flow forecasting of non-perennial rivers in semi-arid watershed, ELSEVIER [62] Adamowski, J., Chan, H. F., Prasher, S. O., and Sharda, V. N. (2012), Comparison of multivariate adaptive regression splines with coupled wavelet transform artificial neural networks for runoff forecasting in Himalayan micro-watersheds with limited data, IWA. [63] Adamouski, J., and Chan, H. F. (2011), A wavelet neural network conjunction model for groundwater level forecasting, ELSEVIER [64] Belayneh, A., and Adamowski, J. (2012), Standard precipitation index drought forecasting using Neural "