{"International Journal of Computer Applications (0975  8887)  Volume 117  No. 23, May 2015 8 for the sub-regions identified and then generalized across the whole catchments[27]. P. P. Mujumdar & D. Nagesh Kumar (1991) investigated ten candidate models of the Auto-Regressive Moving Average (ARMA) family for representing and forecasting monthly and ten-day streamflow in three Indian rivers namely Cauvery, Hemavathy and Malaprabha. They used Minimum Mean Square Error (MMSE) and Maximum Likelihood (ML) criteria for selection of best models for forecasting and representation of data respectively. The validation criteria of selected are based on the significance of the residual mean, significance of the periodicities in the residuals and significance of the correlation in the residuals. Based on the ML criterion ARMA(4,0), ARMA(2,1) and ARMA(3,1) are developed for the synthetic generation of the three monthly series of the Rivers Cauvery, Hemavathy and Malaprabha, respectively. While the ARMA (4,0) model is selected for the ten-day series of the Malaprabha River. The MSE value is minimum of ARMA (1, 0) model in all the cases studied and is recommended for use in forecasting flows one time step ahead. Validations tests revealed that the models selected by the two criteria pass all the tests and hence these models are recommended for use in practice for the three rivers [28]. Wang, Wen-Chuan, et al (2009) autoregressive moving-average (ARMA) models, artificial neural networks (ANNs) approaches, adaptive neural-based fuzzy inference system (ANFIS) techniques, genetic programming (GP) models and  support vector machine (SVM) method are presented by authors to examined the long-term observations of monthly  river flow discharges [29].  P.E. Naill and M. Momani (2009) used Box-Jenkins methodology to build ARIMA model for monthly rainfall data taken for Amman airport station for the period from 1922-1999 with a total of 936 readings. In their research, ARIMA (1, 0, 0) (0, 1,1) 12 model was developed. This model is used to forecasting the monthly rainfall for the upcoming 10 years to help decision makers establish priorities in terms of water demand management [30].  Kothyari et al. (1997) studied rainfall and temperature (i.e., long-term monsoon rainfall, number of rainy days during the monsoon season, and annual maximum temperature) from three stations at Agra, Dehradun and Delhi for evaluating the changes in regimes in the upper and middle parts of the Ganga basin in northern India [31]. Makridakis S. and Hison M. presented various aspects of the Box-Jenkins methodology to ARMA models in this paper. The major concern of this study is to identify the post sample forecasting methods and improve the accuracy in order to ascertain static form of data[30].  Boudaghpour, S. et al (2014) explain the stochastic AR (1) and AR (2) models which used for the case study of TSS in Lighvan Chia basin. They further coupled four autoregressive moving average models including, ARMA (1,1), ARMA (2,2), ARMA (1,2) and ARMA (2,1). The results of AR (1) and AR (2) models showed almost a perfect match between measured and the calculated values of TSS among these models. As a results, the AR (1) models are introduced to assess and predict the volume of TSS and sediments with satisfactory achievements [32]. Tesfaye, Y. G. et al. (2006) introduced the model identification and simulation techniques which have developed based on a periodic autoregressive moving average (PARMA). The purpose is to capture the seasonal variations in river flow statistics. The innovations algorithm is used to obtain parameter estimates. The model is then tested to monthly flow data for the Fraser River in British Columbia .A cautious look over statistical analysis of the PARMA model residuals, including a truncated Pareto model for the extreme tails, generate a realistic simulation of these river flows [33].  Musa, J. J., (2013), a stochastic approach is presented by an Autoregressive Moving Average model (ARMA). Autoregressive (AR) model, Autoregressive Moving Average (ARMA) model and Autoregressive Integrated Moving Average (ARIMA) model are used to analyse 22 years (1990-2011) observations of flow discharge from the Meteorological Station at Shiroro [34]. Toth, E. et al. (2000), in their study only rainfall depths is used as only input data by which they tried to compares the accuracy of the short-term rainfall forecasts obtained with time-series analysis techniques. Linear stochastic auto-regressive moving-average (ARMA) models, artificial neural networks (ANN) and the non-parametric nearest-neighbours method techniques are used for developing model on the Apennines Mountains, Italy. The study analyses and compares the relative advantages and extent of each time-series analysis technique, used for predicting rainfall forecasts for lead-times varying from 1 to 6 h. The results indicate ANN techniques are mere accurate than the ARMA and nearest-neighbours method [35]. Chakraborty, S. et al., (2013) conducted a study to develop a stochastic time series model, capable of prediction of rainfall and runoff. The watershed they had been chosen for study was Kelo watershed of Mahanadi river basin of Chhattisgarh state, India. Six years data of rainfall and runoff of the watershed was collected and used for the development of model. They were tried Autoregressive (AR) models of order 0,1 and 2. The goodness of fit and adequacy of models were tested by Box- Pierce Portmanteau test, Akaike information Criterion and by comparison of historical and generated data correlogram [36]. 4. REVIEW OF RAINFALL RUNOFF MODELING BASED ON ANN APPROACH The artificial neural prediction tools for the relation between rainfall and runoff parameters. The results will support decision making in the area of is becoming increasingly common in analysis of hydrological and water resources problem. The ANN was developed and used to model the rainfall-runoff relationship for various catchments. It is also helpful in urban planners and managers undertake the necessary measures to face the bad predictions. It has great advantage to avoid losses in public and private properties, health and ecological hazards that are likely to occur due to floods. The ANN models have been used in various aspects of science and engineering applications because of its ability to model both linear and nonlinear systems without the need to make any assumptions like most traditional statistical approaches. The ANN is widely used in river flow prediction, river flood prediction, water quality parameter prediction, rainfall-runoff process, evaporation etc time series prediction. For the hydrological applications, a multilayer feed-forward backpropagation algorithms is used.  It   is a set of a large number of interconnected nodes, arranged in an input layer, an output layer and one or more hidden layers. The transfer function selected for the network was the sigmoid function [4]. In this section the potentially very powerful data mining tool artificial neural network and its various approaches discussed.   4.1 Neural network based on Back Propagation Approach Back propagation is a common method to train an Artificial Neural Network. The objective of training is to find the set of weights between neurons that determine the global minimum of error function. The Back propagation algorithm is used in layered feed forward ANNs. Signals are forwarded from one layer to other layer and errors are propagated backwards The ":0}