"International Journal of Computer Applications (0975  8887)  Volume 117  No. 23, May 2015 16 Networks, Wavelet Neural Networks, and Support Vector Regression, Applied Computational Intelligence and Soft Computing Volume 2012 Article ID 794061, 13 pages. 65 Campisi-Pinto, S., Adamouski, J., and Oron, G. (2012), Forecasting UrbanWater Demand ViaWavelet-Denoising and Neural Network Models. Case Study: City of Syracuse, Italy, Springer, 26(12) pp 3539-3558. 66 Partal, T., and Cigizoglu, H. K. (2009), Prediction of daily precipitation using waveletneural networks, IAHS. 67 Ramana, R. V., Krishna, B., Kumar, S. R., and Pandey, N. G. (2013), Monthly Rainfall prediction using wavelet neural network analysis, Springer. 68 Santos, C.A.G. and da Silva, G.B.L.(2014), Daily streamflow forecasting using a wavelet transform and artificial neural network hybrid   models,HydrologicalSciences.JournalJournaldesSciencesHydrologiques,59(2),PP.312324,http://dx.doi.org/10.1080/02626667.2013.800944 69 Wei, S., Yang, H., Song, J., Abbaspour, K., and Xu, Z.  (2013), A wavelet-neural network hybrid modeling approach for estimating and predicting river monthly flows, IAHS. 70 Aggarwal, N. & Aggarwal, K. (2012), A Mid-Point based K-mean Clustering Algorithm for Data mining, IJCSE, 4(06) . 71 Botsis, D., Latinopulos, P. and Diamantaras, K. (2011), Rainfall-Runoff Modeling Using Support Vector Regression and Artificial Neural Networks, CEST2011- Rhodes, Ref No. XXX, Greece. 72 Bhagwat, P. and Maity, R. (2013), Hydroclimatic stream flow prediction using Least Square Support Vector Regression, ISH Journal of Hydraulic Engineering,  19(3) , pp 320-328. 73 Cimen, M. (2008), Estimation of daily suspended sediments using support vector machines, Journal of Hydrological Sciences, l.53 (3). 74 Espinoza, M., Johan, A. K. Suykens and Bart De Moor. (2006), Load Forecasting using Fixed-Size Least Squares Support Vector Machines. 75 Flint, E.L. and Flint, L. A. (2012), Downscaling future climate scenarios to fine scales for hydrologic and ecological modeling and analysis, Ecological Processes, A Springer Open Journal. http://www. ecologicalprocesses.com/content/1/1/2. 76 Lai, H.C. and Tseng, H.M. (2010), Comparison of regression models, grey models, and supervised learning models for forecasting flood stage caused by typhoon events, Journal of the Chinese Institute of Engineers, 33(4), pp 629-634.  77 Li, H.P., Kwon, H.H., Sun, L., Lall, Upmanu and Kao, J. J. (2010), A modified support vector machine based prediction model on streamflow at the Shihmen Reservoir, Taiwan, International Journal Of Climatology 30, pp 1256-1268. 78 Liong, Y.S. and Chandrasekaran, S. (2002), Flood Stage Forecasting With Support Vector Machines, Journal of the American Water Resources Association, 38(1). 79 Lin, Y.J., Cheng, T.C. and Chau, W.K. (2006), Using support vector machines for long term discharge prediction, Hydrological Science Journal, 51(4), pp599-612. 80 Ma, Xixia, Ping, J., Yang, L., Yan, M. and Mu, H. (2011), Combined model of chaos theory, wavelet and support vector machine for   forecasting runoff series and its application, IEEE 978-1-61284-340-7/11. 81 Maity, R. and Khasid, S.S. (2009), Hydroclimatological approach for monthly streamflow prediction using genetic programming, ISH Journal of Hydraulic Engineering, 15(2). 82 Lingras, P. and Butz, C. (2004), Interval set Classifiers using Support Vector Machines, IEEE, 0-7803-8376-1/04. 83 Mamat, M. and Samad, A.S., Performance of Radial Basis Function and Support Vector Machine in Time Series Forecasting. 84 Misra, D., Oommen, T., Agarwal, A., Mishra, S.K. and Thompson, M.A. (2009), Application and analysis of support vector machine based simulation for runoff and sediment yield, ELSEVIER Science: 103(2009), pp 527-535.   85 Mountrakis, G., Im, J. and Ogole, C. (2010), Support vector machines in remote sensing: A review, ISPRS Journal of Photogrammetry and Remote Sensing, doi:10.1016/j.isprsjprs.2010.11.001. 86 Solomatine, P.D. (2002), Computational intelligence techniques in modeling water systems: some applications, IEEE, 0-7803-7278-6/02.  87 Shahbazi, N.A. and Pilpayeh, A. R. (2012), River flow forecasting using support vector machines, 14th ISCCBE, Moscow, Russia. 88 Torabi, M. and Hashemi, S. (2012), A Data Mining paradigm to Forecast Weather Sensitive Short-Term Energy Consumption, IEEE 978-1-4673-1479-4/12. 89 Wu, H.C., Ho, M.J. and Lee, T.D. (2004), Travel-Time Prediction with Support Vector Regression, IEEE Transactions on Intelligent Transportation Systems, 5(4), 1524-9050/04. 90 Yang, H., Huang, K., King, I. and Lyu, R.M. (2009), Localized support vector regression for time series prediction, ELSEVIER Sciences Neurocomputing 72, pp 2659-2669. 91 Yi, D., Wei, C. and Shengfeng, L. (2011), A new Regression Method Based on SVM classification, Eighth International Conference on Fuzzy Systems and Knowledge Discovery, 978-1-61284-181-6/11. 92 Xian, M.G. and Zeng, Q.B., (2008), A novel evaluation method basing on support vector machines, IEEE 978-0-7695-3134-2/08. 93 Yoon, H., Jun, C.S., Hyun, Y., Bae, O.G. and Lee, K.K. (2011), A comparative study of artificial neural network and support vector achiness for predicting groundwater levels in a costal aquifer, ELSEVIER Sciences, Journal of Hydrology No. 396, pp 128-138. 94 Hwang, H. S, Ham, H. D. and Kim, H. J. (2012),  A new measure for assessing the efficiency of hydrological data-driven forecasting models, Hydrological Sciences Journal, 57(7), pp 1257-1274.  95 Samsudin, R., Model of Self-Organizing Maps (SOM) and Least Square Support Vector Machine (LSSVM) for Time-Series "