{"International Journal of Computer Applications (0975  8887)  Volume 117  No. 23, May 2015 10 M. (2006) deployed generalized regression neural network (GRNN) for river suspended sediment estimation [56].  Dreiseitl, S., and Ohno-Machado, L., (2002) encapsulate the similarities and difference between logistic regressions, artificial neural network and compared their performance with other conventional machine learning algorithm. On the basis of comparison ANN and logistic regression found better than the conventional machine learning algorithm until newer machine learning algorithms, such as support vector machines and other kernel-based algorithms, can prove to be significant [38]. Koutsoyiannis, D. (2007) discussed the research paper, generalized regression neural network for evapotranspiration modeling[57].  Kisi, O. (2006) investigated the ability of generalized regression neural networks technique in evapotranspiration (ET0) modelling obtained using the FAO Penman-Monteith (PM) equation. The performance of GRNN model was compared to the empirical model using mean square error, mean absolute error. Result obtained based on comparison shows that GRNN model strongly employed in evapotranspiration modelling [58].  Specht, D. F. describes a new network that provides estimates of continuous variables and converges to the linear or nonlinear regression surface. The proposed memory based general regression neural network (GRNN) features fast learning that does not require an iterative procedure, and a highly parallel structure. It can be used for prediction, modelling, mapping, and interpolating or as a controller. The algorithmic form can be used for any regression problem in which an assumption of linearity is not justified. Wang, Z. L. and Sheng, H. H. (2010) introduces the application of generalized regression neural network (GRNN) model to forecast annual rainfall. The result of proposed method is compared with the back propagation neural network and regression analysis method. Compared with the traditional linear model and BP neural networks, the GRNN has smaller prediction error. The results and accuracy of GRNN model comes better than that of BP neural network for annual rainfall [59].   4.3 Wavelet Neural Network Based Approach In this section, presented a neural network technique combined with wavelet analysis. Wavelet analysis is employed to pre-process the data [60]. The wavelet decomposition of non-stationary time series into different scales provides an interpretation of the series structure and extracts the significant information about its history, using few coefficients. For these reasons, this technique is largely applied to times series analysis of non-stationary signals. Adamowski, J. and Sun, K. (2010) proposed a method, for flow forecasting applications in non-perennial rivers in semi-arid watersheds which is based on coupling discrete wavelet transforms (WA) and artificial neural networks (ANN) techniques[61]. Adamowski, J. et. al.(2012) developed three model; multivariate adaptive regression spline (MARS), wavelet transform artificial neural network (WA-ANN), and regular artificial neural network (ANN) for runoff forecasting applications [62].  Adamouski, J. and Chan, H. F. (2011) described a new approach based on pairing discrete wavelet transforms (WA) and artificial neural networks (ANN) for groundwater level forecasting[8].  Adamowski and Belayneh (2012) compared the effectiveness of three data-driven models for forecasting drought conditions in the Awash River Basin of Ethiopia [64].  Campisi-Pinto, S. et. al. (2012) introduced a new hybrid approach which is the combination of wavelet-denoising and back-propagation artificial neural networks (ANNs) for urban water demand forecasting. The proposed model performance were compared with non-coupled ANN and Linear Multiple Regression models[65]. Cannas B. et. al. (2005) applied neural network and wavelet analysis to predict the hydrologic behaviour of the runoff. In this research paper data is pre-processed for neural network input and output using continuous and discrete wavelet transforms. Proposed approach is compared with ANN. comparison result showed that the networks trained with pre-processed data perform better than the networks trained with undecomposed noisy raw signals [60].  Partal, T. and Cigizoglu, H.K. (2009) proposed a waveletneural network method to predict the daily precipitation from meteorological data. wavelet neural network is a integtration of discrete wavelet transform (DWT) and artificial neural networks (ANN) [66].  Ramana, R. V. et. al. (2013) combined the wavelet technique with Artificial Neural Network (ANN) for rainfall prediction [67]. Santos and Silva (2012)  proposed a new wavelet and artificial neural network hybrid model for daily stream flow forecasting[68].  Wei, S. et. al. (2013) introduced a wavelet-neural network (WNN) hybrid modelling approach for monthly river flow evaluation. This proposed approach combines discrete wavelet multi-resolution decomposition and a back propagation (BP) feed-forward multilayer perceptron (FFML) artificial neural network (ANN). The Bayesian regularization and Levenberg-Marquardt algorithm were use to perform the network modelling. The results from WNN hybrid model was compared with single ANN model. The comparison shows that WNN hybrid model perform better than the single ANN model [69]. 5. REVIEW OF RAINFALL RUNOFF MODELING BASED ON A SUPPORT VECTOR APPROACH Rainfall-runoff simulation and prediction in watersheds is one of the most important tasks in water resources management. In this research, an adaptive data analysis methodology, ensemble empirical mode decomposition (EEMD), is presented for decomposing annual rainfall series in a rainfall-runoff model based on a support vector machine (SVM) [104].  5.1 Support Vector Machine in Linear Regression Support vector machine is based on the theory of statistical learning and structural risk minimization. In this learning by the help of support vectors a linear discriminant function separating two classes has been built [38].  For nonlinear class of problem, either penalty for misclassification can be introduced or nonlinear mapping into a space of higher dimension can be performed by the help of different Kernel functions [70]. Vapnik theory plays a significant role in generalized implementation of support vector machine and for the statistical characteristics of generated input and formulated machine learning model. The potentially very powerful data mining tool as a support vector machine and its various approaches discussed here. Some introductory background of support vector machines based on least square and hybrid model based support vector machine approaches for the hydrological parameter prediction is carried out.  5.2 Support Vector Machine Based Approaches Support vector machine (SVM) was first practically come into existence in 1992, by Boser, Guyon, and Vapnik in COLT-92. SVMs are a set of uniquely related supervised learning concepts ":0}