"International Journal of Computer Applications (0975  8887)  Volume 117  No. 23, May 2015 14 Efficient Approach of Artificial Neural Network in Runoff Forecasting, IJCA, 92(5), PP 9-15. Doi> 10.5120/16003-4991. [5] Mishra,S., Chaubey,V., Pandey,S. K . and Shukla,J. P. -8887),  ISSN 2229-5518 , 5(3) PP. 158-167. [6] Mishra, S., Dwivedi, V.K., Sarvanan, C. and Pathak, K. K. (2013), Data Mining during the Monsoon Period of the High Flood -8887), doi-10.5120/11397-6698,  67(6), pp 7-14. [7] Mishra,S., Saravanan,C.and  Dwivedi,V. K. (2014), Estimation of flood magnitude and flood risk in the Brahmaputra river basin using hydrological time series data mining in the Brahmaputra river basin using hydrological time series data mining, International conference on decision support systems for early warning and mitigation of disaster (DSS-EWMD), NIT Durgapur. [8] Mishra,S., Sarvanan,C., Dwivedi,V. K. and Shukla,J. P. (2014), Rainfall prediction using hydrological time series data mining, published in national workshop on - Having Potential for Socio- during  July, 04-05, 2014 at CSIR-AMPRI, Bhopal, pp. 403-408.  [9] Mishra,S.,  Shukla,J. P.,  Saravanan,C.,  Dwivedi V. K. and  An Innovative Approach of  Data Mining  Techniques in Stream Flow Forecasting-ISC-2013-5CITS-05, Souvenir of 3rd International Science Congress, Coimbatore, India, 8th  9th . [10] Mishra,S., Majumder S. and Dwivedi V. K. (2011),  PATTERN DISCOVERY IN HYDROLOGICAL   Sustainable Water resources Management  And Climate Change Adaptation,  II,  pp.107-115, NIT Durgapur. [11] Mishra, S., Sarvanan, C. ,Dwivedi, V.K.,  and Pathak, K. K. (2014)Hydrological Time Series Data Mining during the Post -8887), ISBN : 973-93-80880-78-3, 90(08), PP 35-44  doi-10.5120/15597-4375.  [12] Mishra, S.,  Sarvanan,C.,  Dwivedi, V. K. and Pathak,K. K. ical Indian. J.of Zeo-Marine Science, 44(3). [13] Purviya,R., Tiwari,H. L. Mishra,S. (2014),  Application of Clustering Data Mining Techniques in Temporal  Data Sets IJSET(ISSN:2277-1581) , 3(4), pp 360-365. [14] Mohammadi, K., Eslami, R.H. and Kahawita, R. (2006), Parameter estimation of an ARMA model for river flow forecasting using Goal programming, ELSEVIER Sciences, Journal of Hydrology 331, pp 293-299. [15] Abhishek, K., Kumar, A., Ranjan, R., and Kumar, S.  (2012), A Rainfall Prediction Model using Artificial Neural Network, IEEE. [16] Abrahart, R. J., See, L. & Kneale, P. E. (1999), Using pruning algorithms and genetic algorithms to optimise network architectures and forecasting inputs in a neural network rainfall-runoff model, journal of hydroinformatics. [17] Adamowski, J. and Karapataki, C. (2010), Comparison of Multivariate Regression and Artificial Neural Networks for Peak Urban Water-Demand Forecasting: Evaluation of Different ANN Learning Algorithms, ASCE [18] Adamowski, J. F. (2008), Peak Daily Water Demand Forecast Modeling Using Artificial Neural Networks, ASCE. [19] Mittal, P., Chowdhury, S., Roy, S., Bhatia, N., and Srivastav, R. (2012), Dual Artificial Neural Network for Rainfall-Runoff Forecasting, Journal of Water Resource and Protection, 4, pp 1024-1028. [20] Abbasi,M. Abduli, M.A., Omidvar, B. and Baghvand, A. (2013), Forecasting Municipal Solid waste Generation by Hybrid Support Vector Machine and Partial Least Square Model, Int. J. Environ. Res., 7(1), pp 27-38, ISSN: 1735-6865. [21] Ramoni, M.,Sebastiani, P. and Cohen, P. (2000), Multivariate clustering by dynamics, Proceedings of the 2000 National Conference on Artificial Intelligence (AAAI-2000), San Francisco, CA, pp 633638. [22] Wijk, J. J. van and Selow, E. R. Van (1999), Cluster and calendar based visualization of time series data, Proceedings of IEEE Symposium on Information Visualization, San Francisco, CA, pp2526. [23] Vlachos, M.,Lin, J. and Keogh, E. (2003), A wavelet based anytime algorithm for k-means clustering of time series, Proceedings of the Third SIAM International Conference on Data Mining, San Francisco, CA, May 13. [24] Li, C. And Biswas, G. (1999), Temporal pattern generation using hidden Markov model based unsupervised classification, in: D.J. Hand, J.N. Kok, M.R. Berthold (Eds.), Lecture Notes in Computer Science, vol. 164, IDA 256. [25] Liao, T. W. (2005), Clustering of time series dataa survey, Pattern Recognition Society. [26] Agarwal, P., Alam Afshar, M. And Biswas, R. (2010), Analysing the agglomerative hierarchical Clustering Algorithm for Caegorical Attributes, IJJMT, 1(2), pp 186-190. [27] Hall, M.J., Minns, A.W.  and Ashrafuzzaman, A.K.M., (2002), The application of data mining techniques for the regionalization of hydrological variables, Hydrology and Earth System Sciences, 6(4), 685694. [28] Hydrological Sciences Journal, vol. 35,4. [29] Wang, C. W., Chau, W. K., Cheng, T. C. and Qiu, Lin (2009), A comparison of performance of several artificial intelligent methods for forecasting monthly discharge time series, Journal of  Hydro, 374(3-4), pp 294-306. [30] and The 95/33/TM. [31] Agarwal, A. and Singh, R.D. (2004), Runoff Modelling Through Back Propagation Artificial Neural Network With Variable Rainfall-Runoff Data, Water Resources Management, 18, pp 285300. [32] Boudaghpour, S., Bagheri, M., and Bagheri, Z.,2014, "