{"International Journal of Computer Applications (0975  8887)  Volume 117  No. 23, May 2015 6 Study of Time Series Data Mining for the Real Time Hydrological Forecasting: A Review  Satanand Mishra,   WRM &RT Group, CSIR-Advanced Materials & Processes Research Institute, Bhopal- 462026, India C. Saravanan,  Computer Centre,  National Institute of Technology, Durgapur-713209, India  V. K. Dwivedi,  Dept. of Civil Engineering, National Institute of Technology, Durgapur-713209, India.   ABSTRACT This paper presents a review of runoff forecasting method based on hydrological time series data mining. Researchers are developed models for runoff forecasting using the data mining tools and techniques like regression analysis, clustering, artificial neural network (ANN), and support vector machine (SVM), Genetic Algorithms (GA), fuzzy logic and rough set theories. The scientific community has been trying to find out a better approach to solve the issues of flood problems. Time Series Data mining is paying crucial role for the achieving a real time hydrological forecast. Hydrological Time series is an important class of temporal data objects and it can be find out from water resource management and metrological department. A hydrological time series is a collection of observations of hydro and hydrometeorological parameters chronologically. The wide use of hydrological time series data has initiated a great deal of research and development attempts in the field of data mining. Trend, pattern, simulation, similarity measures indexing, segmentation, visualization and prediction carried out by the researchers with the implicit mining from the historical observed data. The critical reviews of the existing hydrological parameter prediction research are briefly explored to identify the present circumstances in hydrological fields and its concerned issues. Keywords Clustering; data mining; runoff; hydrological time series; pattern discovery; regression analysis, ANN, SVM. rough set and fuzzy logic, genetic algorithms.  1. INTRODUCTION  There are large numbers of literature available on Application of Data Mining in Real Time Hydrological Forecasting, watershed management and its impact assessment tools/models. Some of the recent publications which have highlighted hydrological parameter prediction are examined in this paper.  In this paper, an introductory background to the hydrology, data mining and its techniques have been described and then a brief insight of literature review on various approaches of clustering, regression analysis, artificial neural network, support vector machines, genetic algorithms, rough sets and fuzzy logics   have  been discussed[1-13].  Water resource management professional always look   for suitable mathematical and computational assessment tools based on minimum but optimum information, cost effectiveness and less time consuming using minimum data with reasonable accuracy. In this regard, several mathematical and computational models for flood forecasting, rainfall and runoff prediction have been developed worldwide in complex and simple approaches.  Some conventional popular models namely conceptual models, physically process based models and black box model have been widely used for the hydrological prediction.  Large number of data and huge time involvement required for such models and their marginally superior results compared to the others make them an unfavorable choice. Models like soft lumped computational tools are found user-friendly, as they have been developed based on using minimum data sets, cost effective and less time consuming. But its main faults are that the involves in long calibration   and validation process. Data mining techniques such as clustering, regression analysis, artificial neural network, support vector machine, rough sets and fuzzy logic, mathematical simulation are widely used for the hydrological prediction. The hydrologist find regression and artificial neural network models more attractive for the prediction of hydrological forecasting.  Clustering is the process of grouping  the data into classes or clusters so that objects within a cluster  have high similarity in comparison to one another, but very dissimilar to objects  in other clusters. Clustering of time series has received considerable attention in recent years because it is a fundamental task in data mining [6][11-12].  Regression analysis model is developed based on empirical methods used for the modeling and analysis of numerical time series data consisting of values of response variable and of one or more independent variables. Regression Models have been used for prediction including forecasting of time series data, hypothesis testing, modeling of relationships in hydrological parameters and water quality assessment [3][14].  Artificial Neural Networks (ANN) based computing models have been developed for hydrological time series data. ANN is performing like a human brain because it has its own artificial intelligence. The main advantages of the ANN approach over traditional methods  is that it needs  less data  and is capable  for long duration  forecasting as well as it does not require adequate of particular background  science.  The main constraint of the model is that it is based on black box because it is generally unable to demonstrate the coefficient of determinants and trend analysis like regression model and model is developed by trial and error approach. Despite of black- box the models have been found more attractive since last one decade and there is a growing trend for use of ANN based hydrological model as it has better performance as compared to conventional models for forecasting [15-19]. Time series data analysis is a new approach along with weighted support vector machine. Typically nonlinear features are introduced through a nonlinear kernel function. While these studies propose a new feature induction algorithm for SVMs. Specifically, new features are induced iteratively. At each step, it weights training examples differently according to the outputs of the current SVM model. The weighted training examples are then used to train a classification model that becomes a new feature for the SVM model [20]. Now a  of ANN, fuzzy logic and genetic algorithms for rainfall- runoff modeling has carried out. The study described pros and cons of these algorithms and suggest ":0}