"International Journal of Computer Applications (0975  8887)  Volume 117  No. 23, May 2015 12 5.3 Least Square Support Vector Machine Approach Classification problems have arisen in many applications, attracting many researches to develop advanced classifier techniques. A method called Least Square Support Vector Machines (LS-SVM) for pattern recognition and function estimation has been introduced in the framework of statistical learning theory. Since then there is a growing interest on this kernel method for its interesting features. In this section, a least squares version (LS-SVM) is explained. LS-SVM expresses the training in terms of solving a set of linear equations instead of quadratic programming as for the standard SVM case. Iterative training algorithm for LS-SVM based on a conjugate gradient method is then applied. Bhagwat P. and Maity R (2013) have been explored potential of least square support vector regression model in the context of streamflow prediction using Hydroclimatic inputs[72].  Espinoza M. presented a primal dual formulation of Least Square Support Vector Machine[74]. Hwang H.S. et al (2012) presents a Least Square Support vector machine (LS-SVM) approach for forecasting nonlinear hydrological time series. This paper is to examine the feasibility using LS-SVM in the forecasting of nonlinear hydrological time series by comparing it with a statistical method such as Multiple Linear Regression (MLR) and a heuristic method such as a Neural Network using Back-Propagation (NNBP). In the experimental results, LS-SVM showed superior forecasting accuracies and performances to those of MLR and NNBP [94]. Samsudin et al (2011) projected a new, unique and novel hybrid forecasting model known as GLSSVM, which merges the group technique of data handling and least square support vector machine[95]. Shabri A. and Suhartono (2012) investigate the ability of least square support vector machine (LSSVM) model to enhance the accuracy of prediction. Grid search and cross-validation techniques are used to determine the essential LSSVM parameters in the forecasting processes[96]. Shah Shiloh R.(2005) described the concept and characteristics of least squares support vector machines and then produced detailed result using Least Square Support Vector Regression which shows significant improvement over Support Vector Machine (SVM) [97]. Suykens et al (2001) introduced a unique method which can overcome the drawbacks of sparseness and the estimation of the support vectors values. They also introduce a sparse approximation procedure for weighted and un-weighted version of LS-SVM. The result showed how to obtain robust estimates within the LS-SVM framework in case of outliers and heavy tailed non-Gaussian error distributions [98]. 5.4 Hybrid Model Approach A new comprehensive and more refine approach where machine learning technique and data mining technique are combined together are termed as Hybrid model approach for hydrological prediction. Classification and regression analysis have been performed in an efficient way, leads to a accurate result simulation. In this section, hybrid approach is studied through a various research papers. In this study Botsis D. et al (2011) presented a performance comparison between Support vector regression and multilayer feed-forward neural network models with respect to their forecasting capabilities [71].  Flint and Flint (2012) proposed an evaluation on the impact of climate change on water resources and scientific components of landscape is a necessary part of this investigation[75]. Ismail et al (2012) proposed a innovative hybrid approach based on a combination of two approaches: Self Organizing Map (SOM) and Least Square Support Vector Model (LSSVM), termed as a SOM-LSSVM model for river flow forecasting [99]. Lin F. et al (2013) propose a hybrid model approach which joins locally linear embedding algorithm and support vector machine to predict the firms which based on past financial performance of data sets[100]. M. Abbasi (2013) Study proposed a novel method of forecasting municipal solid waste (MSW) generation [20]. Ma Xixia et al (2011) presented a combined hybrid model of chaos theory; wavelet and support vector machine was built to overcome the limitations including challenges in determination of order of nonlinear models and low prediction accuracy which the simulated accuracy is high in runoff forecasting [80]. Maity R. and Khasid S.S. (2009) presented an approach for monthly streamflow prediction. In this paper using the concept of hydroclimatological association rainfall-runoff relationship over a catchment is explained [81][84]. Mohammadi K.et al (2006) tried to achieve a goal to minimize the error of specific season of the year as well as for the complete series. Goal programming was used to estimate the ARMA model parameters [14]. Pandhiani and Shabri (2013) explore the least square support vector and wavelet technique (WLSSVM) in the monthly stream flow forecasting. This is the new hybrid technique. The Root Mean Square Error (RMSE), Mean Absolute Error (MAE) and Correlation(R) statistics are used for evaluating the accuracy of the WLSSVM and WR models[101]. Sivakumar et al (2000) employed  the correlation dimension method, provided preliminary evidence of the existence of Chaos in the monthly rainfall-runoff process at the Gota basin in Sweden [102]. Wang et al (2010) presented  a SVM model with chaotic genetic algorithm (CGA) as a promising method for hydrological prediction[103]. Wang W.C. et al (2013) described an adaptive data analysis methodology, ensembles empirical mode decomposition (EEMD), for decomposing annual rainfall series in a rainfall-runoff model based on a support vector machine (SVM) [104]. Wei L.H. and Billings A.S. (2006) proposed the long term prediction of non-linear dynamical time series, based on multiresolution wavelet models, from historically observed data sets is investigated and directed prediction approach is introduced [105]. Yu X. (2004) demonstrates a combined application of chaos theory and support vector machine (SVM) in the analysis of chaotic time series with a very large sample data record the various parameters inherent in chaos technique and SVM are optimized, with the assistance of an evolutionary algorithm, to yield the minimum prediction error [106]. 6. REVIEW OF RAINFALL RUNOFF MODELING BASED ON GENETIC ALGORITHMS APPROACH  Genetic algorithm (GA) is a new computing paradigm, inspired exploring a possible solution to a task which is initially created at random. After that pairs of individuals associated (crossover) to generate offspring for the next generation (Pujari, 2006). Genetic algorithm is an adaptive global search method that parodies the metaphor of natural biological evolution. Based on will survive and generate the next generation. Naturally, the best generation will have better presentation to get with the conditions. The method can be applied to an extremely wide range of optimization problems. The genetic algorithm differs from other search methods in that this algorithm searches among a population of points, and works with a coding of the parameter set, rather than the parameter values themselves. It also uses objective function information without any gradient information. Owing to its ability to achieve the global or near global optimum, this algorithm has been applied to a large number of combinatorial optimization problems. The standard "