{
    "address": "Fachbereich Mathematik, Johannes Gutenberg-Universit\\\"at Mainz,\n  55099 Mainz, Germany}\n\\email{acampo@mathematik.uni-mainz.de}\n\n\\author[J.~Hausen]{J\\\"urgen Hausen} \n\\address{Fachbereich Mathematik und Statistik, Universit\\\"at Konstanz,\n  78457 Konstanz, Germany}\n\\email{Juergen.Hausen@uni-konstanz.de}\n\n%\\subjclass{14M25}\n\n\n\n\n\n\\begin{abstract}\nWe consider subtorus actions on divisorial toric varieties.\nHere divisoriality means that the variety has many Cartier divisors\nlike quasiprojective and smooth ones. We characterize when a subtorus \naction on such a toric variety admits a categorical quotient in\nthe category of divisorial varieties. Our result generalizes previous\nstatements for the quasiprojective case.\nAn important tool for the proof is a universal reduction of an\narbitrary toric variety to a divisorial one. This is done in terms of\nsupport maps, a notion generalizing support functions on a polytopal\nfan. A further essential step is the decomposition of a given subtorus\ninvariant regular map to a divisorial variety  into an invariant toric\npart followed by a non-toric part.\n\\end{abstract}\n\n\\maketitle\n\n\\section*{Introduction}\n\nIt is a frequently occuring question in algebraic geometry, if an\nalgebraic group action $G \\times X \\to X$ admits a categorical\nquotient, i.e., a regular map $X \\to Y$ that is universal with respect\nto $G$-invariant regular maps $X \\to Z$. For example, moduli\nfunctors are often corepresented by categorical quotients. \nIn general, it is a difficult problem to decide whether a\ncategorical quotient exists. Some counterexamples for actions of the\nmultiplicative group $\\CC^{*}$ are presented in \\cite{acha4}.\n\nAs these examples show, difficulties already arise with\nsubtorus actions on toric varieties. Such actions have been investigated\nby several authors, mainly focusing on the much more restrictive\nconcept of a good quotient, see e.g. \\cite{KaStZe}, \\cite{Sw} and\n\\cite{Hm}. The description of toric varieties in terms of rational\nfans relates the problem of constructing quotients to problems of\ncombinatorial convexity. Hence the class of toric varieties serves as\na testing ground for more general ideas.\n\nNow, let $X$ be a toric variety and let $H$ be a subtorus of the big\ntorus of $X$. Our approach to categorical quotients for the induced action\nof $H$ on $X$ is to consider the problem in suitable subcategories. A\nfirst step is to construct a quotient in the category of toric\nvarieties itself: In \\cite{acha1}, we showed that there always exists\na {\\it toric quotient\\/}\n$$p \\colon X \\to X \\tq H .$$\n\nThis is a toric morphism that is universal with respect to\n$H$-invariant toric morphisms. The essential part of the proof is\nan explicit algorithm in terms of combinatorial data. The toric\nquotient is a canonical starting point for quotients in further\ncategories. For example, in \\cite{acha2} we gave an explicit method\nto decide by means of the toric quotient when a subtorus\naction on a quasiprojective toric variety admits a\ncategorical quotient in the category of quasiprojective varieties.\n\nIn the present article we give a considerable generalization of\nthe results of \\cite{acha2"
}