{
    "address": "Department of Physics, Kharkov Karazin's National University, Svobody Sq.4,\nKharkov\\\\\n61077, Ukraine\\\\\nE-mail: aptm@kharkov.ua}\n\\title{Quantum extreme black holes at finite temperature and exactly solvable\nmodels of 2d dilaton gravity}\n\\maketitle\n\n\\begin{abstract}\n% insert abstract here\nIt is argued that in certain 2d dilaton gravity theories there exist\nself-consistent solutions of field equations with quantum terms which\ndescribe extreme black holes at nonzero temperature. The curvature remains\nfinite on the horizon due to cancelation of thermal divergencies in the\nstress-energy tensor against divergencies in the classical part of field\nequations. The extreme black hole solutions under discussion are due to\nquantum effects only and do not have classical counterparts.\n\\end{abstract}\n\n\\pacs{PACS numbers: 04.60Kz, 04.70.Dy}\n\n\\section{Introduction}\n\nIn \\cite{hawking} it was argued that thermodynamic reasonings allow one to\nascribe nonzero temperature $T$ to extreme black holes since the Euclidean\ngeometry remains regular irrespectively of the value of $T$. As a result, it\nwas conjectured that an extreme black hole may be in thermal equilibrium\nwith ambient radiation at any temperature. This conclusion was criticized in \n\\cite{anders} where it was pointed out that the prescription of \\cite\n{hawking} is suitable only in the zero-loop approximation and does not\nsurvive at quantum level since the allowance for quantum backreaction leads\nto thermal divergencies in the stress-energy tensor that seems to destroy a\nregular horizon completely, so the demand of regularity of this tensor on\nthe horizon seems to enforce the choice $T=0$ for extreme black holes\nunambiguously.\n\nThe aim of the present paper is to show that in dilaton gravity there exists\npossibility to combine a finite curvature at the horizon with divergencies\nof the stress-energy tensor $T_{\\mu }^{\\nu }$. As a result, extreme black\nholes with $T\\neq 0$ and finite curvature on the horizon may exist. Namely,\nthe above mentioned divergencies may under certain conditions be compensated\nby the corresponding divergencies in the classical part of field equations\ndue to derivatives of the dilaton field. We stress that the geometries\ndiscussed below are self-consistent solutions of field equations with\nbackreaction of quantum fields taken into account. In spite of the geometry\nitself turns out to be regular in the sense that the curvature measured from\noutside is finite at the horizon, the solution as the whole which includes,\napart from the metric, the dilaton field as well, is singular. (The similar\nresult was obtained quite recently for nonextreme black holes \\cite{non",
    "author": "O. B. Zaslavskii"
}