{
    "address": "Institute for Theoretical Physics, \\\\\nNSC Kharkov Institute of Physics and Technology,\\\\\n 310108, Kharkov,  Ukraine \\\\\ne-mail: bandos@hep.itp.tuwien.ac.at \\\\\nbandos@kipt.kharkov.ua}\n\n\\author{W. KUMMER}\n\n\\address{Institut f\\\"{u}r Theoretische Physik,\n\\\\\nTechnische\n Universit\\\"{a}t Wien,\n\\\\ Wiedner Hauptstrasse 8-10, A-1040 Wien\\\\\n e-mail: wkummer@tph.tuwien.ac.at}\n\n\\maketitle\\abstracts{\nWe present an action functional and derive equations of motion for a\ncoupled system of a bosonic Dp--brane and an open string ending on the\nDp-brane.  With this example we address the key issues of the recently\nproposed method \\cite{BK,BKD9} for the  construction of  manifestly\nsupersymmetric action functionals for interacting superbrane systems.  We\nclarify, in particular,  how the arbitrariness in sources localized on the\nintersection \\cite{BK,BKD9}  is related to the standard description of\nthe flat D-branes as rigid planes where the string for endpoints 'live'.\n}\n\n\\section*{Introduction}\n\nRecently an approach to obtain a supersymmetric action functional for a\ncoupled system of interacting superbranes has been proposed\n\\cite{BK,BKD9}.\nThe aim of the study \\cite{BK,BKD9} was to construct a basis for a future\nsearch for new solitonic solutions  of worldvolume equations of superbranes\nand of supergravity equations with a complicated system of brane sources.\n\nThe system of open fundamental superstring ending on a super--Dp-brane\n\\cite{Dbranes} was considered in \\cite{BK,BKD9} as a generic case of\ninteracting brane system in the frame of the 'brane democracy' concept\n\\cite{Town}.  On the other hand, the manifestly supersymmetric\ndescription of such system can be useful in a search for a quasiclassical\neffective action of the system of coincident branes which are conjectured\nto carry non-Abelian gauge fields \\cite{NDp} (non-Abelian\nDirac--Born--Infeld action \\cite{Tseytlin",
    "author": "I. BANDOS"
}