{
    "address": "Institut f\\\"{u}r Theoretische Physik, Universit\\\"{a}t T\\\"{u}bingen,\\\\\n Auf der Morgenstelle 14, 72076 T\\\"{u}bingen, Germany }\n\n\\maketitle\n\\begin{abstract}\nMotivated by several recent papers on string-inspired calculations in\nQED, we here present our own use of world-line techniques in order to \ncalculate the\nvacuum polarization and effective action in scalar and spinor QED with\nexternal arbitrary constant electromagnetic field configuration.\n\\end{abstract}\n\\pacs{PACS numbers: 03.70.+k, 12.20.Ds}\n \\newpage\n\\narrowtext\n\\section{Introduction}\nString-inspired methods in QFT were initiated by Bern and Kosower\n\\cite{a}, who applied them to compute one-loop amplitudes in various\nfield theories. These authors and Strassler \\cite{str} then recognized\nthat some of the well-known vacuum processes in QED and QCD can be\ncomputed rather easily with the aid of one-dimensional path integrals for\nrelativistic point particles. Similar techniques and results are also\ncontained in the monograph by Polyakov \\cite{pol}. String-inspired\nmethods, particularly in QED, were then extensively studied in a\nseries of papers by Schmidt, Schubert and Reuter, cf.,e.g.,\\cite{SSR},\nwhere the state of the art is reviewed extensively. \nThere are also contributions by McKeon \\cite{mk} and various\nco-authors who have proved that world-line methods are extremely useful.\n\nIn the present article we will try to compactify their work and present\nsome new representations which will finally permit us to write the\none-loop diagram tied to an\narbitrary number of off-shell photons - together with an applied external\nconstant electromagnetic field of any configuration - in a so far\nunknown manner . This\nhighly condensed form for the one-loop vacuum process turns out to be\ndirectly applicable to various limiting situations, e.g., turning off\nthe off-shell photon lines will bring us back to the effective action\nof QED which in the low-frequency limit yields the Heisenberg-Euler\nLagrangian. Another process should be photon splitting in a prescribed\nconstant magnetic field as calculated by Adler and Schubert \\cite{as}.\n\n\\section{Vacuum Polarization without external Fields - scalar QED.}  \n\nOur starting point is the one loop action, which we write in a path integral\nrepresentation,\n\\begin{equation}\n\\label{eq:ea1}\n\\Gamma \\left[ A\\right]= \\displaystyle-i\\int ^{\\infty }_{0}\\frac{dT}{T}{\\cal\n  N",
    "title": "Vacuum Polarization in QED with World-Line Methods"
}