{
    "address": "Helsinki Institute of Physics, PO Box 9, \n 00014 University of Helsinki, Finland} \n\n\\begin{abstract}\nWe derive a lattice approximation for a class of equilibrium quantum\nstatistics describing the behaviour of any combination and number of\nbosonic and fermionic particles with any sufficiently binding\npotential. We then develop an intuitive Monte Carlo algorithm which\ncan be used for the computation of expectation values in canonical and\nGaussian ensembles and give lattice observables which will converge to\nthe energy moments in the continuum limit.  The focus of the\ndiscussion is two-fold: in the rigorous treatment of the continuum\nlimit and in the physical meaning of the lattice approximation.  In\nparticular, it is shown how the concepts and intuition of classical\nphysics can be applied in this sort of computation of quantum effects.\nWe illustrate the use of the Monte Carlo methods by computing\ncanonical energy moments and the Gaussian density of states for\ncharged particles in a quadratic potential.\n\\end{abstract}\n\n\\pacs{05.30.-d, 02.50.Ng, 05.10.Ln}\n\n% Uncomment for Submitted to journal title message\n\\submitted\n% Comment out if separate title page not required\n%\\maketitle\n\n\\section{Introduction}\n\nRecently, the role of the canonical Boltzmann-Gibbs ensemble as the\nonly useful ensemble for quantum statistics has been reevaluated.  The\nneed for reevaluation has arisen both from experimental and\ntheoretical considerations.  Although the canonical ensemble works\nsurprisingly well also for systems consisting of only a few particles,\nrelativistic ion collisions have provided an arena where the\ncorrections from the finite size of the system to the canonical\nresults have become important \\cite{redlich:94}.  A\nquantitative understanding  of these collisions is necessary since\nthey are central in the search for new phases of strongly interacting\nmatter, such as quark-gluon plasma.  In addition, methods for a\nquantitative measurement of the properties  of small quantum systems\ncould be useful in industrial applications in the future,  such as in\nthe design of ever smaller electronic components.  Similarly, the\nfunctioning of certain biological systems  seems to involve also the\nquantum behaviour of the system---consider, for instance, the\nrecognition of molecules by olfactory receptors\n\\cite{wright:smell}.\n\nThe second motivation for non-canonical ensembles comes from the\npeculiar behaviour associated with systems with fractal-like\nstructure.  Tsallis statistics \\cite{tsa88} was\ndeveloped for the statistical analysis of these cases and we have\nconsidered other generalized statistics of that kind in a previous\nwork \\cite{jml:tsallis}.  For ``ordinary'' systems, however, we found\nout that the so called Gaussian ensemble is the simplest\ngeneralization of the canonical ensemble which could be used for the\napproximation of any precanonical system---these are systems for which\nthe occupation of high-energy states decreases faster than\nexponentially.  For a more complete description of precanonical and\nGaussian ensembles, see \\cite{jml:tsallis} and  \\cite{jml:gauss},\nrespectively.  Of the non-canonical ensembles, we concentrate here\nonly on the Gaussian ensemble with the understanding that  the results\npresented can be easily modified to apply  for any precanonical\nensemble.\n\nIn this work, we develop and prove the existence of a lattice\napproximation for a system of a fixed number of non-relativistic\nparticles which may be fermions, bosons or a combination of both.  The\npotential of this system can be very general, the only requirement\nbeing a fast enough increase at infinity.  We do not consider the\npossibility of a creation or annihilation of particles---this would\nrequire the use of a quantum field theory instead of ordinary quantum\nmechanics and we would have to give up mathematical rigour in the\ntransition.  Formulations of the microcanonical ensemble using quantum\nfield theory and its perturbative expansion have already been proposed\nby Chaichian and Senda \\cite{chs:93} and our approach owes a\nlot to their work.\n\nWe begin by defining notations and by stating assumptions we need to\nmake on the potential in section \\ref{sec:notations}.   We then state\na theorem which defines and proves the convergence of the lattice\napproximation of traces at a complex temperature and  we derive a set\nof lattice observables which can be used for the measurement of energy\nmoments. The following section \\ref{sec:canalg} presents a Monte Carlo\nalgorithm  for the generation of the canonical lattice distribution\nand we also try to develop an intuitive understanding of it.   Section\n\\ref{sec:gauss} contains similar derivations for the Gaussian\nensemble, especially it contains an essentially canonical  algorithm\nwhich can be used for the computation of  the density of states.  We\nconclude with an example where we test the algorithms in practice and\ncomment on their strengths and draw-backs.  We have also gathered a\ncomparison  of our methods to the ones presented in the literature\nalong with suggestions for improvements in section \\ref{sec:prologue}.\nA good review of the state of the art of using Monte Carlo simulations\nfor path-integrals of quantum fluids has been given by Ceperley\n\\cite{ceperley95}.\n\n\\section{Notations and background}\\label{sec:notations}\n\nConsider a system of $N$ particles living  in a $d$-dimensional space.\nIn classical physics, this system is described by trajectories of\nthese particles and the positions of the particles form the relevant\ndegrees of freedom, an $n$-dimensional space with $n=N d$.  We shall\nhere choose the convention that the positions of particles are denoted\nby boldface letters with a subscript identifying the label of the\nparticle while the classical configuration of the system  is denoted\nby regular italics. For example, the $n$-dimensional  configuration\n$x$ could be written in terms of the $N$ position vectors as\n$x=(\\bi{x}_1,\\ldots,\\bi{x"
}