{
    "address": "Mathematische\n  Fakult\\\"at, Ruhr-Universit\\\"at, 44780 Bochum, Germany}\n%\\curraddr{}\n\\email{s.schroeer@ruhr-uni-bochum.de}\n%\\thanks{}\n\n% author two information\n\\author{Bernd Siebert} \\address{Mathematische Fakult\\\"at,\n  Ruhr-Universit\\\"at, 44780 Bochum, Germany}\n%\\curraddr{}\n\\email{bernd.siebert@ruhr-uni-bochum.de}\n%\\thanks{}\n\n\\subjclass{14D15 14D22, 14J15, 32G05, 32G13, 32J05, 32F15}\n%\\date{2.4.2000}\n\n% at present the \"communicated by\" line appears only in ERA and PROC\n%\\commby{}\n\n\\dedicatory{Hans Grauert zum 70.\\ Geburtstag gewidmet}\n\\begin{abstract}\n  We classify irreducible $d$-semistable degenerations\n  of primary Kodaira surfaces. As an application we construct a canonical\n  partial completion for the moduli space of primary Kodaira surfaces.\n\\end{abstract}\n\n\\maketitle\n\n%===========================================================\n\\section*{Introduction}\n\nA smooth compact complex surface with trivial canonical bundle is a\nK3 surface, a 2-dimensional complex torus, or a primary Kodaira\nsurface. Normal crossing degenerations of such surfaces have\nattracted much attention. For example, Kulikov analyzed projective\ndegenerations of K3 surfaces \\cite{Kulikov 1977}. His results were\ngeneralized by Persson and Pinkham to degenerations of surfaces with\ntrivial canonical bundle whose central fiber has algebraic components\n\\cite{Persson; Pinkham 1981}. Conversely, Friedman characterized the\nsingular K3 surfaces from Kulikov's list that deform to smooth K3\nsurfaces by his notion of $d$-semistability \\cite{Friedman 1983}.\n\nFor non-K\\\"ahler degenerations no general results seem to be known.\nWe chose primary Kodaira surfaces as our object of study because they\nlack some complications that the more interesting classes of tori and\nK3 surfaces have. On the other hand, Kodaira surfaces have a lot in\ncommon with tori and, via the Kummer construction, with K3 surfaces.\nThe phenomena one sees in degenerations of Kodaira surfaces should\ntherefore also be observable in the other classes of surfaces with\ntrivial canonical bundle.\n\nBy a result of Borcea the moduli space $\\foK$ of smooth Kodaira\nsurfaces is isomorphic to a countable union of copies of\n$\\CC\\times\\Delta^*$ \\cite{Borcea 1984",
    "author": "Bernd Siebert"
}