{
    "address": "C. N. Yang Institute for Theoretical Physics\\\\\nState University of New York\\\\\nStony Brook, NY 11794-3840, USA}\n\\begin{abstract}\n\\noindent\n\nI review the revolutionary impact Rodney Baxter has had on statistical\nmechanics beginning with his solution of the 8 vertex model in 1971\nand the invention of corner transfer matrices in 1976 to the creation\nof the RSOS models in 1984 and his continuing current work on the\nchiral Potts model.\n\n\\end{abstract}\n\\end{center}\n\n\\section{Introduction}\n\nAt the beginning of the $20^{th}$ century statistical mechanics was\nconceived of as a microscopic way to understand the laws of\nthermodynamics and the kinetic theory of gases. In practice its scope\nwas limited to the classical ideal gas, \nthe perfect quantum gases and finally to\n a diagrammatic technique devised in the $30's$ for computing the low density\nproperties of gases. At that time there was even debate as to if\nthe theory were in principle powerful enough to include phase\ntransitions and dense liquids.\n\nAll of this changed in 1944 when Onsager \\cite{ons} demonstrated that\nexact solutions of strongly interacting problems were possible \nby computing the free energy of the Ising model.\nBut, while of the greatest\nimportance in principle, this discovery did not radically alter the field of\nstatistical mechanics in practice. However, starting \nwith the beginning of the 70's\nRodney Baxter took up the cause of exactly solvable models in\nstatistical mechanics and from that time on the field has been so\ntotally transformed that it may truly be said that a revolution has\noccurred. In this paper I will examine how this revolution came about. \n\n\n\\section{The Eight Vertex model}\n\n\nOnsager's work of 1944 was monumental but cannot be said to be\nrevolutionary because its consequences were so extremely\nlimited. Kaufman and Onsager \\cite{kauf}--\\cite{ko} \nreduced the computations to a free  fermi\nproblem in 1949 and after Yang \\cite{yang} computed \nthe spontaneous magnetization\nin 1952 there were no further developments. Indeed the reduction of\nthe solution of the Ising model to a free fermi problem had the effect\nof suggesting that Onsager's techniques were so specialized that there\nmight in fact not be any other statistical mechanical models which\ncould be exactly solved.\n\nIt was therefore very important when in 1967 Lieb \\cite{lieb",
    "author": "Barry M. McCoy",
    "title": "The Baxter Revolution"
}