{
    "address": "\n        $^1$Instituto de Estructura de la Materia.\n        Consejo Superior de Investigaciones Cient{\\'\\i}ficas.\n        Serrano 123, 28006 Madrid. Spain. \\\\\n        $^2$Instituto de Ciencia de Materiales.\n        Consejo Superior de Investigaciones Cient{\\'\\i}ficas.  \n        Cantoblanco. 28049 Madrid. Spain. \\\\\n        $^3$Departamento de Matem\\'aticas.\n        Universidad Carlos III.\n        Avda. de la Universidad 30.\n        28911 Legan\\'es. Madrid. Spain.}\n\\date{\\today}\n\\maketitle\n\n\n\\vspace{1cm}\n\\begin{abstract}\nThe instabilities induced on a two-dimensional system\nof correlated electrons by the anisotropies of its Fermi line are\nanalyzed on general grounds. Simple scaling arguments allow to\npredict the opening of a superconducting gap with a well-defined symmetry\nprescribed by the geometry of the Fermi line. The same arguments predict a\ncritical dimension of 3/2 for the transition of the two-dimensional system \nto non-Fermi liquid behavior. The methods are applied to the $t-t'$\nHubbard model in a wide range of dopings.\n\n\\end{abstract}\n\\pacs{71.27.+a, 74.20.Mn}\n%\\narrowtext %\\newpage\n\n\n\\section{Introduction}\n\n\nTwo-dimensional electron systems are the stage in which\nmost relevant quantum phase transitions arise. The prototype of\nthese phenomena is the Mott-Hubbard transition\\cite{mott},\nwhich can only\nbe understood in the context of a very strong correlation\nbetween the electrons. Many of the properties of the high-$T_c$\nsuperconductors are also supposed to be the consequence of\nstrong correlations in the two-dimensional layers\\cite{and1}.\nIn both\ncases, these reflect themselves in the presence of very marked\nfeatures in the single-particle dispersion relation. The case of\nthe copper-oxide compounds has been actually studied with\nincreasing accuracy from the experimental point of view, and the\nangle-resolved photoemission measurements have been able to\ncharacterize the drastic change that the dispersion relation\nsuffers when the stechiometric material is increasingly\ndoped\\cite{photo",
    "author": "J. Gonz\\'alez $^1$, F. Guinea $^2$ and M. A. H. Vozmediano $^3$ \\\\"
}