{
    "address": "%\nNihon Fukushi University,\nHanda, 475-0012, Japan\n}\n\n\\abstract{\nWe show how the scalar field, a candidate of quintessence, in a proposed model of the scalar-tensor theories of gravity provides a way to understand a small but nonzero cosmological constant as indicated by recent observations.  A particular emphasis is placed on the effort to inherit the success of the scenario of a decaying cosmological constant.  Discussions of a possible link to non-Newtonian gravity, the coincidence problem, the issue of time-variability of coupling constants as well as the chaos-like nature of the solution  are also included in a new perspective.\n}\n\n\n%%%%%%%%%%%%%%%%%%%%%%%%% I %%%%%%%%%%%%%%%%%%%%%%%%%%\n\\section{Introduction}\n\n\nFor the last few years we have heard much about indications, coming from such observations like age problem, large-scale structure, lens statistics and type Ia supernovae, for the presence of a small but nonzero cosmological constant.  The expected size is measured in units of the parameter $\\Omega_{\\Lambda}\\equiv \\Lambda /\\rho_{\\rm crit}$, with the most favored number somewhere around $0.6 - 0.7$ [\\cite{perl}].  \n\n\nAcceptance of the conclusion from a theoretical point of view is limited, however, because $\\Lambda$ has been considered to be highly artificial, unnatural and arbitrary.   Alternative ideas have been discussed to produce nearly the same end result.  One of the key observations is that in the language of ideal fluid in cosmology, introducing $\\Lambda$ is equivalent to assuming an equation of state, $p=-\\rho$.  This aspect of negative pressure is what one can implement in terms of a scalar field that couples to ordinary matter roughly as weakly as gravity.\n\n\nThe study of this type of a ``gravitational scalar field\" has a long history [\\cite{jordan}--\\cite{peeb}].  Recently, Chiba {\\sl et al}. presented a detailed analysis showing how the assumed negative pressure can be compared with observations [\\cite{chiba}].  They did not confine themselves to a scalar field, calling it X-matter.  Caldwell {\\sl et al}. were the first to use a new name ``quintessence,\" as the fifth element of the universe in addition to the four; baryons, radiation, dark matter and neutrinos [\\cite{stein}].  They focussed more on the scalar field, discussing what the potential of the field should be like in order to fit the observations.  An inverse-power potential is preferred over the exponential potential, for example.  \n\n\nWe complain, however, that many of the analyses are too much phenomenology-oriented [\\cite{qt},\\cite{qt2}].  We are talking about $\\Lambda$ which has been much discussed, often under such a grandeur name like the ``cosmological constant problem,\" at the center of which lies a question why the observed value or its upper bound is so small compared with what we expect naturally from a theoretical point of view, by as much as 120 orders of magnitude [\\cite{wnb}].  \n\n\nIn this connection we remind the audience that some progress has been\nachieved in terms of scalar-tensor theories.  We believe that these\ntheories are promising because they might have important aspects\nshared by attempts toward unified theories, and also because they\nprovide the simplest derivation of an exponential potential of the\nscalar field, allowing us to implement the ``scenario of a decaying\ncosmological constant\" [\\cite{decay"
}