{
    "address": "\nInstitut f\\\"ur Theoretische Physik,\nUniversit\\\"at zu K\\\"oln,\nZ\\\"ulpicher Strasse 77,\n50937 K\\\"oln, Germany}\n\n\\date{January 13, 2000}\n\\maketitle\n\n\\begin{abstract}\nTo analyze phase transitions in a nonequilibrium system we study its grand\ncanonical partition function as a function of complex fugacity.  Real and\npositive roots of the partition function mark phase transitions.  This\nbehavior, first found by Yang and Lee under general conditions for equilibrium\nsystems, can also be applied to nonequilibrium phase transitions.  We consider\na one-dimensional diffusion model with periodic boundary conditions.\nDepending on the diffusion rates, we find real and positive roots\nand can distinguish two regions of analyticity, which can identified with  two\ndifferent phases.  In a region of the parameter space both of these phases\ncoexist.  The condensation point can be computed with high accuracy.\n\\end{abstract}\n\n\\pacs{PACS: \n\t05.20.-y, % Classical statistical mechanics,\n\t02.50.Ey, % Stochastic processes,\n\t05.70.Fh, % Phase transitions: general studies,\n\t05.70.Ln %Nonequilibrium thermodynamics, irreversible processes\n\t}\n\n]\n\nThe investigation of nonequilibrium systems is a growing field in statistical\nmechanics and currently attracts much attention.  In this context simple models\nsuch as driven diffusive systems play a paradigmatic role similar to the Ising\nmodel in equilibrium statistical mechanics.  These systems establish a simple\nframework in which many phenomena can extensively be studied.  Moreover, driven\ndiffusive systems can easily be mapped to other nonequilibrium models, e.g.\nof polymer dynamics, interface growth and traffic flow\n\\cite{PrBook,ScZi,HaZh,Na}.\n\n\n\nA hallmark of many nonequilibrium systems is the absence of detailed balance\nand the support of stationary states with non-vanishing currents.  Hence these\nsystems build a larger class than respective equilibrium systems and phase\ntransitions may appear under less restrict conditions.  For example, it is\nknown that spontaneous symmetry breaking and a first-order phase transition may\noccur in one-dimensional nonequilibrium systems with short-range interactions\n\\cite{SSB}.\n\nIn thermal equilibrium the probability measures can in principle be expressed\nthrough an appropriate ensemble.  For driven systems an equally powerful\nconcept is missing.  In Ref. \\onlinecite{DeJaLeSp",
    "author": "Peter F. Arndt",
    "title": "Yang--Lee Theory for a Nonequilibrium Phase Transition"
}