{
    "affiliation": "pernicus Astronomical Center, Bartycka 18, PL-00716 Warsaw,\nPoland, e-mail: mikolaj@camk.edu.pl}\n\n\\begin{abstract}\nBoth the red giants and the Mira variables\nin symbiotic systems have systematically higher mass-loss rates\nthan do typical galactic giants and Miras,\nwhich suggests that only very evolved giants, and so those with\nhighest mass-loss rates, can support symbiotic behaviour\nin widely separated binary systems.\nThey often show a flattened mass-loss geometry\ndue to an intrinsically inhomogeneous \nmass loss and/or tidal interactions between the binary components.\nThe main body of a symbiotic nebula is thus formed from material\nlost in the giant wind, while the hot component is responsible\nfor its ionization and excitation. In addition, the fast wind and/or\njet ejection from\nthe hot component, whenever occur, \ngive rise to the complex, often bipolar, shape of \nsymbiotic nebulae.\nObservations of resolved nebulae also suggest that \nthe binary geometry and nebular structure are aligned\nbut the bipolar outflow may be not orthogonal to \nthe orbital plane in all cases.\n\\end{abstract}\n\n\n\\keywords{symbiotic binaries, circumstellar matter, mass loss}\n\n\\section{Introduction}\n\nSymbiotic stars are interacting binaries composed of\nan evolved giant primary and a hot, luminous companion\nsurrounded by an ionized nebula. \nDepending on the nature of the giant \nwe have two distinct classes:\nthe S-type with normal giants and orbital periods\nof about 1--15 yr, and the D-type with Mira primaries\nusually surrounded by a warm dust shell, and orbital periods\ngenerally longer than 10 yr.\nThe hot star in most cases appears to\nbe a white dwarf powered by thermonuclear\nburning of the material accreted from its companion's wind.\nThe presence of both the evolved giant, heavily losing mass\nin most cases, and the hot companion copious in ionizing photons\nand often possessing its own wind lends large variety to the\ncircumstellar environment of symbiotic binaries.\n\nThis paper gives a brief summary of the observed properties\nof the symbiotic\ncircumstellar envelopes. \nMore details\ncan be found in Miko{\\l",
    "author": "Joanna Miko{\\l}ajewska",
    "title": "Observed Properties of Mass Loss in Symbiotic Binaries"
}