{
    "address": "$^{1}$ Department of Applied Physics, P.O.Box 208284, \nYale University, New Haven, CT 06520-8284}\n\\address{$^{2}$ Bell Laboratories-- Lucent Technologies, \n700 Mountain Ave., Murray Hill NJ 07974} \n\n\\date{ \\today}\n\n\\maketitle\n\n\\begin{abstract}\nWe consider the effect of dynamical localization on the lifetimes\nof the resonances in open wave-chaotic dielectric cavities. We\nshow that dynamical localization leads to a log-normal\ndistribution of the resonance lifetimes which scales with the\nlocalization length in excellent agreement with the results of \nnumerical calculations for open rough microcavities. \n\\end{abstract}\n\\vspace*{-0.05 truein} \n\\pacs{PACS numbers: 42.55.Sa, 05.45.Mt, 42.25.-p } \n\\vspace*{-0.15 truein} \n\nThe study of lifetime distributions\nof finite quantum systems weakly coupled to a continuum \nis a subject of active experimental and theoretical investigation.\nThe nature of the spectrum of resonances depends strongly on the nature of \nthe states of the finite system ``in isolation''. For example if those states \nare ergodically extended and \nstructureless over the system then the resonances will show the behavior \nexpected from \nrandom matrix theory, the famous Porter-Thomas distribution in the case of a \nsingle channel \\cite{Porter-Thomas}.\nA close relative of this resonance distribution has been measured in quantum \ndots in the  Coulomb blockade regime \\cite{stone,Chang96}. \nMore recently it has been pointed out \nthat optical cavities with partially or fully chaotic ray dynamics would \nhave interesting resonance properties and efforts have been made to \ncharacterize their distribution in various \nlimits\\cite{noeckel-stone,science,NHJS99}.  In a geometry which is \napproximately translationally invariant in one direction the wave \nequation becomes a scalar equation with \na close formal analogy to the Schr\\\"odinger equation and the \nphysics of the resonance spectrum \nbecomes essentially the same for the optical and quantum systems. \nWe will henceforth consider cylindrical dielectric resonators which are \ntranslationally invariant along their axis, but \ncan be deformed in their cross-section.\nThe analogue of the classical limit of the Schr\\\"odinger equation is the \nlimit of ray optics when the wavelength of the electromagnetic field \nis much shorter than the typical radius of the cavity $\\lambda \\ll R_0$. \nWe will regularly use the term \"quantum\" to describe properties of the wave \nsolutions which differ from the behavior of rays in the same geometry.\nThe motion of a light ray within the cavity is identical to that of a \npoint mass in a classical \nbilliard and the resulting bound states are the analogue of the eigenstates of \n\"quantum billiards\" \\cite{stockman}. However, unless the index of \nrefraction, $n$, is taken infinite, none of these states are truly bound, \nthere always being some \nnon-zero probability of escape from the cavity. Moreover in the case of \na simple dielectric cavity the escape probability is strongly dependent on the \nangle of incidence of the ray.  \nIn particular, rays bouncing at the cavity's boundary with an angle \nof incidence $\\chi$ smaller than the critical angle, $\\chi_c= \\sin^{-1",
    "author": "Oleg A. Starykh$^{1}$, Philippe R. J. Jacquod$^{1"
}