{
    "address": "\\it The Racah Institute of Physics, Hebrew University of \n  Jerusalem,\\\\ Givat Ram, Jerusalem 91904, Israel} \n \n \n\\date{\\today} \n \n\\maketitle \n\n\\begin{abstract} \nWe illustrate how Hawking's radiance from a Schwarzschild black hole\nis {\\it modified} by the electrostatic self-interaction of the emitted\ncharged particles. A W.K.B approximation shows that the probability\nfor a self-interacting charged particle to propagate from the interior\nto the exterior of the horizon is increased relative to the\ncorresponding probability for neutral particles.  We also demonstrate\nhow the electric potential of a charged test object in the black\nhole's vicinity gives rise to pair creation.  We analyze this\nphenomenon semiclassically by considering the existence of the\nappropriate {\\it Klein region}.  Finally we discuss the possible\nenergy source for the process.\n\\end{abstract} \n\\pacs{04.70.Dy, 04.62.+v,97.60.Lf,  11}\n \n\\section{Introduction} \n \nThe aim of this work is to study various effects that may take place \nwhen a charged object propagates on a background Schwarzschild \nspacetime.  As elucidated by Vilenkin\\cite{Vilenkin} and corroborated \nby Smith and Will\\cite{Smith} and Lohiya\\cite{Lohiya}, in contrast to \nthe situation in flat spacetime, in the presence of a Schwarzschild \nblack hole the {\\it self-field} of the object, makes a nontrivial \ncontribution to the object's energy as measured at infinity. \nAlternatively, this phenomenon may be interpreted as black hole \npolarization; the test object polarize the black hole so that image \ncharges are formed on the black hole horizon. It was shown by various \nauthors \\cite{BekMayo} that this effect is of unquestionable \nimportance in black hole thermodynamics. One may think of two \nadditional {\\it distinct} effects that may take place on account of \nblack hole polarization. The first is the emission of self-interacting \ncharged particles. Here the black hole is {\\it isolated}. The \ntemperature of the black hole is assumed to be high enough so that the \nlightest massive charged particles may be emitted. The second effect \nis pair creation due to vacuum polarization. The black hole is allowed \nto interact with an \\textit{exterior ",
    "author": "Avraham E. Mayo\\thanks{Electronic mail: Mayo@cc.huji.ac.il}"
}