{
    "affiliation": "pt.\\ of Astronomy, University of Michigan \\\\\n%Ann Arbor, MI 48109-1090 \\\\\n%jsa@astro.lsa.umich.edu, jbregman@astro.lsa.umich.edu}\n\n\\title{On the Internal Absorption of Galaxy Clusters}\n\\author{John S.\\ Arabadjis and Joel N.\\ Bregman}\n\\affil{University of Michigan}\n\\affil{Dept.\\ of Astronomy}\n\\affil{Ann Arbor, MI 48109-1090}\n\\affil{jsa@astro.lsa.umich.edu}\n\\affil{jbregman@astro.lsa.umich.edu}\n\n\\keywords{galaxies: clusters -- ISM: general -- X-rays: ISM}\n\n\\begin{abstract} %============================================================\n\nA study of the cores of galaxy clusters with the Einstein SSS indicated\nthe presence of absorbing material corresponding to $10^{12}$ \\Msun\\ of cold\ncluster gas, possibly resulting from cooling flows.  Since this amount of\ncold gas is not confirmed by observations at other wavelengths, we\nexamined whether this excess absorption is present in the \\ROSAT\\ PSPC\nobservations of 20 bright galaxy clusters.  For 3/4 of the clusters,\nsuccessful spectral fits were obtained with absorption due only to the\nGalaxy, and therefore no extra absorption is needed within the clusters, in\ndisagreement with the results from the Einstein SSS data for some of the\nsame clusters.  For 1/4 of the clusters, none of our spectral fits was\nacceptable, suggesting a more complicated cluster medium than the\ntwo-temperature and cooling flow models considered here.  However, even for\nthese clusters, substantial excess absorption is not indicated.\n\n\\keywords{galaxies: clusters: general -- ISM: general --- X-rays: ISM}\n\n\\end{abstract}\n\n\n\\section{Introduction} %======================================================\n\nA central consequence of the cooling flow model for galaxy clusters is that\ncool gas is deposited in the central 200 kpc region at a rate that is\ntypically 30-300 \\Msun\\ y$^{-1}$ \\citep{wjf,af}.  Although this\nmodel is consistent with a wealth of X-ray data, there has been considerable\nskepticism about the validity of this picture because of the difficulty in\nfinding the end state of this cooled gas.  The gas does not form stars with a\nnormal initial mass function, so either star formation is heavily weighted to\nlow mass stars, the material does not form stars but remains as cooled gas, or\nthe cooling flow model is incorrect.  Consequently, there was considerable\nexcitement when X-ray observations claimed to discover large amounts of cooled\ngas in galaxy clusters with approximately the masses expected from a long-lived\ncooling flow \\citep{wfjma",
    "author": "John S.\\ Arabadjis and Joel N.\\ Bregman",
    "title": "On the Internal Absorption of Galaxy Clusters"
}