{
    "address": "Theoretical Physics Department \\\\ Fermi National Accelerator \nLaboratory~\\thanks{Fermilab is operated by Universities Research \nAssociation Inc.\\ under Contract No.\\ DE-AC02-76CH03000 with the \nUnited States Department of Energy.  }\\\\ P.O.  Box 500, Batavia, \nIllinois 60510 USA}\n\n\\lefthead{\\thepage \\hfill \\textsf{FERMILAB--CONF--00/021--T}}\n\\righthead{\\textsf{FERMILAB--CONF--00/021--T}\\hfill\\thepage}\n\\maketitle\n\\vspace*{12pt}\n\\begin{center}\n    \\fbox{\\textrm{Dedicated to the Memory of Sam Treiman}}\n\\end{center}\n\\vspace*{-12pt}\n\n\n\\begin{abstract}\nI quickly review the successes of quantum chromodynamics.  Then I \nassess the current state of the electroweak theory, making brief \ncomments about the search for the Higgs boson and some of the open \nissues for the theory.  I sketch the problems of mass and mass scales, \nand point to a speculative link between the question of identity and \nlarge extra dimensions.  To conclude, I return to QCD and the \npossibility that its phase structure might inform our understanding of \nelectroweak symmetry breaking.\n\\end{abstract}\n\n\\section*{Appreciation}\nSam Treiman left us a few days ago.  With his deep respect for great \nprinciples, his acute understanding of field theory, and his joyful \nengagement with experiment, Sam was a model and a guide to many of us \nfor whom the goal---the joy---of theoretical physics is not to gather \nup a hoard of shiny theorems, but to learn to read Nature's secrets.  \nHe was mentor to many of our most valued theoretical colleagues, and \nthe course on particle physics he described as ``shamelessly \nphenomenological'' brought culture to generations of Princeton \nstudents.  He was a natural man---unpretentious and a little \nrumpled---who took wry pleasure in seeing the self-important deflated.  \nA graceful writer himself\\cite{pref,sbt}, he was a writer's ideal \nreader: curious, appreciative, eager to share an original idea or a \nprovocative passage from his reading, and ever ready to recommend a \ngood book.\\footnote{His last recommendation to me was the luminous \ntranslations of \\textit{The Iliad} and \\textit{The Odyssey} by Robert \nFagles\\cite{fagles}.} Sam confessed to me, without remorse, that he \ncoined ``The Standard Model,'' a curiously flat name for the marvelous \ntheory of quarks and leptons that he helped to build.  I forgave him \nthen, and I forgive him now---but we still need a better name!\n\n\\section*{Our Picture of Matter}\nSome twenty-five years after the November Revolution, we base our \nunderstanding of physical phenomena on the identification of a few \nconstituents that seem elementary at the current limits of resolution \nof about $10^{-18}\\m$, and a few fundamental forces.  The \nconstituents are the pointlike quarks\n\t\\begin{equation}\n\t\t\\left(\n\t\t\\begin{array}{c}\n\t\t\tu  \\\\\n\t\t\td\n\t\t\\end{array",
    "author": "Chris Quigg",
    "title": "The State of the Standard Model"
}