{
    "address": "Polymers \\& Colloids group, \nCavendish Laboratory, Madingley Road, Cambridge, UK. CB3 OHE \\\\\n\\vspace{0.1in}\n\\parbox{5.5in}{\\rm\nSheared concentrated colloids with short range polymer coats\nare examined via simulations. Distributions of force are found to be sums of \nexponentials. The 'hydrodynamic \nclustering' underlying the shear thickening effect is shown, in this system, to be a network of\npercolating coat contacts, with coats both in compression and extension. The geometry and kinetics of this network are explored along with its relation to the bulk stress tensor. Particles experience strong fluctuations in force over epochs $\\it{circa}$ 10\\%  strain.  Density fluctuations up to glassy\nvolume fractions give rise to scattering peaks at low Q in the thickening regime. There is some commonality in the physics of this colloid particulate system and other granular media. \\\\\n\\\\ Pacs Numbers: 83.50.-v, 47.20.Ft, 83.50.Qm, 83.70.Hq}\n}\n\\input epsf\n%\\usepackage{graphics}\n\\begin{document}\n\\def\\vf{\\phi_{v}}\n\\maketitle\n\nWhat is the physics of concentrated particles in flow ?  Detailed observation is hard, however, simulations of powders/granular media \\cite{thornton}, \\cite{radji} have provided much insight.  They\nhave shown exponential distributions of force and force-chains. The origin of the distribution of force has motivated much theory [3-6], although in the main for static systems.\n\n%\\cite{coppersmith},\\cite{grinev&edwards},\\cite{cates}, \\cite{ball&grinev}  \n\nThis letter examines force transmission in steady states of sheared colloid systems.  \nIt concerns shear thickening, a dramatic effect in which, at high\nshear rates, concentrated colloids develop high, and sometimes diverging, viscosities \\cite{barnes}.\nUnderstanding thickening is of considerable interest [8-12].  \nThe concept of 'hydrodynamic clustering' has been introduced to explain thickening, but its precise meaning has not been explored.  The main aim of this letter is to clarify 'hydrodynamic clustering' , but on route to this commonalities will be found with dry powders.\n\n%\\cite{bender&wagner},\\cite{buteraetal},\\cite{chow&zukoski},\\cite{frith} \\cite{jmhvrb}.\n\nThis work considers colloids of rigid particles suspended in a fluid. \nParticle motion is overdamped. The equation of motion is\n  \n\n\\begin{equation} \\bf{R}\\cdot \\bf{V} + \\bf{F}_{C} + \\bf{F}_{B} = 0  , \\end{equation} \nwhere $\\bf{V}, \\bf{F}_{C}, \\bf{F}_{B}$ are $6N$ velocity/angular-velocity and colloid and Brownian \nforces/torque vectors and $\\bf{R}$ is a \n$6N \\times 6N $ drag matrix of dissipative hydrodynamic interactions.\n\nThe results below are, in the  main, for a model which includes just the squeeze mode of hydrodynamic lubrication forces \nbetween near neighbours.  \nFor spheres $i$ and $j$ with velocities $\\bf{v}_{i}$ and $\\bf{v}_j$ this determines a force $\\bf{f}_{ij}$ on particle $i$\n\n\\begin{equation}\\bf{f}_{ij}= - \\alpha(\\it{h",
    "author": "John R. Melrose",
    "title": "Distributions of forces and 'hydrodynamic clustering' in a shear thickened colloid."
}