{
    "address": "Department of Physics, University\n  of Rhode Island, Kingston RI 02881, USA} \n\\author{H.W.J. Bl\\\"ote }\n\\address{Faculty of Applied Sciences, Delft University, P.O. Box 5046,\\\\\n  2600 GA Delft, The Netherlands;} \n\\address{Lorentz Institute, Leiden University, Niels Bohrweg 2,\\\\\n  P.O. Box 9506, 2300 RA Leiden, The Netherlands} \\maketitle\n\n\\begin{abstract}\n  We investigate aspects of universality of Glauber critical\n  dynamics in two dimensions. We compute the critical exponent $z$ and\n  numerically corroborate its universality for three different models in\n  the static Ising\n  universality class and for five independent relaxation modes.  We\n  also present evidence for universality of amplitude ratios, which\n  shows that, as far as dynamic behavior is concerned, each model in a\n  given universality class is characterized by a single non-universal\n  metric factor which determines the overall time scale.  This paper\n  also discusses in detail the variational and projection methods that\n  are used to compute relaxation times with high accuracy.\n  \\vfill\n\\noindent\npacs {64.60.Ht, 02.70.Lq, 05.70.Jk, 64.60.Fr}\\\\\n\\end{abstract}\n\n\\section{introduction}\n\nCritical-point behavior is a manifestation of power-law divergences of\nthe correlation length and the correlation time. The power laws that\ndescribe the divergence of the correlation length on approach of the\ncritical point are expressed by means of critical exponents that are\ndependent on the {\\em direction} of this approach, which may, \\eg, be\nordering-field-like or temperature-like. The exponents describing the\nsingularities in {\\it thermodynamic} quantities can be expressed in\nterms of the same exponents.  In addition to the exponents defining\nthese power laws, another critical exponent, \\viz\\ the dynamic\nexponent $z$, is required\nfor the singularities in the {\\it dynamics}. This exponent $z$ is\ndefined by the relationship that holds between the correlation length\n$\\xi$ and the correlation time $\\tau$, namely $\\tau \\propto \\xi^z$.\n\nOne of the directions along which one can approach the critical\nsingularity is the finite-size direction, \\ie, one increases the system\nsize $L$ while keeping the independent thermodynamic variables at their\ninfinite-system critical values. In this case, $\\xi \\propto L$ so\nthat $\\tau \\propto L^z$. This relation has been used extensively to\nobtain the dynamic exponent $z$ from finite-size calculations.\n\nIn this paper we deal with universality of dynamic critical-point\nbehavior.  One would not expect systems in different static\nuniversality classes to have the same dynamic exponents, and even\nwithin the same static universality class, different dynamics may have\ndifferent exponents.  For instance, in the case of the Ising model,\nKawasaki dynamics which satisfies a local conservation law \\cite{KD}\nhas a larger value of $z$ than Glauber dynamics,\\cite{GD} in which\nsuch a conservation law is absent.  Also the introduction of nonlocal\nspin updates, as realized \\eg\\ in cluster algorithms, is known to lead\nto a different dynamic universal behavior.\\cite{SW,W,HB}\n\nConservation laws and nonlocal updates tend to have a large effect on\nthe numerical value of the dynamic exponents, but until fairly\nrecently, numerical resolution of the expected differences of dynamic\nexponents of systems in different static universality classes for dynamics\nwith local updates has been elusive.  This is caused by the difficulty\nof obtaining the required accuracy in estimates of the dynamic\ncritical exponent. Under these circumstances it is evident that only\na limited progress has been made with respect to the interesting\nquestions regarding dynamic universality classes.\n\nIn this paper we present a detailed exposition of a method of\ncomputing dynamic exponents with high\naccuracy.\\cite{NBdyn.prl.96,NBdyn.prl.97} We consider single spin-flip\nGlauber dynamics. This is defined by a Markov matrix, and computation\nof the correlation time is viewed here as an eigenvalue problem, since\ncorrelation times can be obtained from the subdominant eigenvalues\nof the Markov matrix.  \n\nIf a thermodynamic system is perturbed out of equilibrium, different\nthermodynamic quantities relax back at a different rates.  More\ngenerally, there are infinitely many independent relaxation modes for\na system in the thermodynamic limit.  Let us label the models within\na given universality class by means of $\\kappa$, and denote by\n$\\tau_{Li\\kappa}$ the autocorrelation time of relaxation mode $i$\nof a system of linear dimension $L$.  In this paper we\npresent strong numerical evidence that, as indeed renormalization\ngroup theory suggests, at criticality the relaxation times have the\nfollowing factorization property\n\\begin{equation}\n\\tau_{Li\\kappa} \\,\\approx\\, m_{\\kappa} A_i L^z,\n\\label{eq.factor.tau}\n\\end{equation}\nwhere $m_{\\kappa}$ is a {\\it non-universal} metric factor, which\ndiffers for different representatives of the same universality class\nas indicated; $A_i$ is a {\\it universal} amplitude which depends on\nthe mode $i$; and $z$ is the {\\it universal} dynamical exponent\nintroduced above.\n\nWhile the relaxation time of the slowest relaxation mode is obtained\nfrom the second-largest eigenvalue of the Markov matrix, lower-lying\neigenvalues yield the relaxation times of faster modes.  To compute\nthese we construct, employing a \\MC\\ method, variational approximants\nfor several eigenvectors. These approximants are called optimized\ntrial vectors.  The corresponding eigenvalues can then be estimated by\nevaluating with \\MC\\ techniques the overlap of these trial vectors and\nthe corresponding matrix elements of the Markov matrix in the truncated basis\nspanned by these optimized trial vectors.  It\nshould be noted that both the optimization scheme and the evaluation\nof these matrix elements critically depend on the fact that the Markov\nmatrix is sparse.  That is, the number of configurations accessible\nfrom any given configuration is equal to the number of sites only,\nrather than the number of possible spin configurations.\n\nGiven such fixed trial vectors, this approach has the advantage of\nsimplicity and high statistical accuracy, but the disadvantage is that\nresults are subject to systematic, variational errors, which only\nvanish in the ideal limit where the variational vectors become exact\neigenvectors, or span an invariant subspace of the Markov matrix. Since the\ncondition is rarely satisfied in cases of practical interest,\na projection Monte Carlo method is then used, to reduce the\nsystematic error, but this is at the expense of an increase of the\nstatistical errors. The methods we use in this paper is a combination\nand generalization of the work of Umrigar {\\it et\n  al.},\\cite{CyrusOptimization} and that of Ceperley and Bernu.\n\\cite{CeperleyBernu88}\n\nTo summarize, the \\MC\\ method discussed here consists of two phases.\nIn the first phase, trial vectors are optimized.  The ultimate, yet\nunattainable goal of this phase is to construct exact eigenvectors.\nIn this phase of the computation, very small \\MC\\ samples are used,\nconsisting typically of no more than a few thousand spin\nconfigurations.  In the second phase, one performs a standard \\MC\\ \ncomputation in which one reduces statistical errors by increasing the\nlength of the computation rather than the quality of the variational\napproximation.\n\nThe computed correlation times, derived from the partial solution of\nthe eigenvalue problem as sketched above, are used in a finite-size\nanalysis to compute the dynamic critical exponent $z$. We verify its\nuniversality for several models in the static universality class of\nthe two-dimensional Ising model. We also address another manifestation\nof dynamic universality. As was mentioned, in addition to the usual\nstatic critical exponents, there is only one new exponent that governs\nthe leading singularities of critical dynamics, \\viz., $z$.  Similarly,\none would expect that, within the context of Glauber\ndynamics, the description of time-dependent critical-point amplitudes\nrequires only a single non-universal metric factor to determine the\ntime-scale of each different model within a given universality class.\nOur results corroborate this idea, which is the immediate\ngeneralization to critical dynamics of work on static critical\nphenomena by Privman and Fisher.\\cite{Privman.Fisher.84",
    "author": "M. P. Nightingale"
}