{
    "affiliation": "lomar Observatory, Caltech 105--24, Pasadena, CA 91125}\n\n\\altaffiltext{1}{NSF Young Investigator}\n\\altaffiltext{2}{Packard Fellow}\n\n\\begin{abstract}\nIf high-redshift galaxies resemble rapidly star-forming galaxies\nin the local universe, most of the luminosity produced\nby their massive stars will have been absorbed by dust and\nre-radiated as far-infrared photons that cannot\nbe detected with existing facilities.\nThis paper examines what can be\nlearned about high-redshift star formation from the\nsmall fraction of high-redshift galaxies' luminosities\nthat is emitted at accessible wavelengths.  We first consider\nthe most basic ingredient in the analysis\nof high-redshift surveys: the estimation of star-formation\nrates for detected galaxies.  \nStandard techniques require an\nestimate of the bolometric luminosity produced\nby their massive stars. \nWe review and quantify empirical correlations between\nbolometric luminosities produced by star formation and the UV, mid-IR, sub-mm, and radio\nluminosities of galaxies in the local universe.\nThese correlations suggest that observations of high-redshift galaxies\nat any of these wavelengths should\nconstrain their star-formation rates to within $\\sim$ 0.2--0.3 dex.\nWe assemble the limited evidence that high-redshift\ngalaxies obey these locally calibrated correlations.\nThe second part of the paper assesses whether existing surveys\nhave found the galaxies that host the majority of star formation at high redshift\neven though they directly detect only a small fraction of the luminosities\nof individual galaxies.  We describe the characteristic\nluminosities and dust obscurations of galaxies at\n$z\\sim 0$, $z\\sim 1$, and $z\\sim 3$.  After discussing the relationship\nbetween the high-redshift populations selected in surveys\nat different wavelengths, we calculate the contribution\nto the $850\\mu$m background from each and argue that\nthese known galaxy populations\ncan together have produced the entire\nobserved background.  \nThe available data show that a correlation between\nstar-formation rate and dust obscuration $L_{\\rm bol,dust}/L_{\\rm UV}$\nexists at low and high redshift alike.  The existence of\nthis correlation plays a central role in the\nmajor conclusion of this paper:  most star formation\nat high redshift occurred in galaxies\nwith moderate dust obscurations $1\\simlt L_{\\rm bol,dust}/L_{\\rm UV}\\simlt 100$\nsimilar to those that host the majority of star formation in\nthe local universe and to those that are detected in UV-selected\nsurveys. \n\n\\end{abstract}\n\\keywords{galaxies: evolution --- galaxies: formation --- galaxies: starburst --- galaxies : dust}\n\\newpage\n\n\\section{INTRODUCTION",
    "author": "\\sc Kurt L. Adelberger and Charles C. Steidel\\altaffilmark{1,2}"
}