{
    "address": "%\n Graduate School of Human and Environment Studies, \\\\ \n Kyoto University, Kyoto  606-8501, Japan\n}\n\\author{%\n Kayoko Maeda\\footnote{E-mail:maeda@phys.h.kyoto-u.ac.jp}\n Jiro Soda\\footnote{E-mail:jiro@phys.h.kyoto-u.ac.jp}\n}\n\\address{\n Department of Fundamental Sciences, FIHS, Kyoto University,\\\\\n       Kyoto, 606-8501, Japan\n}\n\\abstract{\n  It appears difficult to construct a simple model\nfor an open universe based on the one bubble inflationary scenario.\nThe reason is that one needs a large mass to avoid the\ntunneling via the Hawking Moss solution and a small mass for successful \nslow-rolling. However, Rubakov and  Sibiryakov suggest that the \nHawking Moss solution is not a solution for the false vacuum decay \nprocess since it does not satisfy the boundary condition. \nHence, we have reconsidered the arguments for the defect of \nthe simple polynomial model. We find the valley bounce belonging\nto a valley line in the functional space represents the decay process\ninstead of the Hawking Moss solution. \nThe point is that the valley bounce gives the appropriate\ninitial condition for the inflation.\nWe show an open inflation model \ncan be constructed within the polynomial form of the potential so\nthat the fluctuations can be reconciled with the observations.\nDetails of the analysis can be seen in Ref.\\cite{KK}. }\n\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n\n\\section{Introduction}\n\\hspace{1cm}\n\nRecent observations suggest the matter density of the universe is \nless than the critical density. \nHence, it is desirable to have a model for an open universe, \nsay $\\Omega_0 \\sim 0.3$. The realization of an open universe is\ndifficult in the ordinary inflationary scenario. This is because\nif the universe expands enough to solve the horizon problem, \nthe universe becomes almost flat. One attempt to realize \nan open universe in the inflationary scenario is to consider inside \nthe bubble created by the false vacuum decay \\cite{Gott"
}