{
    "address": "Bartol Research Institute,\n        University of Delaware,\\\\\n        Newark, DE 19716, USA}%\n        \\thanks{Research supported in part by the U.S. Department\n            of Energy under Grant No. DE-FG02-91ER40626}}\n\n\\begin{document}\n\\begin{abstract}\nInterpretation and understanding of the evidence for neutrino\noscillations depends on knowledge of the atmospheric neutrino\nbeam.  In this talk I assess how well various features are known.\nThe goal is to determine to what extent uncertainties in the neutrino beam\nmay limit the conclusions about neutrino properties and\nwhich features of the evidence for neutrino oscillations\nare most robust.\n\\end{abstract}\n\n\\maketitle\n\n\\section{Introduction}\n\n\\begin{figure}[htb]\n\\flushleft{\\epsfig{figure=ayres84-2.eps,width=7cm}}\n\\caption{Illustration of up-down symmetry of atmospheric\nneutrinos in the absence of effects of the geomagnetic\nfield and assuming no oscillations.}\n\\label{fig:geometry}\n\\end{figure}\n\nThe concept of using the atmospheric neutrino beam to look for\nneutrino oscillations is illustrated in Fig. 1~\\cite{Ayresetal}.\nWith a single detector it is possible simultaneously to cover\na range of pathlengths from $\\sim10$ to $\\sim10^4$~km, corresponding\nrespectively to downward moving and upward moving neutrinos.\nThe atmospheric neutrino beam has an energy spectrum determined\nby the steeply falling primary cosmic-ray spectrum, which generates\nthe neutrinos by interactions\nof the cosmic ray nucleons in the atmosphere.\nExamples of calculated neutrino fluxes are shown in Fig. 2.\n\n\n\\noindent\n\\begin{figure}[htb]\n\\flushleft{\\epsfig{figure=compare_taup.ps,width=7.5cm}}\n\\caption{Fluxes of atmospheric neutrinos from two calculations:\nFLUKA~\\cite{Giuseppe3D}, dashed; Bartol~\\cite{AGLS}, solid.}\n\\label{fig:nufluxes}\n\\end{figure}\n\nThe neutrino spectrum, which falls with energy,\nmust be folded with the rising neutrino cross section\nto obtain the expected event rate as a function of neutrino energy.\nMost neutrino interactions are in the range from a few hundred MeV\nto a few tens of GeV.  Thus atmospheric neutrinos have the\npotential to probe the range $1 < L/E < 3\\times 10^4$~km/GeV.\nFrom the standard two-flavor oscillation equation,\n\\begin{equation}\nP_{\\nu_\\mu\\nu_\\mu",
    "title": "Atmospheric Neutrino Flux: A Review of Calculations"
}