{"29Banks˜M, et˜al. Gut 2019;0:1Œ31. doi:10.1136/gutjnl-2018-318126Guidelinesband imaging: a new optical sign for differentiating between adenoma and carcinoma. Gastrointest Endosc 2008;68:574Œ80. 154 Nakayama Y, Horiuchi A, Kumagai T, et al. Discrimination of normal gastric mucosa from Helicobacter pylori gastritis using standard endoscopes and a single observation site: studies in children and young adults. Helicobacter 2004;9:95Œ9. 155 Redéen S, Petersson F, Jönsson KA, et al. Relationship of gastroscopic features to histological ˚ndings in gastritis and Helicobacter pylori infection in a general population sample. Endoscopy 2003;35:946Œ50. 156 Kimura K, Takemoto T. An endoscopic recognition of the atrophic border and its signi˚cance in chronic gastritis. Endoscopy 1969;1:87Œ97. 157 Naylor GM, Gotoda T, Dixon M, et al. Why does Japan have a high incidence of gastric cancer? Comparison of gastritis between UK and Japanese patients. Gut 2006;55:1545Œ52. 158 Kono S, Gotoda T, Yoshida S, et al. Can endoscopic atrophy predict histological atrophy? Historical study in United Kingdom and Japan. World J Gastroenterol 2015;21:13113Œ23. 159 Nagata N, Shimbo T, Akiyama J, et al. Predictability of gastric intestinal metaplasia by mottled patchy erythema seen on endoscopy. Gastroenterology Res 2011;4:203Œ9. 160 Lim JH, Kim N, Lee HS, et al. Correlation between endoscopic and histological diagnoses of gastric intestinal metaplasia. Gut Liver 2013;7:41Œ50. 161 Panteris V, Nikolopoulou S, Lountou A, et al. Diagnostic capabilities of high-de˚nition white light endoscopy for the diagnosis of gastric intestinal metaplasia and correlation with histologic and clinical data. Eur J Gastroenterol Hepatol 2014;26:1Œ601. 162 Pimentel-Nunes P, Libânio D, Lage J, et al. A multicenter prospective study of the real-time use of narrow-band imaging in the diagnosis of premalignant gastric conditions and lesions. Endoscopy 2016;48:723Œ30. 163 Kikuste I, Stirna D, Liepniece-Karele I, et al. The accuracy of ˛exible spectral imaging colour enhancement for the diagnosis of gastric intestinal metaplasia: do we still need histology to select individuals at risk for adenocarcinoma? Eur J Gastroenterol Hepatol 2014;26:704Œ9. 164 Ang TL, Pittayanon R, Lau JY, et al. A multicenter randomized comparison between high-de˚nition white light endoscopy and narrow band imaging for detection of gastric lesions. Eur J Gastroenterol Hepatol 2015;27:1473Œ8. 165 Buxbaum JL, Hormozdi D, Dinis-Ribeiro M, et al. Narrow-band imaging versus white light versus mapping biopsy for gastric intestinal metaplasia: a prospective blinded trial. Gastrointest Endosc 2017;86:857Œ65. 166 Uedo N, Ishihara R, Iishi H, et al. A new method of diagnosing gastric intestinal metaplasia: narrow-band imaging with magnifying endoscopy. Endoscopy 2006;38:819Œ24. 167 An JK, Song GA, Kim GH, et al. Marginal turbid band and light blue crest, signs observed in magnifying narrow-band imaging endoscopy, are indicative of gastric intestinal metaplasia. BMC Gastroenterol 2012;12:169. 168 Kanemitsu T, Yao K, Nagahama T, et al. Extending magnifying NBI diagnosis of intestinal metaplasia in the stomach: the white opaque substance marker. Endoscopy 2017;49:529Œ35. 169 Wang L, Huang W, Du J, et al. Diagnostic yield of the light blue crest sign in gastric intestinal metaplasia: a meta-analysis. PLoS One 2014;9:e92874. 170 Eshmuratov A, Nah JC, Kim N, et al. The correlation of endoscopic and histological diagnosis of gastric atrophy. Dig Dis Sci 2010;55:1364Œ75. 171 Zhang Q, Wang F, Chen ZY, et al. Comparison of the diagnostic ef˚cacy of white light endoscopy and magnifying endoscopy with narrow band imaging for early gastric cancer: a meta-analysis. Gastric Cancer 2016;19:543Œ52. 172 Libânio D, Braga V, Ferraz S, et al. Prospective comparative study of endoscopic submucosal dissection and gastrectomy for early neoplastic lesions including patients™ perspectives. Endoscopy 2019;51:30Œ9. 173 Axon A. Symptoms and diagnosis of gastric cancer at early curable stage. Best Pract Res Clin Gastroenterol 2006;20:697Œ708. 174 Coda S, Lee SY, Gotoda T. Endoscopic mucosal resection and endoscopic submucosal dissection as treatments for early gastrointestinal cancers in Western countries. Gut Liver 2007;1:012Œ21. 175 Endoscopic Classi˚cation Review Group. Update on the Paris classi˚cation of super˚cial neoplastic lesions in the digestive tract. Endoscopy 2005;37:570Œ8. 176 Veitch AM, Uedo N, Yao K, et al. Optimizing early upper gastrointestinal cancer detection at endoscopy. Nat Rev Gastroenterol Hepatol 2015;12:660Œ7. 177 Lauwers GY. De˚ning the pathologic diagnosis of metaplasia, atrophy, dysplasia, and gastric adenocarcinoma. J Clin Gastroenterol 2003;36:S37Œ43. 178 Park DY, Srivastava A, Kim GH, et al. Adenomatous and foveolar gastric dysplasia: distinct patterns of mucin expression and background intestinal metaplasia. Am J Surg Pathol 2008;32:524Œ33. 179 Correa P, Haenszel W, Cuello C, et al. Gastric precancerous process in a high risk population: cohort follow-up. Cancer Res 1990;50:4737Œ40. 180 Uedo N, Iishi H, Tatsuta M, et al. Longterm outcomes after endoscopic mucosal resection for early gastric cancer. Gastric Cancer 2006;9:88Œ92. 181 Rokkas T, Filipe MI, Sladen GE. Detection of an increased incidence of early gastric cancer in patients with intestinal metaplasia type III who are closely followed up. Gut 1991;32:1110Œ3. 182 Whiting JL, Sigurdsson A, Rowlands DC, et al. The long term results of endoscopic surveillance of premalignant gastric lesions. Gut 2002;50:378Œ81. 183 den Hollander WJ, Holster IL, den Hoed CM, et al. Surveillance of premalignant gastric lesions: a multicentre prospective cohort study from low incidence regions. Gut 2019;68:585Œ93. 184 Yeh JM, Hur C, Kuntz KM, et al. Cost-effectiveness of treatment and endoscopic surveillance of precancerous lesions to prevent gastric cancer. Cancer 2010;116:2941Œ53. 185 Areia M, Dinis-Ribeiro M, Rocha Gonçalves F. Cost-utility analysis of endoscopic surveillance of patients with gastric premalignant conditions. Helicobacter 2014;19:425Œ36. 186 Zhou HJ, Dan YY, Naidoo N, et al. A cost-effectiveness analysis evaluating endoscopic surveillance for gastric cancer for populations with low to intermediate risk. PLoS One 2013;8:e83959. 187 Wu JT, Zhou J, Naidoo N, et al. Determining the cost-effectiveness of endoscopic surveillance for gastric cancer in patients with precancerous lesions. Asia Pac J Clin Oncol 2016;12:359Œ68. 188 Di Gregorio C, Morandi P, Fante R, et al. Gastric dysplasia. A follow-up study. Am J Gastroenterol 1993;88:1714Œ9. 189 Fertitta AM, Comin U, Terruzzi V, et al. Clinical signi˚cance of gastric dysplasia: a multicenter follow-up study. Gastrointestinal Endoscopic Pathology Study Group. Endoscopy 1993;25:265Œ8. 190 Yamada H, Ikegami M, Shimoda T, et al. Long-term follow-up study of gastric adenoma/dysplasia. Endoscopy 2004;36:390Œ6. 191 Rugge M, Cassaro M, Di Mario F, et al. The long term outcome of gastric non-invasive neoplasia. Gut 2003;52:1111Œ6. 192 Park SY, Jeon SW, Jung MK, et al. Long-term follow-up study of gastric intraepithelial neoplasias: progression from low-grade dysplasia to invasive carcinoma. Eur J Gastroenterol Hepatol 2008;20:966Œ70. 193 Kokkola A, Haapiainen R, Laxén F, et al. Risk of gastric carcinoma in patients with mucosal dysplasia associated with atrophic gastritis: a follow up study. J Clin Pathol 1996;49:979Œ84. 194 Rugge M, Farinati F, Baffa R, et al. Gastric epithelial dysplasia in the natural history of gastric cancer: a multicenter prospective follow-up study. Interdisciplinary Group on Gastric Epithelial Dysplasia. Gastroenterology 1994;107:1288Œ96. 195 Simone A, Casadei A, De Vergori E, et al. Rescue endoscopy to identify site of gastric dysplasia or carcinoma found at random biopsies. Dig Liver Dis 2011;43:721Œ5. 196 Abraham SC, Park SJ, Lee JH, et al. Genetic alterations in gastric adenomas of intestinal and foveolar phenotypes. Mod Pathol 2003;16:786Œ95. 197 Zhao G, Xue M, Hu Y, et al. How commonly is the diagnosis of gastric low grade dysplasia upgraded following endoscopic resection? A meta-analysis. PLoS One 2015;10:e0132699. 198 Kim YJ, Park JC, Kim JH, et al. Histologic diagnosis based on forceps biopsy is not adequate for determining endoscopic treatment of gastric adenomatous lesions. Endoscopy 2010;42:620Œ6. 199 Nam KW, Song KS, Lee HY, et al. Spectrum of ˚nal pathological diagnosis of gastric adenoma after endoscopic resection. World J Gastroenterol 2011;17:5177Œ83. 200 Jeon HK, Ryu HY, Cho MY, et al. A randomized trial to determine the diagnostic accuracy of conventional vs. jumbo forceps biopsy of gastric epithelial neoplasias before endoscopic submucosal dissection; open-label study. Gastric Cancer 2014;17:661Œ8. 201 Goo JJ, Choi CW, Kang DH, et al. Risk factors associated with diagnostic discrepancy of gastric inde˚nite neoplasia: who need en bloc resection? Surg Endosc 2015;29:3761Œ7. 202 Raftopoulos SC, Kumarasinghe P, de Boer B, et al. Gastric intraepithelial neoplasia in a Western population. Eur J Gastroenterol Hepatol 2012;24:48Œ54. 203 Pimentel-Nunes P, Mourão F, Veloso N, et al. Long-term follow-up after endoscopic resection of gastric super˚cial neoplastic lesions in Portugal. Endoscopy 2014;46:933Œ40. 204 Pyo JH, Lee H, Min BH, et al. Long-term outcome of endoscopic resection vs. surgery for early gastric cancer: a non-inferiority-matched cohort study. Am J Gastroenterol 2016;111:240Œ9. 205 Kosaka T, Endo M, Toya Y, et al. Long-term outcomes of endoscopic submucosal dissection for early gastric cancer: a single-center retrospective study. Dig Endosc 2014;26:183Œ91. 206 Kato M, Nishida T, Yamamoto K, et al. Scheduled endoscopic surveillance controls secondary cancer after curative endoscopic resection for early gastric cancer: a multicentre retrospective cohort study by Osaka University ESD study group. Gut 2013;62:1425Œ32. 207 Horiki N, Omata F, Uemura M, et al. Risk for local recurrence of early gastric cancer treated with piecemeal endoscopic mucosal resection during a 10-year follow-up period. Surg Endosc 2012;26:72Œ8. 208 Ahn JY, Jung HY, Choi JY, et al. Natural course of noncurative endoscopic resection of differentiated early gastric cancer. Endoscopy 2012;44:1114Œ20. 209 Oda I, Gotoda T, Sasako M, et al. Treatment strategy after non-curative endoscopic resection of early gastric cancer. Br J Surg 2008;95:1495Œ500.copyright. on February 5, 2020 at Genentech Inc Att Library Mailstop 12. Protected byhttp://gut.bmj.com/Gut: first published as 10.1136/gutjnl-2018-318126 on 5 July 2019. Downloaded from ":0}