{"www.wjgnet.comUltrasound elastographyARFI imaging is a new tissue strain imaging technology stiffness properties of tissues. Virtual Touch tissue imaging and Virtual Touch AG, Germany) are the first available applications to implement this technology. Unlike conventional B-mode sonography, which provides anatomical details based on differences in acoustic impedance, Virtual Touch imaging describes relative physical tissue stiffness properties. In complement, Virtual TouchŽ tissue quantification provides accurate numerical measurements related to Conventional elastography, however, requires manual compression of the tissues in order to provide relative displacement between the mass and the surrounding structures and therefore an assessment of strain. This of the presence of the ribs and abdominal wall. ARFI -sion. Using the Virtual Touch application, the tissue is compressed by acoustic energy. Virtual Touch tissue -ness, through measurement of shear wave speed. Shear waves are generated by displacement of tissue and at-tenuate approximately 10 000 times more rapidly than conventional ultrasound waves. Prior to liver biopsy, the patients underwent liver ultrasonographic elastography, under fasting conditions, using ARFI imaging [Acuson S2000 (Siemens AG, Germany] with Virtual Touch tissue quantification software). The system uses a standard ultrasonographic probe and offers elastography with a flexible metering box of 1 cm at variable depths. An acoustic push pulse induces an elastic shear wave that propagates through the tissue. The propagation of the shear wave is followed by detection pulses that are used to measure the velocity of shear wave propagation, which is directly related to tissue stiffness: speed increases with stiffness. Liver stiffness was assessed by the same physician blinded to clinical and biological data. The measurements were performed on the right lobe of the liver through the intercostal spaces, with the patient lying in the decubitus dorsal position, with the right hand under the head and the head turned toward the left. The tip of the probe was covered with coupling gel and placed on the skin between the ribs at the level of the right lobe of the liver. The operator positioned the probe over the area of interest: segment eight of the right lobe, away from motion and portal/hepatic vessels, about 2 cm from the liver capsula, at a depth between 3.8 and 5.5 cm. When B-mode image, the operator pressed the button Virtual breathing for a moment. Then, we observed the velocity of shear wave on screen. We used this protocol because we saw that, when the right lobe was scanned through the intercostal spaces with normal breathing, the variance of measurement was low. A total of 12 valid measurements per patient were performed. In difficult patients, to obtain better access to the liver without excessive pushing or breath holding, the measurements were performed on patients lying in the left lateral decubitus position, or using a subcostal approach to the left lobe. The results of ARFI ultrasonographic elastography were expressed as liver propagation velocity (m/s). The success rate of liver elasticity measurements was calculated as the ratio between validated and total measurements. Results were expressed as the median value of the total measurements (12 measurements per patient) in m/s, with values ranging of at least 60%, and with the interquartile range of all validated measurements < 30% of the median value, were considered reliable.Histological assessmentPercutaneous liver biopsy was performed by senior Germany). After biopsy, the liver samples were fixed in formalin, paraffin embedded, and stained with to the biological and clinical data and to the results of ultrasound elastography. The length of each liver biopsy was established in millimeters and the number of portal tracts was counted. Liver fibrosis and necroinflammatory activity were staged on a four-point scale according to this score: F0 activity was also graded on a four point scale: A0, none; A1, mild; A2, moderate; A3, severe.Steatosis was assessed according to the number of hepatocytes with degeneration, as follows: 0, none; 1, steatosis in 1%-10% of hepatocytes; 2, steatosis in 11%-33% of hepatocytes[3].Statistical analysisResults are presented as the mean ± SD, counts and percentages. The results are illustrated as the median and 25th- to 75th-percentile values. The correlation between the noninvasive tests and liver biopsy was tested using the overall validity was measured using area under the receiver Cutoff values that defined prediction regions for each fibrosis  the sum of the sensitivities in predicting the single stages. and positive (PPV) and negative predictive value (NPV) were calculated. The optimal cutoff was chosen at the was achieved at P < 0.05. Fierbinteanu-Braticevici C et al                                                         5527":0}