{"www.wjgnet.comOnline Submissions: wjg.wjgnet.com                              World J Gastroenterol  2009 November 28; 15(44): 5525-5532wjg@wjgnet.com                                                        World Journal of Gastroenterology  ISSN 1007-9327doi:10.3748/wjg.15.5525                                                                                          © 2009 The WJG Press and Baishideng. All rights reserved. ORIGINAL ARTICLES ORIGINAL ARTICLEAcoustic radiation force imaging sonoelastography for Carmen Fierbinteanu-Braticevici, Dan Andronescu, Radu Usvat, Dragos Cretoiu, Cristian Baicus, Gabriela MarinoschiCarmen Fierbinteanu-Braticevici, Dan Andronescu, Radu Usvat, Medical Clinic ˛Ÿ and Gastroenterology, University Hospital, 050094 Bucharest, RomaniaDragos Cretoiu, Department of Cellular and Molecular Medicine, ﬁCarol Davilaﬂ University of Medicine and Pharmacy, 050094 Bucharest, RomaniaCristian Baicus, Department of Internal Medicine and Réseau d™Epidémiologie Clinique International Francophone (RECIF), Colentina Hospital, 020125 Bucharest, RomaniaGabriela Marinoschi, Institute of Mathematical Statistics and Applied Mathematics, 050711 Bucharest, RomaniaAuthor contributions: Fierbinteanu-Braticevici C supervised the whole study and edited the manuscript; Andronescu D and Usvat R collected the data and reviewed the manuscript; Cretoiu D completed the searches; Baicus C performed the statistical analysis and reviewed the manuscript; Marinoschi G participated in the statistical analysis.Supported byEducation and ResearchCorrespondence to: Carmen Fierbinteanu-Braticevici, Associate Professor, Medical Clinic ˛Ÿ and Gastroenterology, University Hospital, Splaiul Independentei 169, 050094 Bucharest, Telephone: +40-21-3180571  Fax: +40-21-3180571Received: August 12, 2009     Revised: September 14, 2009Accepted: September 21, 2009Published online: November 28, 2009AbstractAIM: To investigate the diagnostic accuracy of acoustic radiation force impulse (ARFI) imaging as a in chronic hepatitis C (CHC) patients.METHODS: We performed a prospective blind com-parison of ARFI elastography, APRI index and FibroMax in a consecutive series of patients who underwent liver biopsy for CHC in University Hospital Bucharest. His-METAVIR scoring system served as the reference. A to-tal of 74 patients underwent ARFI elastography, APRI index, FibroMax and successful liver biopsy. RESULTS: The noninvasive tests had a good correlation with the liver biopsy results. The most powerful test in predicting fibrosis was ARFI elastography. The diagnostic accuracy of ARFI elastography, expressed as area under receiver operating characteristic curve (AUROC) had a validity of 90.2% (95% CI AUROC = 0.831-0.972, P 2). ARFI sonoelastography predicted even better F3 or F4 fibrosis (AUROC = 0.993, 95% CI = 0.979-1).CONCLUSION: ARFI elastography had very good superior to other noninvasive methods (APRI Index, © 2009 The WJG Press and Baishideng. All rights reserved.Key words: Elasticity imaging techniques; Hepatitis C; Peer reviewers: Giovanni Tarantino, MD, Professor, Department of Clinical and Experimental Medicine, Federico II University Medical School, Via S. Pansini, 5, Naples 80131, Italy; Dr. Ching-Chung Lin, Gastroenterology Division, Mackay Memorial Hospital, 5F, No 28, Lane 286, Shidong Road, 11154 Taipei, Taiwan, ChinaFierbinteanu-Braticevici C, Andronescu D, Usvat R, Cretoiu D, Baicus C, Marinoschi G. Acoustic radiation force imaging World J Gastroenterol 2009; 15(44): 5525-5532  Available from: URL: http://www.wjgnet.com/1007-9327/15/5525.asp  DOI: http://dx.doi.org/10.3748/wjg.15.5525INTRODUCTIONThe prognosis and clinical management of chronic liver diseases are highly dependent on the extent of liver fibrosis. This is particularly true in patients with chronic hepatitis C (CHC), which is the leading cause of cirrhosis in many countries. CHC progresses to cirrhosis through a sequence of morphological changes that [1]. Staging systems of varying complexity based on these morphological changes have been used in patient management as a guide to prognosis, and in clinical investigations as an estimate of natural history and response to therapy. ":0}