{" 662Child Development stress, especially during adolescence when interper-sonal roles and expectations undergo signiÞcant re-deÞnition and disruption (see Greene & Larson, 1991;Fenzel & Blyth, 1986). Because adolescent girls maybe more invested than boys in their relationships as asource of emotional support and, perhaps, personalidentity, interpersonal stress may be more salient andmay act as a stronger threat to their well-being.Indeed, research demonstrates that the rise in inti-macy within adolescent friendships may be matchedby a  decline  in perceived support and satisfaction(Clark-Lempers, Lempers, & Ho, 1991). Furthermore,adolescents become increasingly sensitive to the po-tential costs of interpersonal conßict. Girls have beenfound to be particularly aware of the threat of conßictto friendships, and this gender difference intensiÞeswith age (reviewed in Laursen, 1996). This sensitivitymay represent both an asset and a liability for adoles-cent girls: On the one hand, heightened concern maystimulate greater motivation to minimize or to effec-tively manage conßict; on the other hand, heightenedconcern may stimulate higher levels of stress whenconßict does occur. Conßict with parents also risesduring adolescence (reviewed in Laursen, 1996). Again,particularly high levels of conßict may be expectedbetween adolescent girls and their parents. Althoughgirls report more emotional autonomy from parentsthan do boys during adolescence (Steinberg & Silver-berg, 1986), these perceptions may clash with paren-tal tendencies to employ higher levels of control in theabsence of autonomy-granting behavior with girlsthan with boys (Pomerantz & Ruble, 1998). This dis-crepancy between girlsÕ levels of perceived and actualautonomy is likely to generate tension in the parent-child relationship.This general picture from the close relationshipsliterature of adolescence as a vulnerable period forgirls, due in part to gender and age differences in thenature of interpersonal relations, is mirrored by a lim-ited data base on domain-speciÞc life stress. For ex-ample, Larson and Ham (1993) reported that girlsexperienced more negative friend events, whereasboys experienced more negative school-related events.Adolescents experienced an increased incidence ofevents in all of the measured domainsÑfamily, peer,school, and otherÑin comparison to preadolescents(Larson & Ham, 1993). However, adolescent females,in particular, have been found to report signiÞcantlymore negative interpersonal events than adolescentmales, to perceive these events as more stressful(Wagner & Compas, 1990), and to be more vulnerableto stress in the peer and family contexts (Greene &Larson, 1991). These Þndings point to the importanceof considering gender and age  interactions  in levels oflife stress within certain social contexts. Finally, nega-tive mood states in girls tend to be linked to experi-ences within interpersonal domains, such as thefamily and peer group, whereas negative moodstates in boys tend to be linked to activity-based ex-periences (e.g., competitive games); this gender dis-parity is ampliÞed during adolescence (Larson &Asmussen, 1991).To summarize, past research has characterized ad-olescence as a time of intensiÞed stress and challenge.Such environmental risks appear to be most salientfor adolescent females, especially within the interper-sonal domain. However, preliminary evidence sug-gests that boys may experience higher levels of stressin noninterpersonal domains, such as the school set-ting or nonschool activities. Thus, previous studiesthat have used composite measures of stress and thathave indicated higher stress levels only in adolescentgirls may be somewhat misleading. To identifywhether distinct  patterns  of stress occur in girls versusboys and in preadolescents versus adolescents, wedifferentiated among levels of stress within multiplelife domains, with a focus on the comparison of inter-personal and noninterpersonal stressors. Stress Reactions: Vulnerability to Depressive Outcomes Our third goal was to examine age and gender dif-ferences in stress reactions, or the consequences ofstress. In particular, a growing body of research hasrevealed an association between life stress and de-pression in youth (reviewed in Compas, Grant, & Ey,1994; Garber & Hilsman, 1992). The experience ofstressful life events may contribute to depressive out-comes through several pathways. Exposure to mul-tiple  independent , or uncontrollable, stressors may leadto decreased perceptions of control over the environ-ment and a sense of hopelessness about the future,which have been linked to child depression (Mc-Cauley, Mitchell, Burke, & Moss, 1988; Weisz,Sweeney, ProfÞtt, & Carr, 1994). Generation of  depen-dent  stressors, to the extent that children are aware ofand take responsibility for their own contribution tothe events, may lead to maladaptive self-evaluativeprocesses, such as a negative attributional style or de-creased perceptions of competence, which in turnmay increase risk for depression (e.g., Nolen-Hoek-sema, Girgus, & Seligman, 1992; Robinson, Garber,& Hilsman, 1995). For example, Cole and Turner(1993) have obtained support for a model whereinmaladaptive cognitions about the self mediate thelink between negative environmental events and de-pressive symptoms.":0}