{"Rudolph and Hammen673whereas adolescent boys were more likely than pre-adolescent boys to experience noninterpersonal stress.These patterns were consistent with other evidence ofinterpersonal stress as an area of particular sensitivityfor adolescent girls (Greene & Larson, 1991; Wagner &Compas, 1990), and further indicated that noninterper-sonal stress may be an area of particular sensitivity foradolescent boys. However, it should be noted that themethodology and clinic-referred sample used herewere quite distinct from prior research; thus, resultscannot be generalized without further study, particu-larly given the fairly modest sample size.Thus, these data conÞrmed that the examination ofglobal stress levels may obscure context-speciÞc ageand gender differences. Furthermore, incorporating atransactional perspective unveiled even more intri-cate age- and gender-related conÞgurations of stress,thereby reinforcing the critical distinction between in-dependent and dependent life events. First, the lackof association between these two types of events val-idated them as discrete sources of stress. Second, ageand gender differences varied across these two typesof events. As predicted, adolescent girls were particu-larly prone to dependent interpersonal stress, and ad-olescent boys were particularly prone to dependentnoninterpersonal stress. In contrast, age and genderinteractions were not found to differ across context,when measured globally, for independent stress.These Þndings suggest that context- and gender-speciÞc experiences of life stress during adolescencemay be accounted for in part by stress that is gener-ated by youngsters.These distinctive life stress proÞles were clariÞedfurther when speciÞc domains of independent anddependent interpersonal stress were considered.Consistent with predictions, preadolescent girls wereexposed to the highest levels of independent familystress and family conßict, whereas adolescent girlsgenerated the highest levels of dependent parent-childstress and parent-child conßict. Adolescent girls alsoexperienced the highest levels of independent anddependent peer stress and conßict. The opposite pat-tern emerged for gender differences in noninterper-sonal stress. As anticipated, boys were exposed tohigher levels of independent noninterpersonal stressthan were girls, and, as noted above, adolescent boyswere at the highest risk for the generation of dependentnoninterpersonal stressors.The discrepancy between the current Þndings andthose based on aggregate stress levels, which consis-tently have revealed elevated stress in adolescentgirls, underscores the importance of examining domain-speciÞc indexes of both independent and dependentstress. Clearly, a contextual approach to developmentnot only must account for the generic inßuence of en-vironmental stress on youngsters, but also must takeinto account individual variations in the experienceof speciÞc types of stress. In particular, the distinctionbetween interpersonal and noninterpersonal stres-sors appears to be pivotal to the delineation of ageand gender differences in both stress exposure andstress generation.Our Þndings also have implications for develop-mental theory and research on the evolution of closerelationships. Results bore a striking resemblance tothose that have emerged from prior investigations ofage and gender differences in the nature of interper-sonal relations. For example, Þndings of increased ex-posure to independent family stress in preadolescentgirls and to independent peer stress in adolescentgirls were consistent with well-documented develop-mental trajectories reßecting an ascendance of thepeer group as a context for activity and socializationduring adolescence (Burke & Weir, 1978; Steinberg &Silverberg, 1986). Although a higher level of familyinvolvement may be expected in preadolescents, wehypothesized that tension associated with a growingdesire for autonomy from parental inßuence maylead adolescent girls to generate more stress and con-ßict within parent-child relationships. Indeed, thisseemed to be the case. Moreover, the prevalence ofdependent peer stress and conßict in adolescent girlsmeshed with research indicating greater difÞcultiesin the peer relationships of adolescent females than inthose of adolescent males or preadolescents (Compaset al., 1986; Greene & Larson, 1991).Beyond these commonalities, the present study ex-pands prior work on close relationships. Previous in-vestigations have relied on youngstersÕ global per-ceptions of various parameters of family and peerrelationships, such as closeness, intimacy, and conßict(e.g., Furman & Buhrmester, 1992; Steinberg & Silver-berg, 1986). In contrast, this study provides a windowonto identiÞable day-to-day events that likely serveas the basis for more generalized reports about rela-tionships. Similarly, our assessment of noninterper-sonal events provides information about signiÞcantoccurrences in the daily lives of youngsters outside ofthe social sphere. The parallelism between our resultsand those obtained in community samples suggeststhat similar patterns of age and gender differenceshold at quite severe levels of stress.Stress Reactions: Vulnerability to Depressive OutcomesThis study also yielded data regarding the implica-tions of stress for youngstersÕ adjustment. As pre-":1}