{"               International Journal of Communication and Computer Technologies Volume 04 No. 1 Issue: 02 April 2016   ISSN NUMBER : 2278-9723                                                                                                                                 Volume 04  No.4 Issue: 02                                                                Page 4021                                                    International Journal of Communication and Computer Technologies                               www.ijccts.org   De-noising. Then it uses the pre-processed signal to extract features from the ECG signal automatically. The ECG signals for the present study are collected from MIT/BIH database via Physionet database and stored in a text format. The MIT-BIH database contains different types of Electrocardiogram signals including both abnormal Electrocardiograms and normal Electrocardiograms, which are sampled at different rates. To process all the signals uniquely, all the samples must be resampled at 360 Hz before processing the ECG signal. Each selected ECG signal is of 30 minute duration, but only10  duration of the signal is used for processing in this present study. II. DISCRETE WAVELET TRANSFORMATION (DWT) Generally Signals can be analyzed by using Fourier Transformation; the signal breaks point into constituent sinusoids of different frequencies. It transforms the signal from time signal to frequency signal. For many signals in Fourier Transform is extremely useful because the signals frequency content is of very important. But the serious drawback with this approach is in transforming to frequency domain, the time information is lost. So, it is not possible to tell when a particular event occurred through this approach. This drawback can be overcome by using Short Time Fourier Transformation (STFT) [3]. In a Short Time Fourier Transformation a signal is mapped in both frequency and time dimensions using a technique called Windowing. Though the time and frequency information is obtained at a time using this approach, it has a drawback that the size of the time window must be fixed for all frequencies. To overcome this drawback a most commonly used method called Wavelet Transformation is used where it has a time window of variable size.      Figure 3: actual sigal using ECG  A Wave is an oscillating function of time or space, Wavelets are localized waves and they have their energy concentrated in time or space. The Transform of a signal is another form of representing the signal. It does not change the information content present in the signal. The Wavelet Transform provides a time- frequency representation of the signal and is well suited to the analysis of nonstationary signals such as ECG[4]. A Wavelet Transformation uses multi resolution technique by which different frequencies are analyzed with different resolutions. A Wavelet Transform, at high frequencies, gives good time resolution and poor frequency resolution, while at low frequencies the Wavelet Transform gives good frequency resolution and poor time resolutions. One of the most frequently and commonly used Wavelet Transformation is the Discrete Wavelet Transformation (DWT). The discretization of Continuous Wavelet Transform is called as Discrete Wavelet Transform (DWT). The Discrete Wavelet Transform employs a dyadic grid (integer power of two scaling in a and b), orthonormal wavelet basis functions and exhibits zero redundancy. Where Tm,n is known as the wavelet (or detail) coefficient at scale and location indices. Multi-Resolution Analysis using Filter Banks Theory: Filters are one of the most widely used signal processing functions. Wavelets can be realized by iteration of filters with rescaling. The resolution of the signal, which is a measure of the amount of detail information in the signal, is determined by the filtering operations and the scale is determined by up sampling and down sampling (subsampling) operations.  The Discrete Wavelet Transform of a signal can be computed by passing it through the low pass and high pass filters as shown in figure 2. This is called the Mallat algorithm or Mallat-tree decomposition. In figure 2, X[n] represents the original signal to be filtered, where n is an integer, G0 represents the low pass filer and H0 represents the high pass filter. At each level, the high pass filters produces detail information, d[n], while the low pass filters associated with scaling function produces coarse approximations, a[n].   Figure 2: Three-level Wavelet Decomposition Tree  With this approach, the time resolution becomes arbitrary good at high frequencies, while the frequency resolution becomes arbitrary good at low frequencies. The filtering the decimation process is continued until the desired level is reached[5]. The maximum number of levels depends on the length of the signal. The DWT of the original signal is then obtained by concatenating all the coefficients, a[n] and d[n], starting from the last level of       Figure 4: Three-level Wavelet Reconstruction Tree  Figure 3 shows the reconstruction of the original signal from wavelet coefficients. Basically, the reconstruction is the reverse process of decomposition. The approximation and detail coefficients at every level are up sampled by two, passed through the low pass and high pass synthesis filters and ":1}