{"European Aviation Environmental Report 100 ,  24 www.eurocontrol.int/service/operatorairframe-data 25 ec.europa.eu/eurostat/data/database26 www.eurocontrol.int/statfor 27 www.eurocontrol.int/articles/challenges-growth This appendix provides an overview of the data sources, models and assumptions used to develop the information presented in Chapter  (Overview of Aviation Sector) and Chapter  (Technology and Design). These modelling capabilities have been developed and used to support various European initiatives, including SESAR and Clean Sky, as well as international policy assessments in ICAO CAEP.ScopeThe information in this report covers alhts from or to airports in the European Union (EU) and European Free Trade Association (EFTA). For consistency, regardless of the year, the EU here consists of the  member States: Austria, Belgium, Bulgaria, Croatia, Republic of Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and the United Kingdom. EFTA members are Iceland, Liechtenstein, Norway and Switzerland.Data sourcesPRISMEHistorical -ht operations were extracted from the EUROCONTROL database oeht plans called PRISME. PRISME covers all Instrument Flight Rulights in Europe. Flight data are enriched with and validated against, for example, radar updates, billing data from the Central Route Charges Oce and an internal database of global aircraft (PRISME Fleet).EurostatEuropean States collect statistics on air transport from their airports and airlines and provide these to Eurostat, which makes them public, although airline details are treated as condential. Statistics on total activity (total passengers, total tonnes shipped, etc.) are as complete as possible. More detailed statistics, such as passengers and available seats for individual airport pairs, are focused on majows. For example, we use these data to indicate trends in load factors, but we cannot calculate total available seat-kilometres solely from them. The estimates of total passenger kilometrewn in Chapter  are based on Eurostat directly, on analysis of other Eurostatows and on data from PRISME. The great circle (i.e. shortest) distance between airport pairs is used when reporting passenger kilometres, while the actualown distance is used when calculating the average fuel consumption.STATFORThe EUROCONTROL STATFOR -year forecast that was published in  provided the trac volumes from  to  used in this report. In this report, we focused on three of the four forecast scenarios: Regulation & Growth is the most-likely or base; Global Growth gives the high; and Fragmenting World gives the low. The forecast was prepared as part of the Challenges of Growth  study.  airports provided future capacity plans to this study, and the forecast trac respects the capacity constraints implied by these plans.":1}