{"Accounting Manager:  Essential functions of this position, which may change or evolve in the future, are, but not limited to, the following: Under the direction of the Director of Accounting, plan, organize, direct, supervise and evaluate District accounting, evaluate and adjust the accounting processes and procedures as necessary; conduct accounting analyses, prepare financial statements and conduct audits of all District funds, accounts and procedures; and provide complex staff assistance to the Assistant Superintendent, Business Services.   SUPERVISION RECEIVED AND EXERCISED:   Receives administrative direction from the Director of Accounting. Exercises direct supervision over professional, technical and clerical staff. Recommends goals and objectives; assists in the development of policies and procedures.   Examples Of Duties/ Essential Functions:  Plan, organize and direct the work of the accounting department including departmental preparation and proper disbursement of all funds.  Help develop, maintain and audit internal controls to assure district assets are protected  Maintain District financial records as required by law, Board Policy, administrative directives, and regulations of County, State, and Federal agencies.   Direct modification and updating of the accounting system in conjunction with the use of computerized data processing services as needed  Supervise and directs procedures for collection of fees and revenues   Supervise treasury functions including receipt, custody and deposit of monies  Develop an effective organizational structure for the Accounting Department and recommends modifications which will result in better business services   Evaluates on a continuing basis the business services of the District, supervises the development of long and short-range plans for the Accounting Department   Provides for the timely filing of financial reports required of the District   Conducts in-service training of business office personnel and school site personnel.  Evaluate and provide for accounting procedures to comply with District, County, State, and Federal regulations, as required.  Responsible for receipt and custody of District funds as required by law, Board Policy, and regulations of the County, State, and Federal agencies  Responsible for coordination of the annual audit of the District's books  ":0}