{"INTERNATIONAL JOURNAL OF SCIENTIFIC & TECHNOLOGY RESEARCH VOLUME 8, ISSUE 11, NOVEMBER 2019       ISSN 2277-8616                     3692 IJSTR©2019 www.ijstr.org  Feature Selection:- Apply Relief Attribute Eval feature selection algorithm that the most significant attributes. Relief tests the worth of a feature or an attribute by sampling an instance repeatedly and considering the value of the given attribute for the nearest instance of the same and different class.  Apply 10-fold cross validation on the dataset.  Apply regression algorithms: Apply the regression algorithms on the dataset to calculate the accuracy of the disease.  Comparison: Compare the error of the different regression Algorithms to find the best algorithm.  5 EXPERIMENTAL & RESULT ANALYSIS In this segment to loading the dataset of Malnutrition of different patients of cities of Madhya Pradesh. All the dataset is loaded in WEKA 3.8 toolkit software to analysis the regression model. We store the data in Ms-excel 10 text file format. In addition to the native ARFF data file format, WEKA loaded successfully we save ARFF format. In this analysis the data set consist of the parameters like.   Figure 2. Data set View  Initially (in the Pre-process table) click open and navigate to the directory containing the data file(.cvs or .arff). in this way we will open the above dataset of  Malnutrition in dataset file. This is shown in fig. 3 .   Figure 3. List of recognized attributes  Linear Regression It is a probabilistic model and in which each feature is independent from others. In that particular testing Linear Regression better result from all of the other techniques The following steps are followed to perform Linear Regression on the HRV dataset- 1. Firstly open the WEKA GUI application. 2.  3. Load the Malnutrition data set from dataset.csv file. 4.  5. Then click the  6. After then click on the name of the algorithm to review the algorithm configuration. 7. Select Cross-validation folds to 10 and start the algorithm on the dataset.   Figure 4. Linear Regression Output percentage outcomes      ":0}