{"INTERNATIONAL JOURNAL OF SCIENTIFIC & TECHNOLOGY RESEARCH VOLUME 8, ISSUE 11, NOVEMBER 2019       ISSN 2277-8616                     3690 IJSTR©2019 www.ijstr.org Predicting  Malnutrition Disease Using Various Machine Learning Algorithms   Rahamuddin Khan, Manish Ahirwar, Piyush kumar shukla  Abstract: Healthcare evaluates clinical datasets regularly by specialist's learning and action. In the clinical field, computer-supported with prediction system is used in the healthcare department. Malnutrition is a situation that comes by eating a diet in which one or more nutrients are in imbalance or are too much such that the food causes health related problems. It may involve carbohydrates, vitamins or minerals proteins, calorie. Malnutrition can lead to complications such as gastroenteritis, pneumonia, malaria, and measles. Enhanced predictive analysis for malnutrition disease using regression algorithms is a confronted task to help doctors for diagnosing the malnutrition patients. In this paper the work sets out to make comparative evaluation of classifiers for achieving higher classification accuracy using WEKA tool and at last, the result is obtained. The experiment results shown are about prediction accuracy, precision, recall and ROC curve. The results in this work on Malnutrition dataset show that processing efficiency and prediction accuracy of linear regression is better than that of, k-nearest neighbor, decision tree, and multilayer perceptron regression algorithms.   Keywords: malnutrition, healthcare, machine learning, prediction, linear regression, decision tree, KNN, multilayer perceptron.   1. INTRODUCTION Health care is the preservation or development of health via avoiding, diagnosis, and medical care of diseases, sickness, injury, and other physical and mental debilitate in human being. These days, the malnutrition ailments are a standout amongst the most real issue looked by our society.[1] The quantity of patients with undernourishment or over nutrition illnesses developing step by step however never decreases. In addition, this sort of maladies causes in excess of 500,000 passings in India every year and is presently the main foundation of death in India. Currently, healthcare domain is to offer better for people 24*7 throughout the world in a more beneficial and in a very friendly or convenient way. Unfortunately millions of people sustain from various Malnutrition diseases, and Malnutrition is the primary cause of Death in the world and increasing of diseases mainly due to the negligence of their health because they don't have time for themselves and forget about their health protection due to a massive workload.[2].Our period have been seeing excess of immedicable and grim medical problems. With the expediently developing requirement for auspicious therapeutic office, the customary strategy for treatment at the centre or clinic all the more regularly misses the mark in bringing out achievement in numerous crisis cases.[3]. That implies the physical position of patients ought to be observed by doctors or medicinal consideration, who will then choose when to convey human services office dependent on patients' continuous condition. The substantive job of this inescapable human services mode is the continuous observing framework [4]. With the advancement in connected science, heaps of savvy or therapeutic sensors appeared that ceaselessly examinations   singular patient movement and naturally predicts a hrv assault. In the medicinal territory, these days quiet take dynamic job in accumulating and looking into their report [5].  2 LITERATURE REVIEW Tanhim Islam, Tanjir Alam Chisty, Prova Roy.et al. during this paper, Bangladesh has the very best rate of deficiency disease round the world. over nine.5 million kids suffer from deficiency disease and 50 to 60 % of girls in Asian country have less BMI. deficiency disease in kids, adolescents and girls could be a major concern. what is more, health professional human shows tolerance to produce care resolution in a very remote location or in rural areas. For the aim of determination this drawback, we have a tendency to build autonomous automaton that interacts and communicates with humans which might queries and answers concerning care queries showing intelligence, will acknowledge food and shows essential food nutrients singly and supply nutrition set up, health report separately.Jorge Ribeiro , David Ribeiro et al., Malnutrition is understood to be a significant concern among older adults. whether or not is it as a result of social-economic reasons or low nutritionary data, older adults generally struggle to possess healthy, varied, and reasonable diet. There are already some solutions within the market that guide them towards additional healthy uptake ones. However, such solutions don't address the actual wants of older adults or are restricted in scope. Bambang Lareno, Liliana Swastina precise time is early indication of kid nutritionary circumstances. within the six-month amount, infants failed to gain weight a pair of times, were in danger of deficiency disease 12.6 times than those with regular weight gain. supported this, the load modification info are often the parameter to mapping the potential deficiency disease issues.   3 PROBLEM DEFINITION Health support of each individual should be considered many health problems. There are many people over the world suffering from Malnutrition disease only due to lack of early detection of disease, malnutrition disease is a matter of great concern and thus many efforts are     Rahamuddin Khan, Department of Computer Science, Rajiv Gandhi           Proudyogiki Vishwavidyalaya, Bhopal, India e-mail: khanrk056@gmail.com  Manish Ahirwar, , Department of Computer Science, Rajiv Gandhi  Proudyogiki Vishwavidyalaya, Bhopal, India, e-mail: ahirwarmanish@gmail.com2  Piyush Kumar Shukla,Department of Computer Science, Rajiv Gandhi  Proudyogiki Vishwavidyalaya, Bhopal, India. e-mail: pphdwss@gmail.com3 Corresponding Author:   khanrk7566@gmail.com,,   Tel.: +91-7566469990      ":1}