{"INTERNATIONAL JOURNAL OF SCIENTIFIC & TECHNOLOGY RESEARCH VOLUME 8, ISSUE 11, NOVEMBER 2019       ISSN 2277-8616                     3691 IJSTR©2019 www.ijstr.org devoted in most developed countries to design of automatic system for detecting this disease based on IoT. The sensor based device can be very useful to detect undernourishment or over nutrition and take necessary action by using regression algorithms. In healthcare environment no such system presents that accurately prediction the complete data of one patient to diagnose the disease in a short period of time. The previous systems take too much time to detect the disease which causes serious harm to the patients. In previous models the patient first go through various medical tests and get reports of each test individually, then doctor of each field monitor or check the test report based on some parameters and take necessary decision on the basis of the report. This process takes too much time in detecting the diseases in patients. The following are the point which identified as a problem Due to self-learning, the rate of false diagnose is high, Many proposed system does not clarify the accuracy regarding Malnutrition disease    The lack of interaction or communications of different machines so that they cannot calculate the accurate accuracy of the disease. Due to missing or abnormal values the rate of false diagnose is high. Existing work does not clarify about the data preprocessing normalization technique that will help us to enhance the accuracy of the result.    4 PROPOSED WORK The main aim of our thesis is to find a best classifier that can classify chronic kidney disease more accurately and timely.      Figure 1. Proposed Model  As a solution we introduce a model that classify and predict the disease accurately in short period of time so that patient get quick diagnose based on the result. We predict the disease by using the malnutrition disease dataset. The stored data is unstructured or raunchy and there may be some missing or abnormal values also. So, we have to replace an abnormal or missing value with expected value. The preprocessed data then will prediction using regression algorithm in order to calculate the accuracy of the disease by using WEKA Tool.  Proposed Algorithms  Access the collected data from the data repository for further processing.  Load the dataset into the simulation environment i.e. WEKA Tool.  Data preprocessing:- the stored data contain some noisy or missing or abnormal value it is necessary to remove it by using Replace Missing Values filter in WEKA Tool. Then we transform the nominal attributes of dataset in to binary attributes for easy manipulation of our models. After that we normalize the dataset into a homogenous data interval [0, 1]. ":1}