{" International Journal of Advanced Scientific Research and Management, Vol. 3 Issue 3, Mar 2018 www.ijasrm.com ISSN 2455-6378 48   subfamily I.1 consists of lipases with a molecular weight of approximately 30 kDa and a single disulfide bond in the molecule. The challenge for the soil microbial ecologist is to identify the populations and guilds of microorganisms that have key functional roles in specific soil processes. Polymerase chain reaction (PCR) amplification of 16S rDNA genes [12,13] and enterobacterial repetitive intergenic consensus (ERIC)-PCR amplification [14,15,16] using consensus bacterial primers and separation of the resultant PCR amplifications by agarose gel electrophoresis (AGE) constitutes one of the popular techniques, which is used to describe soil bacterial ecology [17,18,19]. Bands on the gel can be sequenced and the resultant information can be used to infer something about the diversity of the original sample. There is a proliferation of these studies applied to soils, as molecular techniques have been systematically applied to many diverse environments. The diversity of Dhapa landfill at the East Kolkata (India) is investigated in 2007 with the usage of PCR amplification of 16S rDNA genes [20].  2. Materials and Methods: 2.1 Sample collection and processing:  Soil samples were collected at 4-5 cm depth with the help of sterile spatula in a sterile plastic bag from different petrol bunks in the vicinity of Hubli-Dharwad. After collection, samples were brought to the laboratory and 1 g of sample was suspended in 100 mL of sterile distilled water, agitated for 30 min on a shaker at 35ºC and kept as stock solution for further isolation of the micro organisms.  2.2 Screening of micro organism The obtained colonies were then isolated and cultured in to different tubes containing Nutrient medium. The isolates obtained were screened for the lipolytic activity using lipid hydrolysis in nutrient broth containing 1% of Tributyrin. One isolate OCR-4, which showed maximum activity was selected and maintained on tributyrin agar slant at 4ºC Figure 1a & b. The culture was examined for various morphological and biochemical characteristics as per   2.3 Partial purification of enzyme lipase The 200ml broth was centrifuged and the supernatant was saturated to 80% (w/v) with Ammonium sulphate. The saturation was carried by adding Ammonium sulfate slowly into the crude extract with constant stirring. The stirring was continued for 2 hours after Ammonium sulfate was completely dissolved to aid the complete precipitation. Whole process was carried out in cold and lasted for 8hrs. The precipitated protein was separated by centrifuging at 10,000g for 10mins. The protein pellet was dissolved in minimal volume of 25mM Tris buffer (pH 8.0). The precipitated proteins were further purified by dialysis. The protein samples were dialyzed using the low cut off membrane against 500ml of 5mM dialysis buffer containing 5mM Tris buffer (pH 8.0) for 8 hrs with 2 changes in buffer Figure 2.   2.4 DNA Preparation and PCR Amplification DNA was isolated and purified according to Sambrook et al., 1989 [22]. Each genomic DNA used as template was amplified by PCR with the aid of 16S rDNA primers (The forward primer were -CTACGGGAGGCAGCAGTGG--TCGGTAACGTCAAAACAGCAAAGT-). The programme consisted of denaturation at 94ºC for 2 min and subsequent 35 cycles of denaturation at 94ºC for 1 min, annealing at 62ºC for 1 min, and extension at 72ºC for 1 min followed by final extension at 72ºC for 1 min. The presence of PCR products was determined by electrophoresis of 20 L of the reaction product in a 0.8% agarose gel Figure 3a & b.  2.5 16S rRNA Sequencing and Data Analysis Amplicon was cut and submitted for the sequencing at Bioserve Biotechnologies, (India) Pvt. Ltd, Hyderabad. The sequenced product obtained was analyzed, to check the homology with those sequences in the NCBI databases using BLAST algorithm (http://www.ncbi.nlm.nih.gov/BLAST). The sequencing data was obtained utilizing this strategy indicated that the isolate under study was P. aeruginosa. Further the hit sequences were multiple aligned using Clustal X along with the Phylogenetic tree development Figure 4. The tree was visualized using Treeview software. The sequence was further translated to protein to know coding sequences by ORF finder (www.bioinformatics.org/sms/orf_find.html).  3. Results 3.1 Colony Morphology, Biochemical characterization, Comparative Lipolytic Activity of Lipase Producers The 14 isolates obtained were grown in selective medium and were found to produce lipase which were identified as Aj-1, Aj-2, Aj-4, Aj-5, Aj-6, Aj-9, Aj-11, Aj-14c, Aj-15, Aj-18, Aj-24a, Aj24b, Aj32, Aj-38. When the lipases produced by these isolates were evaluated, the isolate Aj-4 showed outstanding results compared to the other isolates (Fig 1a and 1b).   ":1}