{"Outcome Author ID Country Study Characteristics Population Characteristics Pain Characteristics Intervention Detail  Outcome results: Pain, Disability results: Other outcomes; Harms Cassidy, J Trial Design-RCT Mean age Region of pain: Groups Outcomes: Outcomes (1992)252 (SD/range): IG = NP IG (n = 52)Œ Manipulation: Pain: NRS (0-100) (describe Country: Canada Tx duration: one session Fu duration (last assessment): immed. Post-tx 34.5 (13) vs. CG = 37.7 (12.5) yrs % of male: NR Racial composition: Cause of Pain: N-S, 100% with radiating pain contacting third finger over articular pillar on painful side of neck at level of tenderness and passively rotating neck away from painful side as far as Results: Baseline: Pain: IG = 37.7 (25.9), CG = 31 instrument used): QoL/ well being: NR Quality N screened: NR NR possible; then applying a (19.9) Range of motion score: 6/13 N randomized: 100 high-velocity, low(ROM): N completed tx: 100 Work status: NR Duration of amplitude thrust in the Immediate post tx: N attended last fu: 100 Pain, mean same direction; one Pain: IG = 20.4 Immediate post tx Initial of (SD/range): session (21.2), CG = 20.5 flx: 61.0 (10.1) reviewer: demographics: NR Mixed Drop outs: A = 0, B = 0 (21) vs. 59.6 (14.0) SG Inclusion: outPts suffering from unilateral mechanical NP with Co morbidities: History of NP, n = 78; Involved in car Severity of pain (Grading): NR CG (n = 48) Œ Mobilization: application of muscle energy technique Short term: NR ext: 59.9 (11.0) vs. 54.7 (14.6) gain scores for all radiation into the accident, n = 31; (Bourdillon Day) to Intermediate: NR ROM data was trapezius muscle; pain other minor trauma hypertonic muscles NSly differenet aggravated by to neck, n = 28 responsible for restricting Long term: NA between groups movement and local intervention joint movement, pt cervcial paraspinal Prior episode of common in all instructed to push against Short term: NR tenderness pain if acute: NR groups: NR manual resistance, localized force to involved Intermediate: NR Exclusion: NR Prior CAM intervention: NR levels; isometric contraction held for 5 sec, repeated 4 times with Long term: NA Prior surgery increasing rot or lateral flx Harms: No related to current of the neck; As IG complications complaint: NR Drop outs: A = 0, B = 0 repported C-261":0}