{"Table 2.15 Neck Pain - Manipulation & Mobilization - Unknown - Specific Pain Outcome Author ID Country Study Characteristics Population Characteristics Pain Characteristics Intervention Detail  Outcome results: Pain, Disability results: Other outcomes; Harms Cilliers, K Trial Design-RCT- Mean age Region of pain: IG (n = 15) Œ Transverse Outcomes: Outcomes: (1998)260 (SD/range): IG = NP oscillatory rot segment Pain: SF-MPQ QoL/ well being: Country: South Africa Tx duration: 4 wks Fu duration (last assessment): 1 mos N screened: NR 33 vs. CG = 29.3  yrs % of male: IG = 53.3%; CG = Cause of Pain: Facet joint syndrome adjustment: of the fixation into the restriction of motion; fixated segment determined by Kemp's test, motion palpation findings and local tenderness; only Disability: NR No numeric data is reported-both grps NR ROM: no numerica data is reported (IG vs. N randomized: 30 26.6% the most restricted fixation improved sign. CG p< 0.05 for Quality N completed tx: 30 Duration of was adjusted; adjustment From baseline forward flx at mo score: 3/13 N attended last fu: 30 Racial Pain, mean used a HVLA thrust using fu) composition: NR (SD/range): S contacts and line of Results: Inclusion: 14 yrs of age Unknown, NR drive; only cervical rotary Immediate post Initial of reviewer: SG or older with diagnosis of cervical facet syndrome; physically fit individuals with a cause of NP Work status: NR Other sodemographics: Severity of pain (Grading): NR adjustments were used; adjustment was preceded by 5 min of massage with oil; 8 tx over 4 wks Drop outs: NR Immediate post tx: Pain: NR Disability: NR tx: NA Short term: NR related to cervical facet NR Current tx/ co-Short term: NR Intermediate: NR syndrome intervention CG (n = 15) Œ Transverse Co morbidities: common in all oscillatory rot and bottom Intermediate: NR Long term: NR NR groups: Pts segment adjustment: of the Exclusion: organic were requested fixation into the restriction Long term: NR Harms: NR cause of cervical pain or who had surgery on cervical spine; positive Wallenberg test Prior episode of pain if acute: NR Prior CAM to not take any Med or other tx that may have influenced of motion, and the bottom segment in the opposite direction; adjustment as IG, also preceded by 5 min of massage with oil; As IG Summary: bothe approaches to adjusting the intervention: NR outcome of the Drop outs: NR cervical spine study were effective in Prior surgery treating facet related to current syndrome. IG2 complaint: NR was slightly more effective than IG1 C-269":0}