{"Premarket Notification Traditional 510(k)  BIAFINE Topical Cream    7. Safety and Effectiveness Information The review of the indications for use and technical characteristics provided demonstrates that BIAFINE Topical Cream is substantially equivalent to the predicate devices.   8. Performance Data  Non-Clinical Performance Data: Non-clinical testing was conducted to support the safety and effectiveness of BIAFINE Topical Cream. An in-use study was performed to support the shelf-life of opened product. Preservative effectiveness testing of BIAFINE Topical cream conducted as per USP <51>. The preservative effectiveness of BIAFINE Topical Cream meet USP <51> criteria. pH, Residual testing, Sulfated Ash, Viscosity and Water Content limit testing were conducted to support the In-Use study data and preservative efficacy as per USP <51> and the results meet the criteria as per USP <51>.  Clinical Performance Data: Clinically, the expanded use of BIAFINE OTC for cosmetic procedures and blister indications and the current general use of the marketed BIAFINE is the same: to aid the natural wound healing process by providing an optimum moist environment. Cosmetic procedures such as post-laser therapy, chemical peeling and dermabrasion treatment stimulate like wound healing processes as each of these procedures enhance skin rejuvenation to fight signs of skin aging as well as treat various dermatologic pathologies, such as acne, melasma, and photodamage.1,2 Whether a wound is acute or chronic, caused by pressure or burns, scientists and medical professionals recognize that a moist environment can support the natural process of wound healing in all types of wounds.3,4 Therefore, the same data and results from BIAFINE  prescription (Rx) product on wound healing as well as published literature on the benefits of BIAFINE in various wound types including minor blisters and minor skin irritations following post non-ablative laser therapy procedures, are considered applicable for support of expanded indications of BIAFINE for  OTC (over the counter) use  . Multiple independent clinical studies have been reported in the scientific literature on BIAFINE.  BIAFINE has been shown effective in wound management of post non-ablative laser procedures,2,5,6,7,8,9,10 chemical peeling1 and minor wounds, skin irritation, 1,7, 10,11,12,13,14, and blisters,11,12,14,15 as well as relief of wound symptoms, such as burning, pain and itch.7,11,12,13,14,15   The results of the published studies on post laser treatment with BIAFINE showed successful management of the side effects (both signs and symptoms) from phototherapy, including crusting, redness, and temporary discomfort.7 A blinded pilot study evaluated erythema, edema and scarring with BIAFINE use post-laser treatment.8 In another study, BIAFINE was used post 3DEEP non-ablative skin tightening treatment followed by a Fractional skin ":0}