{" Table 2.17 Neck Pain- Spinal Mobilization- Acute Œ Specific Pain Œ No studies Table 2.18 Neck Pain- Spinal Mobilization- Acute Œ Non-Specific Pain  Author ID Country Buchmann, J (2005)236 Country: Germany Study Characteristics Trial Design-RCT- Tx duration: NR Fu duration (last assessment): 24 hrs post last tx N screened: 60 Population Characteristics Mean age (SD/range): IG = 44 (22), IG2 = 46 (14), CG = 49 (7) yrs % of male: IG = Pain Characteristics Region of pain: NP Cause of Pain: NR Intervention Detail  Groups IG1 (n = 10) Œ SM: thrusting force on lateral aspects of occiput or C1 exerted for < 200 msec pre/post anesthesia; NR Drop outs: A = 0, B = 2 Outcome results: Pain, Disability Outcomes: Disability: N of found dysfunctions in motion segments O/C1 and C1/C2- no numerical data is reported (only p Outcome results: Other outcomes; Harms Outcomes: QoL/ well being: NR Short term: NR Intermediate: NR Quality score: 7/13 Initial of reviewer: SG N randomized: 26 N completed tx: 24 N attended last fu: NR Inclusion: 18-80 yrs, manually diagnosed dysfunction of one or both of the segments occiput/cervical 1 and cervical 1/cervical 2 60%; IG2 = 62%; CG = 50% Racial composition: NR Work status: NR Other sodemographics: Duration of Pain, mean (SD/range): Acute/Sub-acute NR Severity of pain (Grading): NR IG2 (n = 8) Œ Post-isometric relaxation): applied to hypertonic muscle - isometric contraction by pts against manual resistance for 10 sec then stransverse oscillatory rotped and repeated after at least 20 sec rest;pre/post values) Results: Baseline: Disability: IG1 = 21, IG2 = 15, CG = 13 Immediate post tx: Disability: ---Long term: NA Harms: 2 WDAE in IG1- complication arising from a surgical operation Summary: sig effect of IG1&2 vs. placebo, in restoring function Exclusion: previous surgery of cervical spinal column, arthrosis of cervical spinal column, spondylolisthesis, fracture, inflammation, previous disk herniations or cervical spinal column, any kind of NR Co morbidities: NR Prior episode of pain if acute: NR Prior CAM intervention: NR intervention common in all groups: NR anesthesia NR Drop outs: See IG1 CG (n = 8) Œ Placebo: Laying palms of clinician on sides of pt's neck without any side-different pressure or without having pt under tension; pre/post Short term: NR Intermediate: NR Long term: NA (p< 0.01) In anesthesia: IG1 vs. placebo, p < 0.01. No sig difference between IG1 & 2 (P = 0.137). The tx effect postnarcotically cancer or planned surgery anesthesia NR was further sign in in throat Prior surgery Drop outs: See IG1 IG1 vs. placeborelated to current only  (P = 0.01) complaint: NR C-276":0}