{"Table 2.5 Neck Pain - Acupuncture - Mixed - Specific Pain Author ID Country Study Characteristics Population Characteristics Pain Characteristics Intervention Detail  Outcome results: Pain, Disability Outcome results: Other outcomes; Harms Bin, X Trial Design Mean age Region of pain: Groups Outcomes Outcomes (2007)217 RCT (SD/range): 3IG (n = 29) Œ Electro(describe (describe Country: Tx duration: 10 ds Fu duration (last assessment): NR 68 yrs % of male: 73% total Cause of Pain: Cervical spondylopathy of the acu:on acu points: GB 20; GV 20; GB 8; oblique insertion (75° angle) -gentle lifting instrument used): Pain: NA instrument used): QoL/ well being: Life and work-mean (SD) China N screened: NR vertebroarterial thrusting and rotating Disability: NA Post tx: N randomized: 57 Racial type manipulation was 3.38 (2.43) vs. N completed tx: 54 composition: performed to induce the Results: 2.74 (2.39) Quality N attended last fu: NR assume Asian arrival of qi before and Baseline: NA score: 5/13 electric stimulator was Pain: Cure rates Initial of reviewer: SG Inclusion: age 18-70 yrs; diagnosed with cervical spondylopathy; abnormal findings in X-ray exam; excluding ocular or aural vertigo, cases caused by Work status: NR Other sodemographics: NR Duration of Pain, mean (SD/range): Mixed (1 wk-10 yrs), NR connected to the needles; The points selected wer divided into two groups wich were used alternately; Disability: Immediate post tx: Pain: NA Disability: NA Immediate post tx: pts completely cured (n): 10 vs. 6; cured & markedly effective rate: poor blood supply in basilare 20 min/session, once 82.21 vs. 53.84; arterial due to pressure on Co morbidities: Severity of pain daily with a 10 d course Short term: NR Effective rate: the verebroartery section I NR (Grading): Drop outs: 1 92.86 vs. 84.62 and III; also cases due to excluded mild; Intermediate: NR neurosis and intracranial Prior episode of total: majority CG (n = 28) Œ simple Change of physica tumor) pain if acute: NR moderate (8 acu: same acupoints Long term: NR signs: data not Exclusion: conditions caused by such diseases as Meniere's cerebral Prior CAM intervention: NR severe, and 49 moderate) and manipulation methods as IG; Same as IG shown Quality of life: arterisclerosis, postural Drop outs: 2 Short term: NR vetigo, drug intoxication of Prior surgery inner ear, neurosis, and related to current intervention Intermediate: NR sublavian steal syndrome complaint: NR common in all groups: NR Long term: NR Harms: NR C-223":0}