{"                     International Journal Of Computational Engineering Research (ijceronline.com) Vol. 2 Issue.5   Issn 2250-3005(online)                                                      September| 2012              Page 1178           7. Conclusion: To maintain a high level of availability and reliability in a fossil power plant, substantial consideration of failure by repeated thermal loading should be carried out.   In this study, the transient temperatures and stresses distributions within a turbine inner casing were achieved from actual operation data during cold start-up.  The maximum deformations are calculate in transient state condition within inner casing.  Equivalent (von-Misses) Stress distribution in Transient condition.  Total deformation and stress values are compared with analytical results calculated for 2D geometry.  If the thermal gradient is great enough, the stress at the bottom of the threads may be high enough to cause the carking. The result shows the casing develops higher stress levels in startup condition.  8. Scope for the Future Study: Turbine facilities that operated repeatedly under transient start-up condition are affected by various damage mechanisms such as creep, fatigue, and oxidation and so on. In general, it is known that low cycle fatigue is one of main damage mechanisms to determine life time of turbine rotor or casing components.  This study can be extended further to calculate the fatigue damage by the stress analysis based procedure. This approach is based on Neuber's rule. Neuber's rule expresses the relationship between local stress and local inelastic total strain-range. Using this study, life consumption of steam turbine inner-casing can be obtained and a guideline for effective maintenance also can be proposed. The analysis can be extended further considering Elasto-Plastic analysis using non linear material properties as well as temperature dependent material properties.  References: [1]    W. S. Choi, E. Fleury, G. W. Song and J.-S. Hyun, A life assessment for steam turbine rotor subjected to thermo-           [2]     Lucjan Witek, Daniel Musili Ngii, thermal fatigue problems of turbine casing Vol. 1 (2009) 205-211 [3]     Maneesh Batrani, BHEL Haridwar, Hypermesh an effective 3-D CAE Tool in Designing of complex steam turbine low                            pressure casing in 2006. [4]     T.Stubbs, the role of NDE in the life management of steam turbine rotors, Swindon, England [5]     K. Fujiyama, Development of risk based maintenance planning program for Power Plant steam turbine, Final report on              the Joint Project [6]        49, No. 2 (2006), pp.192-197.  [7]    Development of Life Prediction System for Thermal Power Plant Based on  Viscoplastic Analysis, Final report, KERPI (2007).    ":0}