{"                     International Journal Of Computational Engineering Research (ijceronline.com) Vol. 2 Issue.5   Issn 2250-3005(online)                                                      September| 2012              Page 1175            3.3 Heat Transfer Analysis Heat transfer of a casing surface is affected by convection and temperature distribution of inner part is calculated by conduction. The boundary conditions between surface and inner area for the thermal analysis were derived from calculated heat transfer coefficient according to time Heat transfer analysis was conducted from pre-warming to steady state condition using heat transfer coefficients and a steam temperature of each location acquired from operating data. For HP casing are made from castings and the life assessment portions are corner radius, pipe inner surfaces and welds. For turbine casing, especially, the major damage occurs at the nozzle fit and disk corner of casing.  3.4 Thermal Analysis A thermal analysis calculates the temperature distribution and related thermal quantities in steam turbine casing. Typical thermal quantities are  The temperature distribution  The amount of heat lost or gained  Thermal fluxes  Thermal gradient   Thermal simulations play an important role in the design of many engineering applications, including internal combustion engines, turbines, heat exchangers, piping systems, and electronic components. In many cases, engineers follow a thermal analysis with a stress analysis to calculate thermal stresses (that is, stresses caused by thermal expansions or contractions). The basis for thermal analysis in ANSYS is a heat balance equation obtained from the principle of conservation of energy. The finite element solution perform via ANSYS calculates nodal temperatures, and then uses the nodal temperatures to obtain other thermal quantities.  3.5 Transient Thermal Analysis The ANSYS Multiphysics, ANSYS Mechanical, ANSYS Professional, and ANSYS FLOTRAN products support transient thermal analysis. Transient thermal analysis determines temperatures and other thermal quantities that vary over time. Engineers commonly use temperatures that a transient thermal analysis calculates as input to structural analyses for thermal stress evaluations. Many heat transfer application heat treatment problems, nozzles, engine blocks, piping systems, pressure vessels, etc. - involve transient thermal analyses. A transient thermal analysis follows basically the same procedures as a steady-state thermal analysis. The main difference is that most applied loads in a transient analysis are functions of time. To specify time-de- pendent loads, and then apply the function as a boundary condition, or you can divide the load-versus-time curve into load steps 3.5 Meshing The goal of meshing in HYPERMESH Workbench is to provide robust, easy to use meshing tools that will simplify the mesh generation process. These tools have the benefit of being highly automated along with having a moderate to high degree of user control. In order to carry out a finite element analysis, the model using must be divided into a number of small pieces known as finite elements. Since the model is divided into a number of discrete parts, FEA can be described as a discretization technique. In simple terms, a mathematical net or mesh is required to carry out a finite element analysis.  If the system under investigation is 1D in nature, use line elements to represent our geometry and to carry out our analysis. If the problem can be described in 2 dimensions, then a 2D mesh is required. Correspondingly, if the problem is complex and a 3D representation of the continuum is required, then we use a 3D mesh.                             Fig 3.2: Steam Casing (HP) Meshed Model ":0}