{"International Journal Of Computational Engineering Research (ijceronline.com) Vol. 2 Issue.5   Issn 2250-3005(online)                                                      September| 2012              Page 1173           Design and Analysis of HP steam turbine casing for Transient state condition 1J.Ramesh,2C.Vijaya Bhaskar Reddy, 3 Dr. B. Jayachandraiah    P.G Student1       Assistant Professor2 (Sr)    Head & Vice-principal3                                                                      Department Of Mechanical Engineering, Sri Kalahasteeswara Institute Of Technology, Srikalahasti.  Abstract Transient regimes arising during start-ups, shut-downs and load changes give rise to unsteady temperature distribution with time in steam turbine casing high pressure (HP) which results in non-uniform strain and stress distribution. So that problems such as stress corrosion, cracking and fatigue of steam turbine casing, In this work the thermo mechanical analysis of steam turbine casing will be established by finite element method.  In this work the temperature and stress distributions for turbine inner casing were calculated by finite element analysis. The three dimensional model of the Steam Turbine Casing was created using the CATIA software. The model was meshed using software HYPERMESH. Boundary conditions were given on the finite element model through ANSYS. In this paper, the transient temperatures and stresses distributions within a turbine inner casing were achieved from actual operation data during cold start-up. The paper analyses the creap, centrifugal stress sub stained at high temperature in thermal stresses setup during the startup and shutdown the stream turbine and most serious thread of the rotor blades near the bore, creep cracks to initiates go to size which could results brittle fracture of the rotor blades. Due to crackness life of the steam turbine decreases.  Keywords: Transient condition, 3-D model, Hypermesh, FE model, Thermal expansion  1.Introduction Generally turbine casings used are split horizontally and vertically. The casing houses the blades rotor, nozzles, and diaphragms.  It also holds glands for steam sealing at each end for preventing leakage of steam from where the shaft passes through. The steam casing of turbine is generally arranged with centre line support i.e the support points are on the same horizontal plane as the centre line of the turbine. The steam end pedestal sits upon a flexible panting plate which provides rigidity in the vertical and lateral planes, but allows flexibility in the axial plane for casing thermal expansion. The combined thrust and journal bearing of the turbine rotor is housed in the steam end pedestal. The rotor, therefore, is moved axially towards the steam end with the axil movement of the casing. The casing is that portion of the turbine that either supports or supported by the bearing housings. The steam ring is attached to or is a part of the casing. All casing joints have metal to metal sealing surfaces no strings or gaskets are used. All turbines manufactured by Maxwatt use multiple piece casings consisting of two or more pieces that are split at the horizontal centerline to facilitate inspection or removal of the turbine rotor. The casings are either cast, fabricated, or a combination of both depending on operating conditions. The casing can be of iron, carbon steel, carbon moly steel, or chrome moly steel.  Types Of Casings 1.1 Single Stage Turbine Casing Single stage turbine casings are two piece casings. The casing consists of the upper half and the lower half the lower half casing houses both the inlet and exhaust connections. The bearing housings are either cast integrally with or bolted to the lower half casing. All single stage frames except the type GA and SA turbine have the steam ring cast integrally with the casing this means that the material required for the steam ring is also required for the casing. In those cases where the steam ring is not cast as the part of the casing, different materials for the steam ring and casing can be utilized. The two components are bolted together.":0}