{"167Hipotireoidismo subclínico ABSTRACTIntroduction: Subclinical hypothyroidism (SCH), de˜ned as elevated concentrations of thyroid stimulating hormone (TSH) despite normal levels of thyroid hormones, is highly prevalent in Brazil, especially among women and the elderly. Although an increasing number of studies have related SCH to an increased risk of coronary artery disease and mortality, there have been no randomized clinical trials verifying the bene˜t of levothyroxine treatment in reducing these risks, and the treatment remains controversial. Objective: This consensus, sponsored by the Thyroid Department of the Brazilian Society of Endocrinology and Metabolism and developed by Brazilian experts with extensive clinical experience with thyroid diseases, presents these recommendations based on evidence for the clinical management of SCH patients in Brazil. Materials and methods: After structuring the clinical questions, the search for evidence in the literature was initially performed in the MedLine-PubMed database and later in the Embase and SciELO Œ Lilacs databases. The strength of evidence was evaluated according to the Oxford clas-si˜cation system and established based on the experimental design used, considering the best available evidence for each question and the Brazilian experience. Results: The topics covered included SCH de˜nition and diagnosis, natural history, clinical signi˜cance, treatment and preg-nancy, and the consensus issued 29 recommendations for the clinical management of adult patients with SCH. Conclusion: Treatment with levothyroxine was recommended for all patients with persistent SCH with serum TSH values ˚ 10 mU/L and for certain patient subgroups.  Arq Bras Endocrinol Metab. 2013;57(3):166-83KeywordsHypothyroidism; subclinical hypothyroidism; consensus; guidelinesINTRODUÇÃOO hipotireoidismo subclínico (HSC) tem sido de-˜nido bioquimicamente pela presença de níveis séricos elevados do hormônio estimulador da tireoide (TSH) em face de concentrações séricas normais dos hormônios tireoidianos (1-3). Estima-se que a preva-lência na população geral seja em torno de 4% a 10%, sendo maior no sexo feminino, em idosos e inversamen-te proporcional ao conteúdo de iodo na dieta (4-7). No Brasil, a prevalência de TSH elevado em uma amostra representativa de 1.220 mulheres adultas da cidade do Rio de Janeiro foi de 12,3%, alcançando 19,1% entre aquelas acima de 70 anos (8). Na região metropolita-na de São Paulo, a prevalência de hipotireoidismo em 1.085 indivíduos foi de 8,0% (9), enquanto entre 1.110 indivíduos ˚ 30 anos da população nipo-brasileira de Bauru foi de 11,1% no sexo feminino e 8,7% no mascu-lino (10) e, em uma população idosa da cidade de São Paulo, a prevalência de HSC foi de 6,5% e 6,1% para os sexos feminino e masculino, respectivamente (11).Na última década, um número crescente de estudos tem associado o HSC com maior risco de doença arte-rial coronariana e de mortalidade (12,13), mas, apesar disso, não há nenhuma evidência su˜cientemente forte e conclusiva em estudos prospectivos randomizados e duplo-cegos sobre potenciais benefícios da reposição com levotiroxina.Recentemente, a Associação Americana de Tireoide em conjunto com a Associação Americana de Endocri-nologistas Clínicos publicou suas recomendações (14) para a abordagem do hipotireoidismo, mas com poucas recomendações especí˜cas sobre a disfunção subclínica. No Brasil, não há nenhum consenso anterior sobre a abordagem diagnóstica e terapêutica do HSC. O consenso que apresentamos reúne esforços do Departamento de Tireoide da Sociedade Brasileira de Endocrinologia e Metabologia no desenvolvimento de recomendações baseadas em evidências disponíveis na literatura para a abordagem do paciente com HSC em nosso meio. Os principais objetivos foram o desenvol-vimento de recomendações que auxiliem o clínico na melhor conduta para seu paciente, em um processo que evite procedimentos desnecessários, obedecendo às ca-racterísticas do sistema de saúde brasileiro.MÉTODOS Este consenso obedece à política estratégica do De-partamento de Tireoide da Sociedade Brasileira de Endocrinologia e Metabologia no desenvolvimento de consensos nacionais para as principais patologias da ti-reoide, dirigidos à nossa população e considerando a realidade do sistema de saúde brasileiro. O modelo seguido foi nos moldes do Programa Di-retrizes (15) da Associação Médica Brasileira (AMB) e ":1}