{"181in a population-based study. The HUNT study. Eur J Endocrinol. 2007;156:181-6.76. Kahaly GJ, Dillmann WH. Thyroid hormone action in the heart. Endocr Rev. 2005;26:704-28.77. Sellitti DF, Dennison D, Akamizu T, Doi SQ, Kohn LD, Koshiyama H. Thyrotropin regulation of cyclic adenosine monophosphate production in human coronary artery smooth muscle cells. Thyroid. 2000;10:219-25.78. Donnini D, Ambesi-Impiombato FS, Curcio F. Thyrotropin stimulates production of procoagulant and vasodilative factors in human aortic endothelial cells. Thyroid. 2003;13:517-21.79. Dardano A, Ghiadoni L, Plantinga Y, Caraccio N, Bemi A, Duranti E, et al. Recombinant human thyrotropin reduces endothelium-dependent vasodilation in patients monitored for differentiated thyroid carcinoma. J Clin Endocrinol Metab. 2006;91:4175-8. 80. Lekakis J, Papamichael C, Alevizaki M, Piperingos G, Marafelia P, Mantzos J, et al. Flow-mediated, endothelium-dependent vasodilation is impaired in subjects with hypothyroidism, borderline hypothyroidism, and high-normal serum thyrotropin (TSH) values. Thyroid. 1997;7:411-4.81. Cikim AS, O˛az H, Ozbey N, Cikim K, Umman S, Meric M, et al. Evaluation of endothelial function in subclinical hypothyroidism and subclinical hyperthyroidism. Thyroid. 2004;14:605-9.82. Taddei S, Caraccio N, Virdis A, Dardano A, Versari D, Ghiadoni L, et al. Impaired endothelium-dependent vasodilatation in subclinical hypothyroidism: bene˜cial effect of levothyroxine therapy. J Clin Endocrinol Metab. 2003;88:3731-7.83. Razvi S, Ingoe L, Keeka G, Oates C, McMillan C, Weaver JU. The bene˜cial effect of L-thyroxine on cardiovascular risk factors, endothelial function and quality of life in subclinical hypothyroidism: randomized, crossover trial. J Clin Endocrinol Metab. 2007;92:1715-23.84. Traub-Weidinger T, Graf S, Beheshti M, O˛uoglu S, Zettinig G, Khorsand A, et al. Coronary vasoreactivity in subjects with thyroid autoimmunity and subclinical hypothyroidism before and after supplementation with thyroxine. Thyroid. 2012;22:245-51.85. Di Bello V, Monzani F, Giorgi D, Bertini A, Caraccio N, Valenti G, et al. Ultrasonic myocardial textural analysis in subclinical hypothyroidism. J Am Soc Echocardiogr. 2000;13:832-40.86. Vitale G, Galderisi M, Lupoli GA, Celentano A, Pietropaolo I, Parenti N, et al. Left ventricular myocardial impairment in subclinical hypothyroidism assessed by a new ultrasound tool: pulsed tissue Doppler. J Clin Endocrinol Metab. 2002;87:4350-5.87. Monzani F, Di Bello V, Caraccio N, Bertini A, Giorgi D, Giusti C, et al. Effect of levothyroxine on cardiac function and structure in subclinical hypothyroidism: a double blind, placebo-controlled study. J Clin Endocrinol Metab. 2001;86:1110-5.88. Yazici M, Gorgulu S, Sertbas Y, Erbilen E, Albayrak S, Yildiz O, et al. Effects of thyroxin therapy on cardiac function in patients with subclinical hypothyroidism: index of myocardial performance in the evaluation of left ventricular function. Int J Cardiol. 2004;95:135-43.89. Aghini-Lombardi F, Di Bello V, Talini E, Di Cori A, Monzani F, Antonangeli L, et al. Early textural and functional alterations of left ventricular myocardium in mild hypothyroidism. Eur J Endocrinol. 2006;155:3-9.90. Di Bello V, Talini E, Delle Donne MG, Aghini-Lombardi F, Monzani F, La Carrubba S, et al. New echocardiographic techniques in the evaluation of left ventricular mechanics in subclinical thyroid dysfunction. Echocardiography. 2009;26:711-9. 91. Ozturk S, Alcelik A, Ozyasar M, Dikbas O, Ayhan S, Ozlu F, et al. Evaluation of left ventricular systolic asynchrony in patients with subclinical hypothyroidism. Cardiol J. 2012;19:374-80.92. Iqbal A, Schirmer H, Lunde P, Figenschau Y, Rasmussen K, Jorde R. Thyroid stimulating hormone and left ventricular function.  J Clin Endocrinol Metab. 2007;92:3504-10.93. Pearce EN, Yang Q, Benjamin EJ, Aragam J, Vasan RS. Thyroid function and left ventricular structure and function in the Framingham Heart Study. Thyroid. 2010;20:369-73.94. Rodondi N, Newman AB, Vittinghoff E, de Rekeneire N, Satter˜eld S, Harris TB, et al. Subclinical hypothyroidism and the risk of heart failure, other cardiovascular events, and death. Arch Intern Med. 2005;165:2460-6.95. Nanchen D, Gussekloo J, Westendorp RG, Stott DJ, Jukema JW, Trompet S, et al. Subclinical thyroid dysfunction and the risk of heart failure in older persons at high cardiovascular risk. J Clin Endocrinol Metab. 2012;97:852-61.96. Gencer B, Collet TH, Virgini V, Bauer DC, Gussekloo J, Cappola AR, et al. Thyroid Studies Collaboration. Subclinical thyroid dysfunction and the risk of heart failure events: an individual participant data analysis from 6 prospective cohorts. Circulation. 2012;126:1040-9.97. Rodondi N, Bauer DC, Cappola AR, Cornuz J, Robbins J, Fried LP, et al. Subclinical thyroid dysfunction, cardiac function, and the risk of heart failure. The Cardiovascular Health Study. J Am Coll Cardiol. 2008;52:1152-9.98. Hyland KA, Arnold AM, Lee JS, Cappola AR. Persistent subclinical hypothyroidism and cardiovascular risk in the elderly: the cardiovascular health study. J Clin Endocrinol Metab. 2013;98(2):533-40.99. Gussekloo J, van Exel E, de Craen AJ, Meinders AE, Frolich M, Westendorp RG. Thyroid status, disability and cognitive function, and survival in old age. JAMA. 2004;292:2591-9.100. Imaizumi M, Akahoshi M, Ichimaru S, Nakashima E, Hida A, Soda M, et al. Risk for ischemic heart disease and all-cause mortality in subclinical hypothyroidism. J Clin Endocrinol Metab. 2004;89:3365-70.101. Walsh JP, Bremner AP, Bulsara MK, O™Leary P, Leedman PJ, Feddema P, et al. Subclinical thyroid dysfunction as a risk factor for cardiovascular disease. Arch Intern Med. 2005;165:2467-7.102. Cappola AR, Fried LP, Arnold AM, Danese MD, Kuller LH, Burke GL, et al. Thyroid status, cardiovascular risk, and mortality in older adults. JAMA. 2006;295:1033-41.103. Iervasi G, Molinaro S, Landi P, Taddei MC, Galli E, Mariani F, et al. Association between increased mortality and mild thyroid dysfunction in cardiac patients. Arch Intern Med. 2007;167:1526-32.104. Asvold BO, Bjoro T, Nilsen TI, Gunnell D, Vatten LJ. Thyrotropin levels and risk of fatal coronary heart disease: the HUNT study. Arch Intern Med. 2008;168:855-60.105. Boekholdt SM, Titan SM, Wiersinga WM, Chatterjee K, Basart DC, Luben R, et al. Initial thyroid status and cardiovascular risk factors: the EPIC-Norfolk prospective population study. Clin Endocrinol (Oxf). 2010;72:404-10.106. McQuade C, Skugor M, Brennan DM, Hoar B, Stevenson C, Hoogwerf BJ. Hypothyroidism and moderate subclinical hypothyroidism are associated with increased all-cause mortality independent of coronary heart disease risk factors: a PreCIS database study. Thyroid. 2011;21:837-43.107. Asvold BO, Bjøro T, Platou C, Vatten LJ. Thyroid function and the risk of coronary heart disease: 12-year follow-up of the HUNT Study in Norway. Clin Endocrinol (Oxf). 2012;77:911-7. 108. Biondi B, Cooper DS. The clinical signi˜cance of subclinical thyroid dysfunction. Endocr Rev. 2008;29:76-131.109. Rodondi N, Aujesky D, Vittinghoff E, Cornuz J, Bauer DC. Subclinical hypothyroidism and the risk of coronary heart disease: a meta-analysis. Am J Med. 2006;119:541-51.110. Volzke H, Schwahn C, Wallaschofski H, Dorr M. Review: The association of thyroid dysfunction with all-cause and circulatory mortality: is there a causal relationship? J Clin Endocrinol Metab. 2007;92:2421-29.Hipotireoidismo subclínico ":1}