{"Vol. 2 | Issue 2 | Apr-Jun 2011Chronicles of Young Scientists 88 the pectin backbone and with divalent ions such as calcium. ˝e a˘nity of pectin chains towards calcium is known to increase with decreasing DE or ionic strength, and with increasing polymer concentration. Besides the in˚uence of the charge density of the polygalacturonate chain, the distribution pattern of free and esteri˜ed carboxyl groups has an important e˙ect on the strength of calcium binding. Molecular weight of pectins can be expected to vary with plant source, raw material and extraction conditions but molecular weight determination is a challenge because of the extra problems of heterogeneity and aggregation which can obscure data gathering.Interactions of pectin with other hydrocolloidsInteractions between pectins and alginatesMixtures of pectins with other polysaccharides such as alginate has found that good gels are formed from HM pectin and guluronic-rich alginates. A pH above 4 also hinders the gel formation. ˝is ˜nding, with the added evidence of LM pectin gelation with alginate at very low pH, indicates that the chains must be su˘ciently charge neutralized before interaction can occur, and that esteri˜cation is required only to reduce electrostatic repulsion. ˝ese mixed systems work well with cold setting conditions.Interactions between pectins and proteinsUnderstanding interactions between pectins and proteins is thought to be central to developing food texture. Mixtures of proteins and polysaccharides are prone to incompatibility or undesirable complex formation. However, due to the number of interactions possible with pectins, there are many opportunities to explore di˙erent systems. One such system sees LM pectin interacting with poly-L-lysine. In pectins with a DE of 36%, strong gels crosslinked by physical bonds with the protein were obtained at pH™s close to neutrality. ˝ese clear, elastic gels had controlled increase in gel strength with added crosslinker up to an optimum. Excess protein caused increased opacity and eventual network collapse. Poly-L-lysine also serves to control network swelling. As with some hydrocolloids, chain length of the protein was found to have an optimum value, which may correspond to the di˙erent regions of the pectin molecule.Interactions of pectins with gelatinGelatin is used almost exclusively in confectionery products, in which long, tough, gum-like textures are desired. For these products a dosage of 7-10% gelatin is required to reach a su˘cient ˜rmness. In some gum products even up to 15% gelatin may be necessary to obtain the desired ˜rmness. When using gelatin alone, the low-melting temperature of the products may prove to be a disadvantage. ˝is may be compensated by combining it with pectin. Here a part of the gelatin is replaced by a substantially smaller amount of pectin. ˝e products are more stable at higher temperatures, thus increasing the storage stability of the confectionery products. Texture and chewing behavior of the product can be regulated by the pectin/gelatin ratio. Depending on the ratio of the two gelling agents either the pectin or the gelatin has a greater in˚uence on the texture of the gels. With increasing pectin share the texture of the gum articles becomes more elastic and brittle, with increasing gelatin share the products become more viscous. A further positive e˙ect of adding pectin is the reduction of the setting time compared to a pure gelatin system. With that the residence time in the mogul plant is shorter, resulting in higher production capacity.Interactions of pectins with starchOne example of a product produced using a combination of pectin and starch, are the so-called ﬁjelly beansﬂ. ˝e consumer expects a very special texture of this product and this is regulated with the pectin/starch ratio. Compared with jelly products the texture is long and viscous. Alterations in consistency can be achieved by changing the pectin/starch ratio or by the choice of the pectin or starch used. When selecting the gelling agents, the manufacturers should be consulted.Combination of pectins with agar-agarAgar-agar is often used as the classic gelling agent in aerated confectionery products such as marshmallows. In these products a more viscous texture can be achieved by replacing the agar-agar partially or completely with pectin. ˝is enhances the mouth-feel factor and hence provides a more distinctive ˚avor. ˝e water binding is positively in˚uenced by pectin thus leading to better preservation and longer storage stability.Interactions with other polymersInteractions with other hydrocolloids have been studied in depth recently. Gel formation of LM pectins with guar, locust bean gum, oxidized starch, potato maltodextrin and gum arabic have shown there to be speci˜c interactions between polysaccharide complexes. Complex formation between gum arabic and LM pectin (DM 31) was found to be enhanced when there was speci˜c spatial compatibility between the HG areas of the pectin and the gum arabic ˜brils. ˝ese interactions were found to be non-ionic and were more likely a hydrophobic association and stabilization which resulted in di˙ering gel properties. Branched hydrocolloids caused faster destabilization of calcium induced LM pectin than linear polymers. ˝is takes into account the interactions of branched regions in pectins with other branched regions, interactions that are highly hydrophobic and non-ionic.Conclusions˝e chemistry, biodegradable nature and gel-forming characteristics of pectin have enabled due to this naturally occurring biopolymer to be used in Pharmaceutical industry, health promotion and treatment. Also it has been used potentially in pharmaceutical preparation and drug formulation as a carrier of a wide variety of biologically active agents, not only for sustained release applications but also as a carrier for targeting drugs to the colon for either local treatment or systemic action. ˝e hydrophilic character of et al.: Colon drug delivery":0}