{"645eter marked both the subluxation and relocation phases ofposterior instability of the shoulder.InstrumentationThe limb position data was obtained from a 280 g gravityreference electrogoniometer.8 The electrogoniometer (Fig. 1)was calibrated before each test by rotating the shaft of thepotentiometer along with the attached protractor pointthrough a 30° angle. Beckman silver-silver chloride elec-trodes, 16 mm in diameter, with an active electrode size of9 mm were placed by the same investigator in bipolarfashion™ along the long axis of: 1) upper fibers of trapezius,2) serratus anterior in the midaxillary line at the level ofthe seventh rib, 3) infraspinatus, 4) posterior fibers of del-toid, 5) anterior fibers of deltoid, and 6) middle fibers ofdeltoid. During flexion, electrodes no. 4 and no. 6 werepositioned on the biceps and the clavicular fibers of thepectoralis major, respectively (Fig. 1).The electrodes and electrogoniometer were attached bycables and nine pin connectors to the biotelemetry unit(Conestoga Medical Electronics, Ltd., Waterloo, Ontario,Canada), which consisted of a transmitter, receiver, anddemultiplex decoder. The 400 g transmitter was anchoredby VELCRO (VELCRO USA, Inc., Manchester, NH) to thecalibration grid just above the subject™s head. It containedeight channels with an input impedance of 0.9 megohmsdifferential and 1.9 megohms common mode. The frequencyresponse of each channel ranged from DC or AC 0.16 to 360Hz. The Optonica stereo tuner receiver (Conestoga MedicalElectronics, Ltd.) routed all signals to the demultiplex de-coder, where they were separated into the original eightchannels and amplified by a factor of 2, 5, or 10. Afterpassing from the demultiplex decoder, the EMG signals werefull wave rectified and high pass filtered at a cutoff frequencyof 20 Hz. All EMG activity and data from the electrogoniom-eter were recorded on a Gould Brush eight channel inkrecorder (Alan Crawford Associates, Ltd., Missisauga, On-tario, Canada).ProcedureThe skin was shaved and cleaned with alcohol so that theelectrical resistance registered below 10,000 SL. The elec-trodes were placed over the muscles under study as describedin the instrumentation section. The electrogoniometer wasplaced snugly across the elbow with the base of the metalarm plate positioned just proximal to the radial head. EMGand electrogoniometric data was collected with the subjectseated in the upright position against a fixed backrest thatdid not interfere with scapular motion (Fig. 1).At the beginning of movement, the subject™s arm restedin a position of slight abduction. The position varied amongindividuals, depending on body size and posture. The anglefrom the protractor mounted on the electrogoniometer wasread and recorded on the strip chart. All measurements werecalculated from this position. The subjects were allowed topractice the movement three times before a final recordingwas made. The standard instructions were &dquo;raise your armslowly and evenly to a point where you feel you cannotcomfortably go any further.&dquo; The subject then performedthree trials of flexion and three trials of abduction at acontinuous slow speed with the elbow in extension. In aseparate trial, four subjects were able to demonstrate pain-less voluntary posterior subluxation by muscle contractionin a specific arm position.Data analysisElectromyographic activity of the linear envelope for thevarious muscle groups was measured at each 10° interval ofarm movement (Fig. 2). The lowest level of EMG activityrecorded over the three repetitions of flexion and abductionwas given a value of zero. The amplitude of the EMG linearenvelope in microvolts above this baseline was averaged overthe three repetitions, thereby generating an ensemble EMGpattern. EMG recordings at the time of subluxation wereexamined and graded as a percentage of the EMG activity(ensemble average) that would normally be present in thisrange for this subject (Tables 2 and 3). A descriptive ratherthan a statistical analysis was done on this data.RESULTSSubject 1Voluntary subluxation occurred with 50° of abduction andexternal rotation. At the time when the head of the humeruswas said to displace posteriorly, the greatest reductions wereseen in the upper trapezius (100%) and serratus anterior(77%), while the posterior deltoid increased its intensity by364%. Modest increases were also seen in the infraspinatus(12%) and middle deltoid (29%), while the anterior deltoidactivity (2%) was virtually unchanged from normal levels.At the time of relocation (60° abduction), the serratusanterior resumed near normal levels of activity. The mostdramatic changes were seen in the posterior deltoid muscleTABLE 1Voluntary posterior instability subject profile":0}