{"648TABLE 3EMG activity during voluntary subluxation-flexion™° Expressed as a percentage of EMG activity above (+) or below (-) the levels expected in this range.anterior and upper trapezius, presented the posterior glenoidlabrum as the only buttress to posterior dislocation. Capsu-lar redundancy and ligamentous laxity in both subjects withcomponents of multidirectional instability potentiated thistendency for subluxation.Although Subject 3 also displayed some components ofmultidirectional instability, he had a different pattern ofEMG activity during posterior subluxation. The humeralhead was pushed posteriorly by the anterior deltoid muscle,while the activity of the posterior deltoid and the infraspi-natus was suppressed. This pattern is very similar to obser-vations made in a study of voluntary subluxers.12 There alsowas inhibition of the trapezius and serratus anterior muscles,which normally elevate the outer margins of the scapuladuring elevation of the arm. This resulting lack of scapularrotation facilitated inferior dislocation of the humeralhead.l2Subject 4 induced posterior subluxation in the classicposition of flexion and internal rotation.&dquo; There was in-creased activity of the biceps and anterior deltoid muscleduring voluntary subluxation. Boyd and Sisk™ discuss thisaction of the biceps as a basis for transferring its tendonposteriorly for the treatment of posterior dislocations. Al-though there was increased activity of the anterior deltoid,the clavicular pectoralis major seemed not to have contrib-uted to either dislocation or relocation of the humeral headin this subject. This may be because of the ineffectivenessof this muscle in moving the head posteriorly in the higherdegrees of flexion. 13Although there was a slight increase in the EMG levels ofthe scapular rotators, the muscles that appeared to be in-strumental in the relocation phase were the infraspinatusand the biceps. External rotation of the humerus was accom-panied by high activity in the infraspinatus and suppressionof biceps, thereby allowing the head to relocate.It appears that subjects with ligamentous laxity and cap-sular redundancy have learned how to demonstrate posteriorsubluxation through selective muscle contraction in manydifferent shoulder positions, even those generally associatedwith anterior instability.5 Subject 4, on the other hand, didnot demonstrate any generalized ligamentous laxity or evi-dence of multidirectional instability on clinical testing.Elongation of the superior glenohumeral ligaments and theposterior rotator cuff&dquo; in the patient with pure posteriorinstability of the shoulder might facilitate subluxation inthis classic position of flexion, adduction, and internal ro-tation, particularly in the lower range of movement.TREATMENT IMPLICATIONSAlthough Beall et al.2 have reported success using EMGbiofeedback for the posterior deltoid muscle during selectedmovements of the glenohumeral joint, it is apparent fromthis study that EMG patterns for each patient must beassessed carefully, particularly if there is any evidence ofmultidirectional instability. Indiscriminate prescription ofexercise without EMG analysis might lead to aggravation ofthis syndrome. Subjects 1 and 2, for example, would benefitfrom a program of biofeedback emphasizing the contractionof the abnormally relaxed anterior deltoid muscle. Alter-nately, relaxation of the muscles responsible for subluxationmight provide greater stability to the joint. Particular atten-tion should always be given to the scapular rotators, sincethey allowed winging of the scapula at the point of sublux-ation in all subjects. Although the subject of EMG patternsduring involuntary subluxation at the glenohumeral joint inpatients with recurrent posterior instability has not beenaddressed in this study, preliminary data indicates that itdiffers significantly from that seen during voluntary sublux-ation. This may also have important ramifications for treat-ment. Unfortunately, the techniques advocated in this studyhave been tested with a very small population and thereforetheir efficacy cannot be determined at this time. Furtherresearch investigating the action of the supraspinatus andsubscapularis muscles, which are important stabilizers ofthe shoulder, is also warranted.REFERENCES1. Basmajian JV, Blumenstein R: Electrode Placement in EMG Biofeedback.Baltimore, Williams & Wilkms, 19802 Beall MS Jr, Diefenbach G, Allen A: Electromyographic biofeedback in thetreatment of voluntary postenor instability of the shoulder. Am J SportsMed 15: 175-178, 19873. Boyd HB, Sisk TD: Recurrent posterior dislocation of the shoulder. J BoneJoint Surg 54A: 779-786, 19724. Greenhill BJ: Persistent postenor shoulder dislocation: Its diagnosis andits treatment by postenor Pufti-Plaft repair (abstract). J Bone Joint Surg548: 763, 19725. Hawkins RJ, Koppert G, Johnston G. Recurrent postenor instability (sub-luxation) of the shoulder. J Bone Joint Surg 66A: 169-174, 19846. Hawkins RJ, Murnaghan JP: The shoulder, in Cruess RL, Rennie WRJ(eds): Adult Orthopaedics. Vol II. New York, Churchill Livingstone, 1984,pp 945-10547. Moullin CWM, Keith A: Notes on a case of backward dislocation of thehumerus caused by muscular action Lancet I: 496, 19048. Peat M, Graham RE, Fulford R, et al: An electrogoniometer for themeasurement of single plane movements. J Biomech 9: 423-424, 19769. Post M, Jablon M, Miller H, et al: Constrained total shoulder joint replace-ment : A critical review. Clin Orthop 144: 135-150, 197910. Reeves B: Recurrent posterior dislocation of the shoulder. Proc R SocMed 56: 897-898, 196311. Rosaaen BJ, DeLisa JA: Voluntary antenor dislocation of the shoulder:Case study. Arch Phys Med Rehabil 64: 326-328, 198312. Rowe CR, Pierce DS, Clark JG: Voluntary dislocation of the shoulder. JBone Joint Surg 55A: 445-460, 197313. Saha AK: Mechanics of elevation of glenohumeral joint. Its application inrehabilitation of flail shoulder in upper brachial plexus Injuries and polio-myelitis and m replacement of the upper humerus by prosthesis. ActaOrthop Scand 44: 668-678, 197314. Suzuki R, Ito N, Kuwahara K: An electromyographical study on looseshoulder. Fourth Congress of ISEK: 114-115, 197915 Warren RF, Komblatt IB, Marchand R: Static factors affecting posteriorshoulder stability. Orthop Trans 8: 89, 1984":0}