{"THE CONSTRUCTION CHART BOOK46Health Risk Factors and Chronic Illnesses among Construction Workers1. American Heart Association, Cigarette Smoking and Cardiovascular Diseases, http://www.americanheart.org(Accessed November 2007).2. Center for Disease Control and Prevention (CDC), Health Effects of Cigarette Smoking,http://www.cdc.gov/tobacco/data_statistics/Factsheets/health_effects.htm(Accessed November 2007).3. Allison A. Hedley, Cynthia L. Ogden, Clifford L. Johnson, Margaret D. Carroll, Lester R. Curtin, and Katherine M. Flegal. 2004. Prevalence ofOverweight and Obesity among U.S. Children, Adolescents, and Adults, 1999-2002. The Journal of the American Medical Association, 291:2847-2850. 4. American Diabetes Association, Total Prevalence of Diabetes & Pre-diabetes, www.diabetes.org/diabetes-statistics/prevalence.jsp(AccessedNovember 2007).5. Centers for Disease Control and Prevention, http://www.cdc.gov/diabetes/statistics/prev/national/figpersons.htm(Accessed November 2007).6. CPWR findings from a medical screening program of over 10,000 pulmonary function tests and chest X-rays of current and former constructionworkers at Department of Energy nuclear weapons facilities 1996-2006, updated through 2007 (unpublished data).7. National Center for Health Statistics, 2003 National Health Interview Survey. Calculations by CPWR Data Center.8. American Heart Association. 2005. Heart Disease and Stroke Statistics Œ 2005 Update. Dallas, TX: American Heart Association.9. Mikael Stattin and Bengt Järvholm. 2005. Occupation, Work Environment, and Disability Pension: AProspective Study of Construction Workers.Scandinavian Journal of Public Health, 33(2):84-90.10. Glorian Sorensen, Elizabeth Barbeau, Anne Stoddard, Mary Hunt, Roberta Goldman, Ann Smith, Angela Brennan, and Lorraine Wallace. 2007.Tools for Health: The Efficacy of a Tailored Intervention Targeted for Construction Laborers. Cancer Causes and Control, 18(1):51-59. 11. Knut Ringen, Norman Anderson, Tim McAfee, Susan M. Zbikowski, and Donald Fales. 2002. Smoking Cessation in a Blue-Collar Population:Results from an Evidence-Based Pilot Program. American Journal of Industrial Medicine, 42(5):367-377.Cigarette smoking, obesity, diabetes, hypertension (high bloodpressure), and high blood cholesterol are major risk factors forcoronary heart disease.1Cigarette smoking is also associated with atenfold increase in the risk of dying from chronic obstructive lungdisease.2The adverse health effects from cigarette smoking accountfor nearly one of every five deaths in the United States, more thanby all deaths from human immunodeficiency virus (HIV), illegaldrug use, alcohol use, motor vehicle injuries, suicides, and murderscombined.2Although people are well aware that smoking is harmful,cigarette or tobacco smoking is still widespread, particularly amongproduction (blue-collar) workers. In 2005, nearly 38% of workersin construction trades were current smokers, about 1.7 times that ofall industries (chart 46a). The risk of chronic lung disease and can-cer from smoking is increased among construction workers due toother hazardous respiratory exposures, including welding, silicaand asbestos (seechart book page 43).Obesity also has been linked to stroke, diabetes, and sev-eral other chronic conditions. The prevalence of obesity amongadults, as measured by a body mass index (BMI) rating (seeGlossary), has doubled in the past two decades.3In 2005, about twoout of three (66%) construction workers were either overweight orobese, compared with 59% for all industries combined (chart 46b).Diabetes is a serious chronic illness that greatly increasesthe likelihood of developing disabling health problems and is thesixth leading cause of death in the United States. The risk of dia-betes increases with age. Approximately 10% of the U.S. popula-tion over age 40 and 21% of those age 60 or older have this dis-ease.4During the last decade, the prevalence of diabetes dramati-cally increased among workers in construction trades, particularlyin those over age 55 (chart 46c). Approximately 7% (21 million) ofthe entire U.S. population have diabetes; of those, an estimated 6.2million people are undiagnosed.5According to a medical screeningprogram among construction workers, about half of the diabeticsidentified by the screening did not know that they had diabetes.6High blood cholesterol and hypertension are very com-mon among older adults. About 41% of construction workers age55 and older were diagnosed with hypertension in 2005, and 35%of this age group reported they were told their blood cholesterollevel was high (chart 46d).7High level of blood cholesterol andhypertension are closely associated with a higher prevalence ofheart disease among older construction workers. Heart disease is the leading cause of death in the UnitedStates and a major cause of disability. Almost 700,000 people diefrom heart disease each year, accounting for 29% of all U.S.deaths.8The prevalence of heart disease for construction (6%) isslightly lower than that for all industries (7%; chart 46d).Construction workers are younger on average than workers in otherindustries, and the high physical demands of the work will causemany construction workers with heart disease to leave the work-force (the healthy worker effect). The data may underestimate thetrue prevalence; construction workers with heart disease are 60%more likely to retire on disability than other construction workers.9Worksite health promotion programs have proven to beeffective in other industries, but novel approaches to promotinghealthful behaviors are needed in construction, where workerschange job sites frequently and thus may have limited access toworksite health promotion efforts. Since programs tailored specifi-cally for construction workers to reduce smoking were success-ful,10, 11similar efforts should continue and target other health out-comes, such as reducing hypertension and diabetes in the construc-tion worker population. An important characteristic of these suc-cessful programs was that information about smoking cessationwas integrated into training about toxic exposures at work and/orpresented in a way that was tailored for a blue-collar population.  Asystems approach, focusing on developing workplace policy andpractices to promote health rather than simply focusing on individual behavior, appears to be more effective.10, 1142837_p112_113.qxd  1/28/2008  6:03 PM  Page 112":1}