{"THE CONSTRUCTION CHART BOOK47OSHA's Enforcement of Construction Safety and Health Regulations1. Occupational Safety and Health Administration (OSHA), http://www.osha.gov/dcsp/osp/index.html(Accessed November 2007). 2. John Franklin, OSHADirectorate of Construction (Personal communication, September 2007).3. The 1987 data are from the U.S. Census Bureau. Census of Construction Industries, 1987, United States Summary, Establishments with and with-out payroll. CC87-1-28. 4. March 1990. The 2005 data are from the County Business Patterns, http://censtats.census.gov/cgi-bin/cbpnaic/cbpsel.pl(Accessed November 2007). 4. Knut Ringen. 1999. Scheduled Inspections in Construction: ACritical Review and Recommendations. Report Prepared for The Directorate ofConstruction, Occupational Safety and Health Administration, in response to Contract No. B9F91522, pg. 15. The estimate of employers visited persite excludes state-plan jurisdictions.5. David Weil. 2001. Assessing OSHAPerformance: New Evidence from the Construction Industry. Journal of Policy Analysis and Management,20(4):651-674.6. OSHADirectorate of Training and Education outreach training program guidelines for the construction industry, October 2007,http://www.osha.gov/fso/ote/training/outreach/construction.pdf(Accessed November 2007).7. Occupational Safety and Health Administration. 1997. Strategic Plan: Occupational Safety and Health Administration FY 1997-FY 2002.8. The Lexington Group and Eastern Research Group. 2002. An Estimate of OSHA's Progress from FY1995 to FY2001 in Attaining itsPerformance Goal of Reducing Injuries and Illnesses in 100,000 Workplaces. Prepared for The Office of Statistics, Occupational Safety and HealthAdministration, Washington, D.C., Contract No. J-9-F-7-0043.Since its establishment in 1970, the U.S. Occupational Safety andHealth Administration (OSHA) has been responsible for theenforcement of workplace safety and health standards in theUnited States. OSHAenforces the standards or delegates suchenforcement powers to 22 states and Puerto Rico.1These OSHAstate plans may have more stringent rules than federal OSHAstandards. Since 1994, OSHAhas focused its enforcement effortsin construction on fall protection, in an effort to reduce the lead-ing cause of work-related deaths and injuries in the industry(charts 47a and 47b). (Some scaffolding-related violationsinvolve fall hazards.)OSHAconducted 22,935 construction inspections in2006. Of these, 1,265 (5.5%) covered health, rather than safety,although health inspections were 17% for all industries.2The number of OSHAconstruction inspections hasdecreased while the number of construction employers hasincreased. The number of inspections dropped in the mid-1990s,although it went up in 1997 and has increased slightly since thattime (chart 47c). However, the 22,935 inspections performed in2006 is actually 26% lower than the 31,073 in 1988. Meanwhile,the number of construction establishments (with payroll)increased about 47%, from 536,277 in 1987 to 787,672 in 2005.3Also, the number of worksites visited is estimated to be muchlower than the number of inspections, given that OSHAinspectsan average of 3.5 employers on each construction site visited.4OSHAhad 2,400 inspectors in 2006, including state-plan inspectors, for all industries nationwide.2According to datafrom the U.S. Census Bureau, there were 7.5 million establish-ments in all U.S. industries in 2005.3At best, there is one OSHAinspector for every 3,000 establishments in all industries. Given its limited enforcement resources, OSHAappearsto inspect some types of construction worksites more often thanothers, although data on current trends in OSHAinspection tar-geting are lacking. Using data from OSHAinspection reportsfrom 1987-1993 for the nation's 2,060 largest construction con-tractors, including state-plan jurisdictions, a study found thatOSHAwas likely to inspect union contractors' sites about 10%more than non-union contractors. Study findings showed thatOSHAdevoted \"a substantial percentage of its [enforcement]resources\" to worksites of very large companies, even thoughcompliance inspections of mid-size and smaller companies pro-duced a higher proportion of citations.5This study found that in1993, 30% of the inspections from the sample produced seriousviolations, compared with 46% of all other construction inspec-tions. OSHA's inspection-targeting procedures reportedly havenot changed substantially since the years studied.2 Between 1988 and 2006, penalties per citation increasedsix times, regardless of inflation (chart 47d), for at least two rea-sons. Congress enabled OSHAto increase maximum penaltiesallowable in the system in 1990. Secondly, penalties are listed as\"current\" and, if the fines are appealed, fines may be lowered. Along with enforcement, OSHAhas been working toencourage voluntary compliance by employers. The OSHA\"focused inspection program,\" begun in 1994, is intended toallow compliance officers to spend more time on worksites wheregreater hazards may exist. These inspections only look at the fourleading hazards. In order for employers to qualify for a focusedinspection, they must have already put in place an effective safe-ty and health program. In 2006, 6% of OSHAconstructioninspections were classified as \"focused.\"2Also, in 2006, OSHATraining Institute outreach training courses on safety and healthprovided 10- and 30-hour training for approximately 350,000construction workers.6OSHAalso awarded grants to train hard-to-reach construction workers and those at high risk of gettingwork-related injuries and illnesses. The effectiveness of OSHA's efforts in reducing injuriesand illnesses in construction remains unknown. As OSHAreport-ed to Congress in 1997, the agency has lacked data to showwhether its programs improve safety and health at worksites.7Areport prepared for OSHAin 2002 described efforts to develop ameasure of effectiveness by comparing a site's lost-workdayinjury and illness rates before an OSHAintervention with rates inthe two years following.8The report, however, pointed out thedifficulty of measuring results in construction, given that fewconstruction sites exist for as long as three years.42837_p114_115.qxd  1/28/2008  6:09 PM  Page 114":1}