{"Table 3.2. Auto theft arrests per 100,000 population in each age group in the urban United States, average annual increase in rates, and median age at arrest. 1952. 1960, and 1970 Rates per 100,000 persons1 Average annual increase in rates3 Age group 19521 19601 19702 1952 to 1960 1960 to 1970 Under 15 ............. 30 35 54 2.1 5.4 15 ............. (4) 751 750 (4) -.0001 16 .........Ł... (4) 811 795 (4) -.002 17 ............. (4) 558 631 (4) 1.3 18 ............. (4) 359 417 (4) 1.6 19 ............. (4) 273 313 (4) 1.5 Total, 15-19 .......... 438 558 580 3.4 0.4 20-24 ............. 106 132 178 3.2 3.5 25-29 ............. 54 51 88 -.7 7.3 30-34 ......Ł...... 34 30 52 -1.5 7.3 35-39 ............. 19 21 31 1.3 4.8 40-44 ..........Ł.. 11 13 20 2.3 5.4 45-49 ............. 6 7 12 2.1 7.1 50 and over ........ 2 2 3 .0 5.0 All ages .............. 54 66 98 2.7 4.8 Median age at arrest 17.8 17.0 17.4 JUnear interpolation of 1950 and 1960 census data used for 1952, which was the earliest year of FBI tabulations of urban police arrests by age and offense. 20nly urban data used for 1970 as only urban arrest totals available for earlier years. 3Noncompounded average annual increase rates: first column consists of 1960 rates as percentage increase from 1952 rates, divided by 8; second column consists of 1970 rates as percentage increase from 1960 rates, divided by 10. 4Data not available. NOTE: Age group arrest rates estimated by using FBI arrest totals for U.S. 2,500 population and over and U.S. Census age group data for urban population correcting the latter by the percentage of the U.S. population in the FBI urban reporting area. when the greatest rate of increase in auto theft arrests occurred among those under 15 and over 25, but these changes did not suffice for this offense to cease being the felony most distinctive of adolescence. About 94 percent of arrestees for this offense were males during 1972, a decline from 96 percent in 1962, reflecting the fact that tion with autos still is a sex-linked feature of American culture, although this is slowly changing. 34 '. -i Adolescents mainly \"borrow\" vehicles for a specific trip or for joyriding, then abandon them while older auto thieves more frequently take vehicles for long-term retention or sale. The \"borrow· ing\" results in a high rate of recovery and a low rate of arrest when cars are reported stolen. One might speculate that the greater rate of increase in auto theft arrests at the older age ranges during the sixties reflects improvements in police detection of vehicles stolen for sale or long-term retention; there was a rapid rate of professionalization and of improved transportation and communication in police forces during the sixties (more squad cars, airplanes, and helicopters; better radio systems; speedy computer record checking for registry numbers of stolen vehicles). I t seems reasonable to infer that the increase ill auto theft arrests of those under 15 years of age during the sixties reflects the earlier freedom of juveniles from close parental supervision, for mothers increasingly ceased to work exclusively as housewives; the greater need for autos with the tremendous growth of suburban residence; the near doubling in the number of multicar families, hence increased accessibility of automobiles to steal, especially in residential areas. Theft of money or goods valued at $50 or more was the index crime which had the highest rate of increase in the 1960·70 decade, and as table 3.3 shows, those under 15 years of age had the greatest rate of increase in arrests for this offense. Much of this increase, however, must simply reflect inflation and affluence; there were more portable things to steal each year during the prosperous fifties and sixties, and many more items were priced over $50 when each of these decades ended than when they began. As with auto theft, the peak age in arrest rate fOl' grand theft in 1960 was 16, but by 1970 it had dropped to 15. Although there is a drop in the rate of arrest for grand theft in the late teen ages, this crime's arrest rate does not decline with age thereafter nearly as much as does the rate of arrest for auto theft.. The rate of change in arrest rate for this offense was remarkably uniform for all ages during the sixties. Thirty percent of arrestees for grand theft in 1972 were females, according to the FBI's Uniform Crime Reports, making this offense much less exclusively a male activity than any of the other index crimes. Among arrestees for grand theft who were under 18 years old, 36 percent were females. Ten years earlier, in 1962, the FBI data showed females comprising only 19 percent of arrestees for grand theft and 16 percent of those under 18 among the arrestees. This offense has thus been the major area of women's liberation in criminal activity. It is noteworthy also that although women were increasingly included among those arrested for property offenses, they became a smaller proportion of arrestees for murder and for aggravated assault, although there was some increase in the female percentage of arrestees 35 ":1}