{"---------------------------as corporate predators, will also be pointed out, however, especially in chapters 2 and 8. The focus on demographic trends that distinguishes traditional tactical planning for management control also is to criminal justice planning, but it becomes most useful If guIded by sound criminological knowledge. Pertinent statistics do not just project crime and population trends, but relate them together in a manner that furthers or tests causal explanation of crime trends. Such statistical analysis is necessary for effective criminal justice strategies. The third broad stage in strategic criminal justice planning is to devise policies for the allocation of resources and responsibilities among various agencies, in and out. of the justice system, that are optimum for accomplishing three functions with particular types of offender: identification, modification, and prevention. We shall recognize frequently that practices oriented primarily to only one of these functions may also affect the others, and that preferred strategies for accomplishing any of them will vary with subcategories of offense and offender. By identification we refer not only primarily to police and court functions in the determination of guilt, but also to the classification of offenders for correctional purposes. Since, as we shall point out, correctional concerns often shape even the earliest police and court activities in a case, and since both identification and modification policies vary somewhat with the type of offender, the second and third stages of planning are discussed in the sections of this book on specific kinds of criminals. Any generalizations on criminal justice policy that are true and useful derive their validity from the fact that they are deducible from valid abstract propositions on human psychology and on social relationships. Identifying the grounding of criminal justice policies in more abstract scientific theory facilitates sound revision of plans, prehaps extending them to new subjects or new situations, through understanding the principles on which planned policies have been based rather than applying them in an arbitrary and dogmatic manner. Indeed, all levels of abstractness in knowledge are tested simultaneously and thereby enhanced, only if all levels-from the most abstract general proposition to the most specific statement on a particular case and situation-are conceptually connected so that findings on one level can be interpreted in terms of implications on the other. This broad statement will be illuminated here by relating social and behavioral science theory to the criminal justice policies that concern us. It should be stressed that in the ongoing activities of many zations, especially those of the criminal justice system, decisions cannot wait for absolutely certain knowledge. Responses of police, 8 courts, and correctional agencies to crimes, criminals, victims, and other persons or agencies must instead be made only by whatever seems the soundest judgment available at the moment when action is required. Strategic planners are less pressed for time than operations personnel, but plans also cannot always be deferred until all their details express principles validated by rigorously procured scientific data. Among the distinctive features of strategic policy guidelines such as those in this monograph, however, are the following: (a) Each basic proposition summarizing a policy tion is accompanied by synopses of the evidence and inference on which it is based. (b) The scientific adequacy of this knowledge is indicated. (c) Statements also are made on the types of research needed to reduce deficiencies in this knowledge. This brings us to the final component of the strategic planning process that. will be distinguished here. The fourth stage in strategic criminal justice planning is to provide for steady improvement of planning in the future. This requires procurement of better information for tactical planning as well as sounder ideas and data on which to base strategic plans. Thus, the fourth stage is to plan a knowledge-building apparatus, to try to institutionalize research organizations and procedures for evaluating criminal justice practices, and to deliver feedback on effectiveness to key decisionmakers. This implies that a well-planned criminal justice system is prepared to be self-correcting should its initial plans and policies prove deficient. This fourth stage is the concern of part 4 of this book. This introduction should also point out that a number of topics appropriate to strategic criminal justice planning are not covered in this monograph, which deals mainly with correction and prevention, although touching on the performance of these functions by police and courts as well as by correctional and other agencies. For example, we disc1.!sS procedures for identification of offenders mainly as an aspect of policies for modifying criminal behavior. Yet other aspects of the identification process also are important to the criminal justice system, such as criminalistics (scientific detection and analysis of evidence on crime), as well as efficient and fair court procedures. These are topics that must be left to other writings. Conclusion Several works on planning were quoted, and more could be cited (e.g .. Mayer 1972; Michael 1973) that set forth conceptions of a type of planning that can be called strategic, as most appropriate in an era of rapid change. Strategic plans are based on broad trend projections, not on numerical forecasts. They produce policy guidelines, not 9 ":0}