{"Societal Evolution and Adolescent Segregation The alteration of family roles u.; a result of society's differentiation has produced changes in the social and cultural life of which have far.teaching consequences. Changes ir: family life have made the activities of adolescents in many ways more separate from and more :ontrasting with the activities of adults than ever before, although m some other respects that will be indicated, adolescent roles have become more similar to those of adults than they formerly were. One consequence of societal is that life becomes increasingly age-segregated. When the family performed all major functions, including economic production, education, and recreation, a total social interaction with other people was proportionately more WIth parents or other adults than is customary today (for cultural comparisons, see Eisenstadt 1956). .Adolescents in past decades prepared for adulthood by working WIth adults more often than do today's adolescents. They had more tasks in the. househo.ld or the family business, if not holding part-tIme Jobs. Thelr work In roles like those of adults and in the of began even before they reached physical maturity. A maJorlty termmated school attendance prior to completing high school and they then started full-time unskilled or semiskilled manual labor. Those male adolescents who had prospects of becoming skilled workers started employment as apprentices to craftsmen-bakers, ?utchers: masons, carpenters, printers, and so forth. Girls, especially In the mlddle class, had more limited employment choices and most were oriented to careers primarily as housewives; :my other occupations they could anticipate would be terminated with their marriage, or at least, with their first pregnancy. Those youth who stayed in school through high school or college were then much more ma.le than they are today, especially in college, and they aspIred to whlte-collar employment, generally making their plans :or p.r?fessional early and directing their schooling to fairly speCIfIC tYP2S of occupatlOn. In most cases, however, schooling was terminated early in adolescence and the adult phase of life was then initiated. With great reduction in family businesses, easing of household chores, in.crease in full-time employment of both parents away from home, rehan<>e on schools for a larger variety of education functions and for a longer period, plus more provision of recreation for children and youth in specialized centers for this purpose (both public and commercial), the adolescent generation spends less and less time with M?re ever before, preadults have their closest personal relatlOnshlps With others of their own age and status. 30 ,. , Such evolutionary change in the social stnlcture of adolescent life in the United States is perhaps most conclusively demonstrated by census data on schooling. The median school years completed by the total U.S. population age 25 or older has risen an average of almost 1 school year per decade, from 8.6 school years in 1940 to 12.2 years in 1970 (Bureau of the Census 1970a, PC(l) C1, table 75; 1970b, table 2). Thus by the seventies a majority of the adults in our country had schooling beyond high school, whereas 30 years earlier not much over half had finished elementary school. In some respects, adolescents and even young children have more autonomy today than formerly; being more socially separated, they manage their activities without as much adult supervision and control as previous generations experienced when at the same ages. The schools, especially the h;.gh schools, try to inculcate adolescents with adult values and concerns to such an extent that Friedenberg (1959) blamed them for \"the vanishing adolescent.\" Whether the loss of idealism in adolescence that he deplored was the statistically dominant trend can be debated. Any changes of this type that did occur, however, probably were due mainly to age segregation and to technologically fostered changes in family, school, and occupational roles. Adolescents are economically dependent for more years now than formerly because they remain students longer. The longer period of obligatory or expected school attendance today means a longer period in which youth are physically mature but economically not supporting or spouse-supported. The difference between adolescents and adults in work activities is perhaps: the most fundamental source of the other contrasts between adolescents and adults in today's society. Being in school means for the students being in a separate social world of their own age peers. This is especially true when the school is The longer they are students-from nursery to elementary to hIgh school, and on to college or university-the larger usually is the educational institution they attend, and the more impersonal are the relationships of students to faculty there. Even in elementary levels, but especially in high school and college, school has for some youth ceased to be just a place away from home 5 per week for 6 or 7 hours per day. It is a place that involves many m extracurricular activities through numerous additional hours. Such activities appeal to these students partly because they provide a more personal relationship to teachers than does the typical classroom, and they often offset limited contacts with parents. Students not in curricular functions, and those youth who are truants or dropouts from school and are not employed, are likely to be more separated from adults than the students in extracurricular activities. This 31 ":0}