{"segregation of adolescents in thel! separated social world, plus a reduction in the perceived vocational implications of education for a la.rge fraction of students, have had profound consequences for the attitudes of many youth in today's society. Adolescence, Innovation, and Crime A basic law of sociology and anthropology is that social separation produces cultural differentiation. Therefore, the more the adolescent segment of our population lives in isolation from those who are older, the more likely it is that adolescents will collectively develop unique forms of language, clothing styles, music, and other components of culture, including values-their shared ideas of what is morally good and bad. Some difference in taste among age groups has always existed, but youth today appear to have become more innovative and to have a culture that contrasts more drastically with that of older people than ever before. Thus long hair, unisex clothing, and especially, an unprecedented tolerance of diversity in personal appearance and conduct became widespread among adolescents during the sixties and seventies. Also distinctive of youth, perhaps now more than ever, is involvement in crime. Table 3.1 indicates that of the seven predatory offenses which the FBI calls \"Index Crimes\" and which police generally regard as the most serious offenses, the three most frequent-burglary, grand theft, and auto theft-result mainly in the arrest of adolescents. More than half of those arrested for these crimes are under 18. Before further discussion, one should note the limits of data as a basis for generalization on adolescent participation in these crimes. As tabl;S.1 indicates, less than a fifth o:f the burglaries, thefts, and auto thefts reported to the police are cl:eared by arrest. These cover only thefts of over $50, called grand. theft or grand larceny in most States; it is probable that adolescent:3 are even more involved in smaller thefts. Furthermore, victimization inquiries by public opinion polls indicate that only about a third oj' the victims of burglaries and less than half those who suffer thefts of Dver $50 report the crimes to the police. Juveniles may be a high proportion of the perpetrators of crimes that are not reported, for victims often decline to call the police when kids in the neighborhood are believed to be responsible for a crime, or they do not press charges when juveniles are apprehended, and therefore, arrests are not made. If juveniles predominate among the unarrested offenders, the median ages for burglary, grand theft, and auto theft may be lower than the ages shown in table 3.1. It may well be, however, that adolescents are arrested for a larger proportion of 32 tH , 1 Table 3.1. Median age at arrest, arrest rates, and crimes known to the police; rates for FBI's index offenses, 1972 Rates per 100,000 personsp t f Median 0 Offense 2 C· cnmes age at Arrests nmes cleared by arrest1 known to 4 Murder and nonnegligent manslaughter ...... 26.8 Forcible rape ...... 22.7 Robbery ......Ł... 20.4 Aggravated assault ........... 25.9 Burglary .......... 17.9 Theft (over $50) ... 18.0 Auto theft .Ł...... 17.7 1FBl, 1973, table 32. 2FBl, 1973, table 1. 3FBI, 1973, table 27. 4FBI, 1973, p. 31. 9.4 12.1 68.1 97.0 196.0 423.1 76.0 the police3 arrest 8.9 82 22.3 57 179.9 30 186.6 66 1,126.1 19 882.6 20 423.1 17 Crimes reported to police as percent of crimes reported to pollers5 170 27 65 49 32 44 110 5Based on 1965 opinion poll. The rate of murder in the United States during 1965 was only 5.1 per 100,000 persons, so the 170 percent figure could be caused by chance fluctuations. SOURCE: President's Commission, 1967, table 4, p. 17. some types of crime that they commit than are older offenders, because the adole: ';,,>nts are less deliberate and skilled in planning their offenses anQ Ail avoiding detection and apprehension. In any evenL table 4.1 does indicate that adolescents comprise the major police burden for the most frequent felony predations. As table 3.2 indicates, the most distinctly adolescent felony is auto theft. The peak age of arrest for this crime is only 16. The rats of arrest during the age-range 15-19 is well over three times the rate in the next highest rate 5 year age-span, 20-24, and has usually been 10 or more times as high as the rates at still older or younger 5-year spans. The age differential diminished slightly during the sixties, 33 \" , '.1 ":0}