{"This monograph is one of a series on current issues and directions in the area .of crime and delinquencv. The series is being sponsored by the Center for StudIes of Crime and Delinquency, National Institute of Mental Health, to encourage the exchange of views on issues and to promote indepth analyses and development of insights and recommendations pertaining to them. This monograph was written by a recognized authority in the subject matter field under contract number HSM 42-73·237 from the National Institute of Health. The opinions expressed herein are the views of the author and do not necessarily reflect the official position of the National Institute of Mental Health or the Department 0 r Health, Education, and Welfare. Library of Congress Card Number: 74-600192 DHEW Publication No. (ADM) 75-195 Printed 1975 For sale by Sllperintendent of Documents, U.S. Goverm.1ent Printing Office, Washingtun, D.C. 20402 FOREWORD Strategic Criminal Justice Planning, The second Crime and Delinquency monography by Dr. Daniel Glaser, joins his Routinizing Evaluation: Getting Feedback on Effectiveness of Crime and quency Programs (DHEW Publication No. (HSM) 73-9123, 1973) as an important contribution to the improvement of programs in the juvenile and criminal justice systems. While Glaser's monograph on evaluation focused on the design, conduct, and use of impact studies for improving or eliminating programs in the crime and delinquency field, the current monograph considers the various planning processes needed to reach those goals. In his most recent effort, Dr. Glaser develops a number of L.\"Uportant topics. These include the planning process in our modern, highly complex society; the importance of valid information, and the organization of that information within a conceptual-policy oriented framework; the utilization of available data and research findings; and the generation of additional data when needed. These considerations, along with several theoretical orientations to crime, are developed by Dr. Glaser to make specific suggestions about improving planning as a process in the juvenile and criminal justice systems. Moreover, he develops a set of planning propositions and outlines specific programs to provide guidance to planners and policymakers. As in Routinizing Evaluation, we provided the author complete freedom to develop the various issues on the topic of planning. No detailed specifications or outline were set in advance and no substantive changes have been made by the National Institute of Mental Health. The views expressed are those of the author. SALEEM A. SHAH iii ":0}