{"best done by government agencies that are superordinate to poliee, courts, corrections, and prevention agencies, though receiving advice and information from all of them. This monograph, therefore, is addressed to those concerned with the totality of criminal justice services in a nation, State, or local community, rather than just with a particular type of justice agency or occupation. Furthermore, since criminal justice systems and even total governments are parts of larger systems that we call societies, this monograph is concerned with linking strategic criminal justice plans to trends in society as a whole. The primary source of literature for most current training on criminal justice planning appears to be public administration and business writings on the planning process. While much of this training literature calls for strategic rather than tactical thinking about the criminal justice system, its rhetoric is rooted more in popular \"futurology\" than in rigorous social science; it seldom gets to specifics when exhorting planners to think imaginatively, cally and in systems theory terms. This 'monograph tries to supplement such training literature by showing criminal justice officials more specifically what they can learn for policymaking and strategic planning from the social and behavioral sciences, especially sociology and psychology. In all industrially advanced nations there have been relatively rapid changes in the definitions of crime and in the reactions of the State to offenses as well as in the public's behavior. Strategic criminal justice planning copes with such developments not just by projecting past trends to estimate future demands for correctional services, but by investigating the causes of these trends and their probable modification with new developments in society. In an age of rapid change, predictions cannot be accurate if they are very specific. What is dependable are not statistical projections of current or past conditions, but generalizations on the scientific principles that explain change and permit us to cope with it realistically. Strategic planning is not intended to replace tactical planning, but to subordinate tactics to long-term concerns whenever possible. Although specific projections and budget estimations for personnel recruitment and training, contracted services and construction, for example, will be continuing components of tactical planning, strategic plans give them direction. The strategic plans are statements of objectives to be sought and perspectives to be maintained in spite of the immediate pressures and vested interests or habits that dictate tactics too exclusively; expediency rules most readily when no strategic principles are formulated, or when those that are asserted are not grounded in scientific rationales and data. This monograph presents and tries to justify guideline propositions useful in strategic 6 planning for the criminal justice system of any State, region, or locality of the United States. Of course, this monograph itself is not a plan for any specific jurisdictional area; any such plan will have to be formulated with detailed propositions addressed to the unique history, circumstances, and criminal justice problems of its particular area. Stages of Strategic Planning The first stage in strategic criminal justice planning should be to identify the general principles which determine shifts in the definition of crime and the reaction to offenses. As chapter 2 indicates, patterns in the evolution of criminal law are evident that account for changes in both clientele and objectives of police, courts, and corrections. Analysis of these trends is most useful if it goes beyond description to explanation, for only if change is understood rather than just described can there be a solid foundation, hence less guesswork, when anticipating the future. An. of criminal law changes can approach adequacy only If It takes account of developments in the total society, apart from the justice system. Thus an understanding of societal evolution in our time must be the basis for strategic criminal justice planning if it is to be effective in an age when all anticipations of specific crime rates and State practices must be tentative. These changes too are concerns of the next chapter. The second stage of strategic criminal justice planning is to determine, as rigorously as possible, the causes of the behavior that society designates as criminal. A key aspect of both the first and the differentiation of offenses and offenders along cntICal dlIDensions, so as to identify types that call for variations in planning because of differences in societal reaction to them as well as differences in their causation. Scientific assessment of causal theories requires examination of the empirical evidence that tests these theories. Such assessment will be a concern of the second and third parts of this monograph, each consisting of several chapters and discussing separately four broad types of offender-the adolescent the violent, the addicted, and the adult property offender. ' These types are not set forth as mutually exclusivp .. When persons fit :'nore than one of them, the considerations dIscussed under more than one of these rubrics may be appllcable. Other types could also be differentiated, and indeed further distinctions are made in analyzing these four, but it is that this quartet of broad categories covers the offenders that most con.cern current criminal justice agencies and are likely to be among theIr central problems for some decades to come. Evidence of growing attention of criminal justice systems to other types of offender. such 7 I i I ! I I i I i I i 't W \" ":0}