{"  APPENDIX 3: TIVA ANALYSIS FOR WHOLESALE, RETAIL AND HOTELS, CHINA The OECD/WTO Trade in Value-Added (TiVA) dataset offers the potential for analysis of individual industry sectors of the value added inputs and outputs between different sectors of the economy and can be usefully employed to quantify the inter-relationships between industry sectors connected along the value chain, both goods and services.  The TiVA data can also provide an early signal of a potential structural shift in services intensity in any sector; this is useful given the positive correlation between services intensity and value-added. A drop in foreign services value added content in any exported goods sector, if not more than matched by an increase in local services value added content, can signal a prospective decline in international competitiveness. If the data is sufficiently timely, this can be a useful early warning of a regulatory inefficiency in the services sectors.  Unfortunately analysis of the retail sector is handicapped by the fact that in the TiVA data, retail is aggregated with wholesale and also with hotels and these are each very different activities with different roles in trade transactions. It is nevertheless worth considering the extent to which other industry sectors are contributing inputs into the wholesale and retail sector and to what extent and to track the changes occurring over time. The data also shows whether these intermediate B2B inputs are domestic or foreign and if foreign, from which trading partner they are sourced.  The TiVA indicators similarly enable estimates of the extent to which retailers (aggregated with wholesalers and with hotels) are contributing value added content to total final demand of all the other sectors of the economy. In addition, TiVA indicators show how all this translates with wholesale and also with hotels) of exported domestic value added (DVA). It also shows the extent to which foreign value added (FVA) in retail (and wholesale and hotels) is contributing or not to gross exports and the trends over time.  Figure 1 shows how importantly the combined retail, wholesale and hotels sector figures in aggregated industry grouping actually ranks number 1 in terms of contribution of DVA to gross exports, contributing around to 13.5 percent, followed by ICT and electronics (11 percent) and textiles (7.5 percent). In terms of total contribution to gross exports, wholesale, retail and hotels rank second only to ICT and electronics. ":1}