{" Chapter 7: Policy Implications and Lessons For APEC Members 53   Clarification of anti-unfair trade regulations and enforcement with respect to e-commerce and the online-offline retail business environment, especially potential vertical monopolies and trans-market concentrations of market power. 7.2 GENERAL LESSONS LEARNED FROM CONDUCTING THE STUDY There is no doubt that for such an inter-connected sector, value-chain mapping can be a valuable analytical tool, not only for the business community where such tools are generally applied, but also for policy makers and regulators. Especially now that the retailing landscape is increasingly complex and dynamic, the regulatory regime is best considered and designed with a value chain perspective so that the predicted impact of proposed regulatory changes can be traced through to other sectors of the economy and considered in their entirety.   It is similarly important, in identifying the full extent of trade restrictiveness in any industry, to take into account restrictions affecting other industries intrinsically linked into the value chain. Strategies for structural reform in any one industry need to be developed in keeping with this economywide perspective. Over time, use of the TiVA data offers a new opportunity to trace the impacts of regulatory changes through to their international trade effects.  The retail industry has many different sub-streams. Each of them faces its own unique regulatory challenges. But regulators need to remember that undue regulatory compliance costs experienced at any point along the way, will impact cumulatively along the entire value chain. To undertake a full cost benefit analysis and avoid unintended consequences, regulators need to be able to identify all key parties involved in the retail value chain, identifying the inputs and outputs at each link of the chain and at each point of regulatory intervention.  This study has shown, moreover, that the traditional retail pathway to market is morphing and new and differentiated forks are appearing along the path, even for the same product, and retailers need to accommodate and manage all these different channels. Regulatory polices similarly need to be sufficiently flexible to help deal with the greater variety of potential market failures, consumer protection and other social policy goals, which arise along a morphing value chain. ":1}