{"66 China: Structural Reform in the Retail Services Sector     But the TiVA data adds a new dimension to that earlier conclusion, as it suggests that some local services upgrading has taken place and that other services intermediates contributing to exports in this aggregated industry group are also being provided in a competitive manner by local services firms. This is further confirmed by Figure 5 which shows a small but steady decline over 2008-2011 of imported inputs going into exports of wholesale, retail and hotels. Figure 5: Imported Intermediate Inputs used in Exports, %, by Industry, China  Source: OECD-WTO TiVA database 2015 In its own recent analysis, the OECD concludes that the overall TiVA data for 2011 provides important signals that China is moving upward in the value-chain as the contribution from processing services declines and domestic services providers integrate upstream. Retail is a high value-added upstream services activity. Although the overall figures seem relatively small, it is important therefore to try to dig deeper still to ascertain exactly what the newly what the various imported inputs are, and especially which other services inputs are dominant among them and from which region they are sourced.  While the data does not necessarily provide all the ingredients for a full analysis, it certainly allows some deeper insights. The data identify a relative overall importance for the wholesale, retail and hotels sector of value-added content from Real Estate, Renting & business activities, Financial Intermediation, Post & Telecoms and Transport & Storage.  The figures also tell a potentially policy-relevant story. Within the wholesale retail and hotels sector, as shown in Figure 6, domestic financial intermediation value-added saw an increase of more than 16 fold over the decade to 2011 (compared with just under 16 fold for foreign value added). Foreign Post and telecommunications providers saw a well over 9 fold increase in value added, a slightly greater increase than for domestic value-added. For foreign real estate, renting and business activities grew more than 11 fold (roughly the same as domestic value-added). The domestic value-added contribution from Transport and Storage more than tripled over the decade to 2011 - but foreign value-added more than quadrupled.  0102030405060708090100201120092008":1}