{" Chapter 6: New Business and Regulatory Challenges and Further Structural Reform 49  State Council Opinions were also issued in August 2015 setting out directions for modernization of domestic trade and distribution which is seen as a critical new engine for economic restructuring and transformation of the development model. The Opinions focussed on the importance of eliminating market segmentation and breaking industry monopolies to reduce distribution costs. Development plans cover the Bohai rim region, Yangtze River Delta and Pearl River Delta, and geographic belts such as Shenyang-Changchun-Harbin, Zhengzhou-Wuhan-Changsha, Chengdu--Lanzhou-Urumqi, where distribution-related industries cluster, to construct a series of high-potential interworking cities that would connect domestic and global markets. The domestic distribution sector will also be opened to foreign capitals, with an emphasis on advanced technology, management expertise and commercial models.   September 2015 also saw issue of Guidelines from the State Council on Promoting Online-to-Offline Interaction to Accelerate Innovative Development, Transformation and Upgrading of Commercial and Trade Distribution and on Promoting Modernization of Domestic Trade Circulation and Business Environment for Rule of Law10. The State Council Opinions on online-to-offline interaction encourage retailers to provide community services and diversify the purchase experience of consumers. Physical stores are encouraged to cultivate new online-offline links, such as exhibiting and selling products online while improving offline services such as delivery, to optimize the consumption chain. Internet companies are encouraged to cooperate with physical stores to efficiently connect the information on supply and demand. Attention is drawn to the changes which should also be expected to take place in wholesaling, logistics and other services industries with the increasingly widespread application of mobile internet, big data and cloud computing. The document calls for the creation of smart business areas in cities that can offer interactive online-offline experiences to consumers. E-commerce enterprises are also encouraged to expand in rural markets to help facilitate the free flow of agricultural products to cities and industrial products to the economyside. Financial and fiscal support was made available to boost this initiative.  In November 2015, State Council Guidelines were issued to promote targeted development of open, orderly, reliable and environment-friendly e-business specifically in rural areas by 2020, promoting entrepreneurship and employment of rural residents and alleviating rural poverty. The Guidelines go well beyond e-commerce to e-businesses of all kinds. Supporting policies and measures will be introduced by the government.  In April 2016, State Council Guidelines were announced for implementation of the Internet Plus Distribution Action Plan. The objective is to promote innovation and transformation in distribution services, including e-commerce in rural areas. The guidelines call on promoting the transformation and upgrading of distribution by utilizing technology relating to the Internet of Things and Big Data to achieve online-offline interactions in marketing, payments and after-sales services. The guideline urged strengthening of supply-chain management to achieve cost saving and productivity improvement in the distribution sector.  Some commentators have also called for further digital infrastructure investment and support for a productivity push. The government could consider incentives to expand broadband and 4G+ or even 5G+ infrastructure, especially in rural areas. Consumers have already shown clear enthusiasm, but the technology is lacking in remote areas.                                                   10  ":0}