{"Materials Science and Engineering, R16 (1996) 97-159 Reports: A Review Journal ..,,...,.,,.,..,.....v.v,,:,:.:,:.:.:.:.:.:.:.:.;.:.:.:.:.; Interfacial interaction between low-energy surfaces Manoj K. Chaudhury Department of Chemical Engineering, Lehigh University, Bethlehem, PA 18015, USA Received 31 March 1995; accepted in final form 16 April 1995 Abstract This review is concerned primarily with the correlation between the interfacial interactions and the con- stitutive properties of low-energy organic surfaces. It starts with a discussion on the estimation of the surface free energy of organic solids from contact angles, followed by a review of the surface energetics and adhesion. The experimental measurements of surface free energy, in most cases, are themselves dependent upon the specific models of interfacial energetics and therefore are indirect. A direct method of estimating adhesion and surface free energy is based on contact mechanics, which measures the deformation produced on contacting elastic semispheres under the influence of surface forces and extemaI loads. Since the equilibrium is described by the balance of the elastic and surface forces of the system, the load-deformation data can be translated directly to estimate the adhesion and surface free energies. In most cases however, the contact deformations obtained from the loading and unloading cycles exhibit hysteresis, which are sensitive to the structure and chemical compositions of the interfaces. For non-hysteretic systems, the surface free energies obtained from these contact deformations compare well with the values obtained from contact angles. The application of this method to the studies of dispersion and hydrogen-bonding interaction is reviewed. Keywords: Surface interactions; Interfacial interactions; Adhesion; Hysteresis; Contact deformation; Friction 1. Introduction Wetting, adhesion, friction, crystal growth and many other materials phenomena are owing to the physico-chemical processes occurring within length scales of surfaces and interfaces of a few ang- stroms. Even when the bulk processes dominate a material function, e.g. the rheological adhesion of a pressure-sensitive adhesive, its extensive behavior is often limited by the processes occurring at interfaces. The ongoing attempts of the material scientists to tie together the hierarchy of interfacial phenomena on some common grounds are based on two fundamental properties of interfaces: energetics of interactions and dynamics. Thus it is believed that the adhesion of two different solid surfaces can be predicted from their ability to induce spontaneous spreading of high surface tension liquids, because both the processes are governed by interfacial forces. The friction behavior of solid surfaces, on the other hand, is controlled by the interfacial dynamics, which has some features that are common to the sliding behavior of a liquid drop on a solid surface. Hysteresis is a common occurrence with almost all types of practical interfacial phenomena. For example, the contact angle formed by a liquid on a solid surface depends on whether the drop is growing or decreasing in size. The contact angle of the withdrawing drop is normally lower than that of a growing drop, implying a higher adhesion tension in the former case. Similarly, the forces necessary to separate two surfaces is normally much greater than the forces by which the two surfaces come into contact in the first place. For studies aimed at measuring the thermodynamic properties of surfaces and interfaces, it is highly desirable to use model systems that exhibit negligible hysteresis. In this regard, several carefully prepared organic surfaces have shown great promise. Practical interfacial phenomena are however hardly governed by equilibrium thermodynamic properties. While they pro- vide the necessary driving force for a change to occur, most interfacial phenomena are characterized 0927-796X/96/$$32.00 © 1996 Elsevier Science S.A. All rights reserved SSDIO927-796X ( 95 ) 00185 -9 ":0}