{" Frequency of delayed-type hypersensitivity... 133 Prilozi, Odd. biol. med. nauki XXVI/2 (2005) 131Œ141 The control group consisted of 63 patients with typical psoriasis vulgaris but without palmar and plantar lesions. For each patient a protocol was prepared containing data about personal history, family and past history of other diseases, occupation and domestic circumstances, including topical treatment. Clinical parameters that were considered were sex, age, clinical diagnosis and location of the lesions. The diagnosis was made on the basis of clinical and histopathological examination. Mycological examinations were carried out in most of the cases to exclude tinea. Patch-testing procedures for evaluation of  delayed-type hypersensitivity to contact allergens were examined in all patients. Patch-tests were carried out as soon as the overall disease activity had decreased and the area of the upper back was free from active lesions. The test area was weaned from topical treatment for at least 3 days before testing; only emollients were allowed there. Antihistamines were stopped 1 week prior to testing. The same was the case for systemic therapy (methotrexat, retinoids, cyclosporin) or UV therapy (PUVA/UVB). In the present study, 101 patients with psoriasis were evaluated for the possibility of contact allergy by using a patch-test with European standard series, extended series in some patients and corticosteroid series.  We followed the standard procedures of the International Contact Dermatitis Research Group (ICDRG). All patch-test results were read after 48 and 72 hours: in some pa-tients after 96 hours. Scores of the tests were: + redness, ++ redness and papu-les; +++ redness, papules and vesicles; ++++ reaction with eczema within the test area. Descriptive and analytic statistical methods were used in statistical analysis. Frequency and percentages were used as descriptive methods and  the 2 test method as tables of contingency 2x2 was used as an analytic method.   Results Over a  period of three years, 101 patients with psoriased vulgaris were procesed. According to the clinical and histopathological examination, patients were divided into 2 groups: 38 patients had isolated palmo-plantar psoriasis and 63 patients had a clinical picture (morphology and topography) of psoriasis vulgaris, but without palmar and plantar lesions. Patch-tests were performed on all 101 patients.  The first group consisted of 38 patients (22 men and 16 women) with palmo-plantar psoriasis, additionally verified using histological examination. The laboratory results of all patients in the group were within the normal range. Mycological findings were negative in all patients. All patients had a negative history the atopic constitution and hypersensitivity to some medicaments. Nails ":0}