{"  13 Society for Cross-Cultural Research (SCCR) Annual Meeting, Portland, OR. Qin, S., Xia, J.G., & Xia, Y. (2015, November, accepted). School processes and student disengagement: A national study based on SASS 2011-12 data. Paper to be presented at the University Council for Education Administration (UCEA) annual convention, San Diego, CA.  Xia, Y., Wang, H. P., Do, A., & Qin, S. (2013, November). Family policy in China: A snapshot of 1950-2010. Paper presented at the National Council on Family Relations Annual Conference, San Antonio, TX. Xia, Y., de Guzman, C. Do, A., Qin, S., & Zhang, X. Y. (2013, November) How to make evaluation work for you,  Poster presented at the National Council on Family Relations Annual Conference, San Antonio, TX.  Krehbiel, M., Xia, Y., & de Guzman, M. (2012, October). Helping middle school youth staying in school: Using multiple intervention strategies, Paper presented at the National Council on Family Relations. Xia, Y., Qin, S., Do, A. & Ausherman, K. (2012, October). The influence of parenting factors -analysis. National Council on Family Relations,  Xie, X. l. & Xia, Y. (2011, November). Defying the tradition: Chinese immigrant seniors in separate residence, Paper presented at the National Council on Family Relations Annual Conference, Orlando, FL. Todd, M. & Xia, Y. (2010, November). LGBT family strength and challenges, Paper presented at the National Women Studies Association annual conference, Denver, CO Haiping, W., Zhang, X., Do, A., & Xia, Y. (2009, November). Stressful Life Events, Coping Strategies and Related Social Factors in Chinese College Students, poster presented at the National Council on Family Relations Annual Conference, San Francisco Zhang, X. Yi, C., & Xia, Y. (2009, November). A Path Model for Depression of Chinese Parents of Children with Intellectual Disability. National Council on Family Relations Annual Conference, San Francisco.  Xia, Y., Do, A., Raffaelli, M. & Todd, M. (2008, November). Barriers to the mental health services of Vietnamese adolescents: Family Peprspective. Poster presented at the National Council on Family Relations Annual Conference, Little Rock, AK  Xia, Y., (2008, November). Lenses on resiliency: Asian female professors turning their struggles into empowerment: Cashing in my cultural heritage. Paper presented at the National Council on Family Relations Annual Conference, Little Rock, AK  Wang, H. Zhang, X., Jung, E. & Xia, Y. (2008, November). A longitudinal study of mental health among Chinese college students: From family perspective, Poster presented at the National Council on Family Relations Annual Conference, Little Rock, AK  Todd, M. & Xia, Y. (2008, November). The ones that hit hardest: A Meta-analysis of dating violence. Paper presented at the National Council on Family Relations Annual Conference, Little Rock, AK  Xia, Y. & Wang, C. (2008, March). The Associations among maternal behaviors, parent-adolescent conflict, depression and problems in Chinese adolescents. Paper presented at Society for Research on Adolescence Biannual Meeting, Chicago, IL. Xia, Y. Chinese Parenting and Adolescent Outcomes, Discussant, Society for Research on Adolescence Biannual Meeting, 2008 Xia, Y. & Meng, Y. M. (2007, November). The Relationship between Self-esteem and Problem ":1}