{"71.  What do you think is the single most important environmental issue facing Southwest Florida?  Please circle one.    a.  Water pollution  b. Endangered species  c.  Exotic plants or animals    d.  Wetland destruction e.  Water shortage  f.  Air pollution   g.  Unlimited development h.  Solid waste   i.  Other _______________  72.  What is the 2nd most important environmental issue facing Southwest Florida?  Please circle one.    a.  Water pollution  b. Endangered species  c.  Exotic plants or animals    d.  Wetland destruction e.  Water shortage  f.  Air pollution   g.  Unlimited development h.  Solid waste   i.  Other _______________  Below are a series of personal questions regarding demographic data.  Please place an X in the box for your answer.   1.  Which of the following alternatives characterize your living area?   a.  Rural (not so populated)––––..    b. Urban (very populated) ––––...    2. Which of the following alternatives characterize where you grew up?   a.  Rural (not so populated) –––.–    b. Urban (very populated) ––––...   3.  How many years have you lived in Southwest Florida?   a.  less than 5 years –––––––     b.  5 and under 10 years –––––.     c.  10 and under 20 years ––––...   d.  more than 20 years ––––––      4.   What career field are you interested?   a. Science –––––––––––    b. Social science ––––––––.    c. Arts ––––––––––––.    d. Literature ––––––––––    e. Math –––––––––––...    f.  Undecided ––––––––.–.  g.  Other: _______________.  5.  Which is your most preferred activity for entertainment?   a.  Sports –––––––––––––––––––––––   b.  Outdoor activities such as camping, fishing, boating, etc. ––...     c.  Indoor activities such as reading, watching TV, computers, etc–    d.  Social activities –––––––––––––––––––.    e.  Gardening  –––––––––––––––––––––.    f.  Other: ______________. PLEASE CONTINUE ON THE NEXT PAGE   82":0}