{"Khaled on FSW ANM-112N-05-06 (July 2005) Page 36  Part 2, Metallurgical Features of FSW: Okada et al. 28 looked at the metallurgical features of the FS welded joints of the three aluminum alloys investigated.  They reported features such as weld flash on the advancing and retreating sides, the onion ring pattern, inclusions, underfill and undercut.  The authors, however, appear to define the stir zone as encompassing the region under the shoulder, the nugget and the TMAZ; a reasonable definition.  With this in mind, the authors identify three basic stir zone shapes (Figure 12); viz., the wineglass, bowl and mixed (nearly trapezoidal) shapes.  The authors computed the FSW heat input, Q, using the yield strength of the alloy in question, the travel and rotational speeds and the shoulder radius of the tool.  Some observations were then noted regarding the effect of Q on the shape of the stir zone and on the onion ring pattern.  The authors argue that low Q values give rise to the wineglass stir zone shape, whereas high Q values generally give rise to the bowl or mixed stir zone shape.  Also at high Q values, the onion ring pattern, thought to be the result of some sort of solute banding, either disappeared or became difficult to discern.  The surface width of the weld and its cross sectional area increased with increasing Q.  The same trends were observed for all three alloys, regardless of the alloy source or FSW processor.  The authors propose that the stir zone, initially having an -shape (square butt), develops into wineglass then the bowl shape, with increasing heat input.  Hardness distributions across the joint profiles were determined at mid-thickness for A 5083 and 7N01 joints.  Alloy A 5083 displayed a hardness distribution similar to that depicted in Figure 15 (d), with the peak hardness at the nugget dependent on the alloy source and FSW processor.  Depending on the alloy source and FSW processor, alloy 7N01 displayed one of three hardness distributions.  The first was a  uniform hardness distribution.  The second was a distribution similar to that of Figure 15 (a), with the nugget hardness lower than that of the base metal.  The third was a distribution that is similar to Figure 15 (c), with the nugget hardness higher than that of the base metal.  The differences were attributed to the degree of natural aging between cooling and testing. []s  The authors suggest that certain weld dimensions could be useful in predicting hardness distribution.   Part 3, Tensile Properties: Hori et al. 80 determined the transverse tensile properties of the FS welded joints of the three alloys.  For comparison purposes, this was preceded by a determination of the longitudinal and transverse tensile properties of the stock obtained from each alloy source.  The resulting data (listed in part 2 of the study) indicate that tensile properties tend to vary from one alloy source to the other and that the property scatter bands were noticeably more pronounced for alloys 7N01-T5 and 6N01-T5, compared to those of alloy A 5083-O.  The ultimate and yield strength scatter bands for alloy 7N01-T5 were somewhat wider than their counterparts for alloy 6N01-T5, whereas the % elongation scatter band for alloy 6N01-T5 was significantly wider than its counterpart for alloy 7N01-T5.  The tensile properties of the FS welded joints were influenced by base metal properties; i.e., joint properties depended on alloy source.  The joint efficiency, however, remained essentially the same for each alloy, regardless of alloy source.  In general, joint efficiencies in A 5083 were higher than those in 7N01, which, in turn, were higher than those in 6N01.  To determine the effect of processing, one alloy source was selected for each alloy; viz., # 52 for A 5083, # 61 for 6N01 and # 71 for 7N01.  For A 5083, the changes in FS welded joint properties from one processor to the other were within 10% for the ultimate strength, 7% for the yield strength and 85% for the % elongation.  Joints FS welded by # 1 and # 2 processors failed within the stir zone, due to thinning effects.  Joints FS welded by # 3 processor (0 tilt) failed at the edge of the stir zone, due to stress concentration effects.  Joints FS welded by # 4 processor failed at the base metal.  For 6N01, the changes in FS welded joint properties from one processor to the other were within 20% for the ultimate strength, 23% for the yield strength and 40% for the % elongation.  Joints FS welded by all four processors failed in HAZ, at the weld interface, due to thinning and to strain localization within the HAZ.  For 7N01, the changes in FS welded joint properties from one processor to the other were within 10% for the ultimate strength, 8% for the yield strength and 130% for the % elongation.  Joints FS welded by # 1 and # 2 processors failed within the stir zone.  Joints FS welded by # 3 (0 tilt) and # 4 processors failed in the HAZ.  It is recalled here that there were no post weld heat treatments.  In view of the tendency of 7xxx alloys to naturally age for extended periods of time, the authors should have indicated the time elapsed from welding until tensile testing was actually performed on the 7N01 joints.  The same concerns apply to the hardness data reported for alloy 7N01 in part 2 of the study.      Part 4, Formability: Hashimoto et al. 81   assessed formability transverse to the weld joints by a plunger-type bend test, without removal of the weld flash.  Both face and root bend tests were used, and formability was expressed in terms of (bend diameter / 2) x thickness.  Base metal (alloy source) and processing details (processor) had some effect on 6N01, but not on the other alloys.  Formability of 5083 was better than the other two alloys.  Correlations were made between formability and local tensile %                                                        [s] It is thought that there are additional potential culprits here.  First is that the exact elemental constitution of any given alloy is likely to vary from one material source to the other.  Minor compositional differences can influence how the alloy reacts to FSW, thereby affecting microstructure and hardness.  Second is the fact that different FSW processors use different tooling and different processing parameters.  These differences are likely to lead to different temperatures, strains and strain rates, which, in turn, would lead to different microstructures, hence different hardness distributions.  ":1}