{"Khaled on FSW ANM-112N-05-06 (July 2005) Page 67  A1.2 Fatigue & Fracture Mechanics Testing  Butt joints can be fatigue tested to generate S-N type data, using transverse or longitudinal specimens (Figure A1 and section A1.1).  Specimens may also be excised from certain regions (Figure A2), to generate region-specific data.  S-N fatigue specimens may be round (axial and rotating beam tests) or flat (axial and bending tests).  Butt joints can also be tested to generate fracture mechanics information, such as fatigue crack growth data (da / dN), using the compact tension specimen, Figure A3.  The notch may be aligned with any direction of interest, Figure A4, to generate region-specific data.     Figure A4: Notch along (a) and normal to (b) joint centerline.(a)(b)   Figure A3: The compacttension specimen.             A1.3 Shear Testing  Ultimate shear strength data can be generated by single-shear testing, using thin flat specimens.  The specimen contains side notches oriented in such a way that, when the specimen is loaded in tension, fracture would be guided along a ﬁshear path,ﬂ Figure A5.  This type of test is ideal for generating shear strength data for specific regions or interfaces in butt joints, simply by placing the shear path at the desired location, along the direction of interest, Figure A6.  No yield or elongation data are obtained in this test.      (a)(b)Figure A6: Shear path oriented along the center of the joint (a) and along one of the joint edges (b).Figure A5: Single-shear test specimen.  Block arrows indicate loading direction.Shear PathNotches                  A1.4 Bend Testing  In the FSW work reviewed here, bend testing was used to provide qualitative, as opposed to quantitative, information about longitudinal and transverse joint ductility.  The tests can be designed so that the outer fiber tension is at the face, root or side of the weld.  The results are expressed in terms of the minimum bend radius that can be used, or the maximum outer fiber elongation that can be sustained, without cracking.  Bending may be performed over a mandrel, or by using means such as a plunger-die combination or simple beam loading.     A1.5 Impact Testing  Impact data is typically generated using Charpy (V-notch) specimens.  Here, the notch may be aligned with any desired direction, to obtain region-specific information.  ":0}