{"Khaled on FSW ANM-112N-05-06 (July 2005) Page 69 Figure A13: Peel test as shop control means.  (a) Grip.(b) Bend one leg.(c) Apply peeling force(block arrow) till fracture. Figure A13: Peel test as shop control means.  (a) Grip.(a) Grip.(b) Bend one leg.(b) Bend one leg.(c) Apply peeling force(block arrow) till fracture. (c) Apply peeling force(block arrow) till fracture.   Figure A12: Tension-shear testing of spot joints.Block arrows indicate loading direction.Weld LocationFigure A12: Tension-shear testing of spot joints.Block arrows indicate loading direction.Weld LocationWeld LocationWeld Location              A2.2 FS Welded Joints   There is considerable interest within the FSW community in joining two overlapping sheet or plate members in the lap configuration.  In the work reviewed in this document, joining was accomplished by means of continuous or localized welds.  Respectively, the resulting joints are referred to as lap and spot joints.  Strictly speaking, both are lap joints.  In what follows, however, they will be identified as lap and spot joints.  It is worth noting that, in conventional welding, the corresponding joints would be referred to as fillet and spot joints, for the continuous and localized welds, respectively.  FS welded lap and spot joints may be tested by tension-shear or by peel.  In the lap joint work reviewed here, the double-lap-tension-shear test was not used.  Most authors used the single-lap-tension-shear test, Figure A11 (a), to generate strength and S-N fatigue data for their lap joints.  However, some authors A5, A6 used a special tension-peel test, Figure A14, to generate strength data; this test is not listed among the standard tests used for conventional welds.  In the spot joint work reviewed here, only tension-shear testing was used, and it was only used to generate strength data.   Figure A14: A non-standard  tension-peel test.  Block arrows indicate direction of loading.  Figure A14: A non-standard  tension-peel test.  Block arrows indicate direction of loading.   In single-lap-tension-shear testing, bending stresses develop as a result of the offset between the axes of the lapped members.  Thomas et al. A7 graphically depicted the subject bending, Figure A15, pointing out that the maximum bending tensile stresses occur around the weld joint, at the bottom of the top member and at the top of the bottom member.  These bending stresses would add to test severity, regardless of whether the test is being used to generate static (strength) or dynamic (fatigue) data.  As pointed out by Cederqvist and Reynolds, A8 it is necessary to provide the single-lap test specimens with packing pieces in the grip regions, Figure A16, in order to balance the offset axes of the lapped details, and minimize bending effects.  Thomas et al. A7 also used packing pieces in their single-lap-tension-shear testing. The other authors cited in this document did not explicitly indicate that packing pieces were used with their single-lap specimens.    Top MemberBottom MemberBottom MemberTop MemberMaximum Bending TensileStress (Bottom Member)Maximum Bending TensileStress (Top Member)Figure A15: Bending in single-lap-tension-shear testing.Top MemberBottom MemberTop MemberBottom MemberBottom MemberTop MemberMaximum Bending TensileStress (Bottom Member)Maximum Bending TensileStress (Top Member)Bottom MemberTop MemberMaximum Bending TensileStress (Bottom Member)Maximum Bending TensileStress (Top Member)Figure A15: Bending in single-lap-tension-shear testing. Figure A16: Packing pieces in single-lap-tension-shear specimens.Packing PiecePacking PieceFS WeldFigure A16: Packing pieces in single-lap-tension-shear specimens.Packing PiecePacking PieceFS WeldPacking PiecePacking PieceFS Weld            A3.0 Issues in Testing   Booker et al. A9 point out a fundamental problem in tension-shear testing of single-lap joints.  They indicate that loading would lead to a stress state that is a combination of shear and peel stresses.  Accordingly, the strength data generated cannot be directly compared to base metal ultimate tensile strength, obtained in a tension test, or seen as pure shear strength, if failure occurs through the weld; it is thought that this problem is also applicable to     ":0}