{"Khaled on FSW ANM-112N-05-06 (July 2005) Page 35  a threaded pin (tool B) was used to produce the defect-free welds.  The authors explain that the presence of a thread, rotating in the proper direction, affects rotational flow and effectively eliminates pores.  A byproduct of the threaded pin tool is the formation of the onion-ring pattern within the nugget; welds produced by the simple tool lacked the onion-ring pattern.  Welding was performed parallel to the rolling direction.  However, for 2024 joints welded with tool A, welding was in the transverse direction.  The authors list some weld parameters and the resulting transverse tensile properties of the joints, as well as hardness distributions across joint profiles at midthickness.  Unless otherwise stated, testing was performed in the as welded condition, presumably after all natural aging had seized.  For both alloys welded with tool A (simple), the hardness distribution was similar to that depicted in Figure 15 (a) with the maximum nugget hardness lying within the hardness band of the base metal.  For 2024 welded with tool B (threaded), the hardness distribution was similar to that depicted in Figure 15 (c), with the maximum nugget hardness somewhat higher than the base metal hardness range.  For 6013 welded with tool B (threaded), the hardness distribution was similar to that depicted in Figure 15 (a), with the nugget hardness significantly lower than the base metal.  FCP tests were carried out in the as welded condition, except those for alloy 6013 produced by tool A, which were artificially aged to the -T6 temper after FSW.  Most of the tests were performed on compact tension specimens (ASTM E 647); some tests utilized center cracked specimens.  The notches / cracks were oriented along the center of the weld.  A simple approach, based on the cut-compliance method, was used to incorporate residual stress effects in crack growth data.  The results indicated that the presence of pores had limited effect on da/dN- K behavior of the welds, and that the effect of residual stresses  was the more significant.  Accordingly, the authors warned that ignoring residual stresses could lead to nonconservative estimates of FCP behavior.  A group of authors 28, 79-81 reported on a four-part study of same-metal FSW of 0.12 in. thick sheet stock of three aluminum alloys.  One important aspect of the study was to examine the effects of changing material suppliers and FSW processors.  The alloys investigated were A 5083-O, procured from two sources (#51 and #52), 6N01-T5, procured from three suppliers (#61, #62 and #63) and 7N01-T5, also procured from three sources (#71, #72 and #73).  A 5083, 6N01 and 7N01, respectively, are Japanese alloys similar to AA 5083, AA 6063 and AA 7004.  FSW was performed by four licensed processors, each using his own tools and welding parameters.  Of these, three (#1, #2 and #4) used conventional processing with tilted tools and one (#3) used zero tilt; a zero tilt suggests that a scroll shoulder was used (Figure 13).  The authors did not disclose any other weld parameters or tooling information, and the weld direction was not indicated.  No post weld heat treatments were used.  Part 1 of the study deals with NDI and imperfections, part 2 with metallurgical features, part 3 with tensile properties and part 4 with formability.  The work includes comparisons with GMAW and GTAW that will be excluded here.   End View (D-Scan)Side View (B-Scan)Top View (C-Scan)Figure 24: Basic scan directions.  Part 1, NDI: Oiwa et al. 79 used the ultrasonic phased array method to image the cross-section (D-scan) and the face and root (C-scan) of the welds.  This was supplemented by metallography, to ascertain the type and extent of each defect detected by the scans.  It is reported that the flash on the weld face resulted in noise signals and interference.  As such, removal of that flash is recommended, if only face scans were to be used.  If removal is not carried out, then the welds should be scanned from both the face and root sides.  Using this ultrasonic phased array method, the authors indicate that it was possible to detect subsurface cavities that are undetectable by radiography or penetrant inspection.  The method was also capable of detecting opening lack of penetration, where an actual separation (gap) exists; in this regard, the method would be similar to penetrant inspection.  Finally, the method enabled the detection of closed imperfections, such as the closed lack of penetration and the kissing bond defects.  The authors seem to refer to closed lack of penetration defects as kissing bonds, and classify both as occurring near the root side of the weld, as a result of large penetration ligaments (defined in 5.2).  It is appropriate at this point to review some NDI work by other authors.  Lamarre and Moles 82 investigated the use of the ultrasonic phased array method for the inspecting FS welded aluminum alloy sheet and plate in the 0.2-0.4 in. thickness range.  The defects inspected for were lack of penetration, wormholes, kissing bonds, and faying surface and root defects; unfortunately, no metallographic or schematic depictions of these defects were published.  In general, the method was capable of detecting all defects.  Figure 24 shows the three basic scan directions defined by the authors; it is noted that the D-scan direction is different from that indicated by Oiwa et al. 79  In related work, Oosterkamp et al. 21 discussed the parallel between the kissing bond phenomenon in FS welds and extrusion welds of aluminum alloys, and performed SEM analyses of kissing bond fracture surfaces.  The authors argue that the major cause for kissing bond formation in FSW is the insufficient stretch of the material caused by sliding, rather than sticking, friction on the pin; the authors indicate that the work of Colligan 11 supports their arguments.  ":0}