{"Khaled on FSW ANM-112N-05-06 (July 2005) Page 68  A2.0 Lap & Spot Joints   In this section, it is necessary to trace FS weld joint testing back to its origin in conventional weld joint testing.  The need for this is brought about by the very use of the terms lap and spot joints in the FSW literature reviewed.      A2.1 Conventional Fillet & Spot Joints A1, A3, A4  In conventional (fusion) welding, a fillet joint is obtained by depositing a fused weld filler, approximately triangular in shape, to join two surfaces or members approximately at right angles to each other in a lap, T or corner joint configuration, Figure A7.  A spot joint is obtained without filler between two overlapped members, usually in the lap configuration; spot welds can also be used with T and corner joint configurations.  The joint may exist only at the interface between the two members, Figure A8, as would be the case in resistance spot welds.  Alternately, the joint may penetrate to various depths into the lapped (bottom) member, Figure A9, as would be the case in arc or laser spot welds.     Figure A8: Spot lap joint.  Joint isat interface.Top MemberBottom MemberFZInterface (c)Figure A7: The lap (a), T (b) and corner (c) fillet joint configurations.(b)(a)       The tension-shear test is used extensively to generate data for fillet and spot welds.  For fillet welds, two basic types of specimen are available.  The first is the longitudinal-tension-shear specimen, Figure A10.  The second is   Figure A10: The longitudinal-fillet-weld-tension-shear specimen.  Block arrows indicate loading direction.Figure A10: The longitudinal-fillet-weld-tension-shear specimen.  Block arrows indicate loading direction. Figure A9: Spot lap joint.  Joint penetrates into bottommember.Top MemberBottom MemberFZ            the transverse-tension-shear specimen, which may be of the single-lap or double-lap configuration, Figure A11.  The double-lap test specimen is preferred, since it prevents the bending effects associated with single-lap specimens, and it also minimizes data sensitivity to preparation parameters, such as the gap between the overlapped members.  Ultimate shear strength data may be expressed either in psi / ksi, based on fillet throat (where fracture is expected to take place), or in lbs per lineal inch of the fillet weld.  No yield or elongation data are obtained here.  The transverse-single lap-tension-shear type of specimen, Figure A11 (a), is often used generate axial fatigue S-N data.  Variants of the longitudinal-weld-tension-shear specimen of Figure A7 may also be used for the same purpose; however, no illustrations are given here.   (a)(b)Figure A11: The transverse-fillet-weld-tension-shear specimens.  Block arrows indicate loading direction.(a) Single-lap configuration.(b) Double-lap configuration.(a)(b)Figure A11: The transverse-fillet-weld-tension-shear specimens.  Block arrows indicate loading direction.(a) Single-lap configuration.(b) Double-lap configuration. A conventional spot weld is generally tested in tension-shear or in peel.  The tension-shear test utilizes the single- lap specimen, Figure A12, and it can be used to generate strength or fatigue data.  The peel test is used mainly as a shop control test, and it utilizes manual means to grip and apply the pealing force, Figure A13.  The peel test appears to be mentioned only in conjunction with spot joints that exist at the interface between the overlapped details.       ":0}