{"270The Plant Cell1 2 366.0-*45.0-a29.0-25.0-Figure 4. Purification of Arabidopsis GluTR.The entire HEMA cDNA sequence was cloned in pET15B for T7 RNApolymerase overexpression in E. co/i as a histidine-tagged protein. Cellswere transformed with the construct and induced with isopropyl-p-D-thiogalactopyranoside (IPTG). Approximately 5 ng of protein from the extract was analyzed on a 10% SDS-polyacrylamide gel by electropho-resis. Lane 1 contains cell extract before IPTG induction; lane 2, cellextract after induction with IPTG; lane 3, eluate from an Ni-NTA agarosecolumn. The lower molecular mass (given in kilodaltons) results fromthe cloning strategy that truncated part of the leader sequence. Arrowindicates the 53-kD protein.structure (see Figure 2) found in ADP binding proteins(Wierenga et al., 1986). This structure is composed of a set of 11 amino acids that folds to form a pa(3 fold for the binding of ADP moiety.Expression Patterns of HEMA and GSA1 rnRNAThe tissue distribution of HEMA and GSA1 mRNA was exam-ined through RNA gel blot analysis. As shown in Figure 5, thetranscript of GSA1 (~1.8 kb) is present in all tissues examined(root, stem, leaf, and flower) in approximately the same abun-dance, whereas the expression of HEMA (with a transcriptlength of 1.85 kb) was found to be slightly more in leaves.The effect of light on the steady state level of HEMA andGSA1 mRNAs was measured in etiolated seedlings. In re-sponse to light, the GSA1 mRNA level initially dipped and thenincreased, such that seedlings exposed to 24 hr of light ex-hibited a GSA1 mRNA level noticeably greater than thatexhibited by dark-grown seedlings, as shown in Figure 6. Incontrast, HEMA mRNA remained at undetectable levels throughout the course of the experiment (data not shown). Induction of HEMA and GSA1 mRNA levels by light was also examined in mature Arabidopsis plants. The various treatments employed prior to RNA extraction are summarized in Figure 7,and the HEMA and GSA1 mRNA levels in the plants after thevarious treatments are shown in Figures 8A and 8B, respec-tively. HEMA and GSA1 transcripts were present in plants thatwere grown in light. Exposure of plants to dark resulted in thecomplete disappearance of the HEMA transcript, whereas theGSA1 transcript was expressed at a considerably lower levelthan in the original plants. Transcripts of both genes reappearedwhen dark-grown plants were transferred to light. Reexposureof plants to the dark resulted in complete inhibition of HEMAtranscription, whereas the transcript of GSA1 was significantlydiminished. On the other hand, the mRNA levels of the HEMAR L S FThe Arabidopsis HEMA Gene Encodes a FunctionalGluTRBiochemical studies suggested that GluTR is the product ofthe E. co/i hemA gene (Verkamp et al., 1992). The ability ofthe Arabidopsis HEMA gene to bestow viability on an E. colihemA strain and the significant homology between the bac-terial and Arabidopsis genes suggested that the cloned HEMAgene encodes a functional GluTR enzyme. To demonstrate thatHEMA encodes GluTR, we constructed a histidine-taggedHEMA cDNA gene in a T7 RNA polymerase vector (Studieret al., 1990) and expressed it in E. coli. A 53-kD protein wasvery abundant only in the S-100 extract of the transformed strainand could be purified significantly by an Ni-NTA affinity column,as shown in Figure 4. When GluTR activity was tested understandard assay conditions with E. coli Glu-tRNA, the extractof the transformed cells had a specific activity of 3.4 pmol ofALA per mg (versus 0.18 for the untransformed strain), whilethe purified protein had a specific activity of 12 pmol/mg. Thus,the Arabidopsis HEMA gene encodes a functional GluTR thatrecognized E. coli tRNAGlu.Figure 5. Expression of HEMA and GSA1 Genes in Various Tissuesof Arabidopsis as Detected by RNA Gel Blots.Total RNA (20 Hg per lane) isolated from different parts (R, roots; L,leaf; S, stem; F, flower) of 5-week-old Arabidopsis plants was blottedand hybridized with 32P-labeled probes.(A) HEMA gene (600-bp Nhel fragment of pAH1).(B) GSA1 gene (1.6-kb Apal-Kpnl fragment of pGA1).(C) Arabidopsis 18S rDNA (1-kb EcoRI-BamHI fragment of pPD-55).":0}