{"Light Regulation of ALA Synthesis 267 polyadenylation signal, AATAAG, is found 12 bases down- stream of the UAA translation termination codon of the HEMA gene. A similar sequence, AAGAAA, is present 181 bases downstream of the UAG stop codon in the GSAl gene. Genomic DNA gel blot analyses (data not shown) suggested that the GSA7 gene exists as a single copy in the Arabidopsis genome. This conclusion was drawn from the observation that the GSA7 probe hybridized to a single genomic fragment in each of four restriction enzyme digests. On the other hand, the HEMA probe hybridized very strongly to fragments of the expected size but also weakly to one or two larger fragments in each digest. This pattern was found to be reproducible. Thus, we cannot at present define the number of HEMA genes in the Arabidopsis genome. However, given the weak signal, the cross-hybAdizing DNA fragments presumably have some se- quence divergence. This also means that the strong signal detected on RNA gel blots with a HEMA cDNA probe is the corresponding mRNA (see below). The transcription start site for GSAl has been mapped to 82 nucleotides upstream of the translation initiation codon ATG by primer extension and confirmed by S1 nuclease protection analysis (data not shown). There is a putative TATA box 33 nucleotides upstream of the transcription start site. Nucleo- tides -103 to -77 represent a region that is exclusively A+T, part of which shares significant similarity with AATATTTTTATT, the consensus sequence for the AT-1 box found in light- responsive promoters (Datta and Cashmore, 1989; Gilmartin et al., 1990). The exact transcription start site for the HEMA gene could not be determined because primer extension experiments yielded multiple products. Nevertheless, a number of motifs similar to the consensus sequence (PyAPyPy) around the tran- scription start site (usually adenine) (Breathnach and Chambon, 1981) were found. The other characteristic motifs present in the HEMA gene are numbered with respect to the translation start site. A TATA box (-339), a CCAAT box (-440), and severa1 light-responsive elements, such as 3AF1 (-341), and a GATA box (-287, -466, and -474) were found in the 5' untranslated region of the HEMA gene. It is interesting to note that the 3AF1 box was juxtaposed to the TATA box as de- scribed previously (reviewed in Gilmartin et al., 1990). Comparison of the HEMA- and GSA7-Encoded Proteins with Corresponding Proteins The amino acid sequence deduced from the open reading frame indicated that the HEMA gene product consists of 544 amino acids with a molecular mass of 60 kD, as shown in Fig- ure 2, whereas the GSA7 gene encodes a protein of 474 amino acids with a calculated molecular mass of -50 kD, as shown in Figure 3. The deduced amino acid sequences of the encoded proteins are shown (Figures 2 and 3) aligned with the corre- sponding enzymes from other sources. The GSA7 gene exhibits strong sequence conservation over the entire length. The ly- sine important for binding the cofactor pyridoxal phosphate (Grimm et al., 1992; llag and Jahn, 1992) and the surrounding amino acids are highly conserved in the seven GSA-AM pro- tein sequences known to date (Figure 3). The degree of similarity is consistent with the species' phylogenetic relation- ships. The Arabidopsis enzyme is most similar to the soybean GSA-AM (790/0 identity); next in similarity is the barley homo- log (78% identity) followed by the enzyme from the cyanobacterium Synechococcus (69% identity); least similar are the B. subtilis, S. typhimurium, and E. coli proteins (55 to 58% identity). In the case of the HEMA gene product, sequence conservation is much lower. The HEMA-derived Arabidopsis protein sequence shows considerable similarity (e.g., 32% identity with the E. coliprotein) including a stretch of 23 amino acids with 52% identity with hemA-encoded proteins from other sources. This region contains the Cys-Tyr change that is the cause of the B. subtilis HemA phenotype (Petricek et al., 1990). Because GluTR and GSA-AM proteins are chloroplast- targeted enzymes in photosynthetic eukaryotes, the Arabidop- sis enzymes are expected to have a transit peptide at the amino terminus that is absent in the corresponding prokaryotic pro- teins. Examination of the Arabidopsis sequences (Figures 2 and 3) shows this to be the case. The transit peptide cleavage site has been empirically determined for the barley GSA-AM (Grimm, 1990), and the corresponding site in Arabidopsis GSA- AM is predicted to be after the 37th amino acid based on the alignment in Figure 3. Interestingly, the barley and Arabidop- sis GSA-AM proteins are least similar in their transit peptides in both amino acid sequence and composition. This disparity in transit peptide sequence is not totally unexpected because transit peptides are in general highly variable in sequence and are thought to fold into a common three-dimensional motif that is recognized by the chloroplast import machinery (von Heijne et al., 1989). In the alignment in Figure 3, the transit peptides are 25% identical. The barley transit peptide has a prepon- derance (62%) of nonpolar amino acids (A, L, I, V, P, F, W, and M), whereas the Arabidopsis transit peptide contains many (54%) polar amino acids (S, T, Y, Q, C, and G). The Arabidop- sis transit peptide is similar to most other transit peptides when the fraction of serines and arginines is considered (von Heijne et al., 1989). Another difference between the two transit pep- tides is their cleavage sites. The cleavage site for the barley enzyme perfectly fits the consensus sequence, (V/I)X(A/C).1A (von Heijne et al., 1989), whereas in GSA7, the proposed cleav- age site or any surrounding sequence lacks resemblance to the consensus. The HEMA-deduced amino acid sequence also displays a long amino-terminal extension with a characteristic amino acid composition of chloroplast transit peptide sequence. This re- gion shows two amino acid sequences (NAAS) and (NSAA) that are similar to the signal peptidase recognition sequence. Although GluTR binds tRNA in a sequence-specific fashion, a property shared with aminoacyl-tRNA synthetases, no similar- ities in amino acid sequence were found. Probably this reflects s the fact that there are no distinguishing characteristics of a tRNA binding site (unlike that for ATP) in the synthetase fam- ily. However, GluTR enzymes display a characteristic fingerprint ":0}