{"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 132 -   Importance of TNA in the ADP: The reasons why TNA is important in the ADP as given by all the interviewees in the trainers group were:  For the development of employee skills so they could do their jobs and assist in developing future training plans  To improve and promote the work performance to ensure the quality of the work undertaken  To raise the efficiency of employees, to develop training plans as needed, and to estimate the budget for training  To discover the extent of the development work required to meet the strategy of the ADP and increase work efficiency  To improve employees performance and consequently, organisational performance  To provide individuals with the skills required for developing the organisation in general.  To determine the training needs of departments and their employees  To obtain sufficient information to help raise the performance of the organisation and to discover the skills needed for their employees  Levels of TNA in the ADP: In answering the question relating to the levels that are used in conducting TNA in the ADP, six of the interviewees in this group said that all the levels are considered: organisation, task/operational, and person/individual  analysis. However, the other five interviewees believed there was a greater emphasis on the person/individual level than on the other two levels.  Method of Assessing Training Needs: Table 6.13 shows the methods used in the ADP to identify the needs of the trainees, according to the trainers, with data presented according to percentages. Table 6.13: Methods of Assessing Training Needs Training Need Assessment Methods Yes % Through job descriptions for individuals in your organisation 11 100 Group interviews with managers and supervisors 8 73 Direct Observation  8 73 Performance appraisal information or results 8 73 Skills, Knowledge, and Abilities (KSAs) tests 6 55 Questionnaires 5 45 Personal face-to-face interviews with employees 5 45 Determination through special training committee 4 36 N= 11, Source: Fieldwork(2011-2012) ":0}