{"Chapter Six: Data Presentation, Discussion and Analysis 2014  - 126 -   Perceptions on TNA Practices: In answering the question relating to the overall perceptions of TNA practices in the ADP, the interviewees responded as shown in Table 6.7.(Data are presented according to the highest percentage).  Table 6.7: Perceptions of TNA Practices Overall Perceptions Regarding TNA Practices  Yes % TNA emphasised in organisations training practices to ensure training effectiveness 19 95 TNA ensures that organisational needs linked with employees needs 17 85  17 85 The management of this organisation believes that TNA process are cost- effective 17 85 The management of this organisation believes that TNA is central for improving the training effectiveness 17 85 Top managers are committed to the TNA function 16 80 It provides a benchmark for evaluating training and records the justification for the training budget. 15 75 TNA is lack of skills, knowledge and abilities (KSAs) and problems caused by other factors. 15 75 TNA methods are used by the ADP to produce clear, relevant, specific data on performance discrepancies 15 75 TNA methods are used by the ADP to make it possible to distinguish between training that employees need and training that they want 13 65 The present volume of TNA is adequate to solve your current problems 13 65 Training needs will only be fulfilled if they are in line with the organisations strategic needs 12 60 N= 20, Source: Fieldwork(2011-2012)   Section C: Training Decisions This section, provides information on how training decisions concerning who should attend, and what the training programmes should consist of, are made.   Involvement in selecting the trainees: In answering the question relating to the selection of trainees, eleven of the twenty interviewees said that they personally were involved in the process, whereas the nine remaining said they had no involvement whatsoever.  Methods of selecting employees for training: In answering the question relating to the methods of selecting employees within the ADP for training initiatives, the interviewees presented their responses in six categories, which are shown in Table 6.8, and are ranked according to the highest percentage responses.  ":0}