{"The sensitivity of medical data requires networks to guarantee the security and reliability of cloud services. Data centers need to support multi-point disaster recovery, remote backup, high availability data storage, and data security protection mechanisms.As there are a large number of grassroots medical institutions and community hospitals, and as they are scattered around the country and use different access modes, the transmission network must support multiple access modes and offer wide coverage and full mesh.The medical imaging cloud is mainly used in business applications in China, including in hospitals at all levels, medical groups, medical institutions, government hospitals, and third-party independent imaging centers. Due to the influence of national healthcare policies, the development of customer applications is difficult. Therefore, the related medical policies need to be relaxed and the related technologies need to be promoted.Five typical application scenarios of the medical imaging cloud are as follows: Cloud image storage, image cloud application, Cloud-based medical collaboration, Cloud-based medical education, and Cloud-based health management.The medical imaging cloud provides applications such as big data storage, elastic expansion, and flexible sharing, all of which require a good transmission network. This places a new requirement on networks.Summary of Medical Imaging Cloud Scenarios04Scenario CategoryApplication ScenarioCloud image storageImaging cloud applicationCloud-based medical collaborationCloud image storageCloud image archivingCloud image backupCloud-based health managementPersonal image fileOnline image consultationRemote health monitoringFull medical and technical imaging cloud PACSCloud image readingMobile image cloudCloud-based medical educationDoctor trainingSurgery live broadcastDoctor examinationMulti-hospital morning readingRegional imaging centerRemote imaging centerRemote image diagnosisRemote image consultationMDT clinical multi-disciplinary collaborationThe sensitivity of medical data requires networks to guarantee the security and reliability of cloud services. Data centers need to support multi-point disaster recovery, remote backup, high availability data storage, and data security protection mechanisms.As there are a large number of grassroots medical institutions and community hospitals, and as they are scattered around the country and use different access modes, the transmission network must support multiple access modes and offer wide coverage and full mesh.The medical imaging cloud is mainly used in business applications in China, including in hospitals at all levels, medical groups, medical institutions, government hospitals, and third-party independent imaging centers. Due to the influence of national healthcare policies, the development of customer applications is difficult. Therefore, the related medical policies need to be relaxed and the related technologies need to be promoted.Five typical application scenarios of the medical imaging cloud are as follows: Cloud image storage, image cloud application, Cloud-based medical collaboration, Cloud-based medical education, and Cloud-based health management.The medical imaging cloud provides applications such as big data storage, elastic expansion, and flexible sharing, all of which require a good transmission network. This places a new requirement on networks.Summary of Medical Imaging Cloud Scenarios04Scenario CategoryApplication ScenarioCloud image storageImaging cloud applicationCloud-based medical collaborationCloud image storageCloud image archivingCloud image backupCloud-based health managementPersonal image fileOnline image consultationRemote health monitoringFull medical and technical imaging cloud PACSCloud image readingMobile image cloudCloud-based medical educationDoctor trainingSurgery live broadcastDoctor examinationMulti-hospital morning readingRegional imaging centerRemote imaging centerRemote image diagnosisRemote image consultationMDT clinical multi-disciplinary collaboration":0}