{"  Mohammad Esmaiel Hajinezhad, Parviz Azodi     Openly accessible at http://www.european-science.com                                                                   1012  experience refers to give attention and care a patient through listening to the patient or observing the patient to satisfy patient's needs and demands. For example, they eliminate unpleasant symptoms in patients; they give priority to patient and provide a good health care. Minimum and maximum scores CBI were 42 and 252, respectively. First-person and third-person verbs were used for nurses and patients, respectively. This material does not belong to nurses or patients and both nurses and patients can complete it (Beck, 1999). Validity was already assessed by the investigator through validity content. To do this, the text was translated into simple Persian; to assess the translated inventory, it was sent for ten members of faculty of Nursing, Tehran University of Medical Sciences and Health Services. Then, the final inventory was prepared and last reviewed by Faculty Council. After validating the inventory, it was allowed to use. This inventory is the translated form of caring behaviours inventory. Furthermore, internal consistency was used to determine the reliability of CBI; therefore, Cronbach's alpha coefficient was calculated for this purpose. Thus, inventories were completed by 20 patients of surgical ward and 10 nurses of medical ward. Then, alpha coefficient was calculated (for patients, r=0.98; for nurses, r=0.93). It should be noted that these samples were excluded. Convenient sampling method was used to sample. After accessing to samples, the researcher first explained the study objectives to convince them to agree to participate in the study. Then a brief explanation was provided about the questionnaires; after obtaining informed consents, data were collected on the same day from samples of each ward. Items were read for illiterate people and answers were marked on the questionnaire. Deaf, blind and mute Patients and patients known to have mental disorders or physical disability to complete the interview were excluded. Data were analysed using SPSS (version 15). To achieve the study objectives, descriptive statistics were used. T-independent t-test was used to compare the nurse caring behaviours by nursing staff and patients.  Results Average age was 36.43 with a range of 16-80. Most patients were married. Most patients had diploma education (37.3%) and 49.3% of the patients were housewives. 74% of patients had moderate economic status. 50.7% of patients had been hospitalized in the past five years. More than half of the patients had a previous good experience of hospitalization, about 41% underwent a surgery during current stay, and 17% were awaiting surgery. The average age of nurses was 32.18 with a range of 23-51. Most nurses were married and most of them (90%) were BS. 61.2% of nurses had an average economic status. 38 percent had less than 5 years of experience. Table 1 shows the personal information of the subjects. Total mean and standard deviation of CBI in patients™ perspective were 4.89 and 0.97, respectively (maximum mean 6); total mean and standard deviation of CBI in nurses™ perspective were 5.16 and 0.52, respectively (Table 2). The mean and standard deviation of subscales are shown in the same table. There was a significant difference between patients™ and nurses™ perspectives (t=2.559, P=0.011).  Discussion and Conclusion Results of this study identified the difference between nurses™ and patients™ perceptions about nurse caring behaviours. Patients more experienced behaviours related to positive connectness of CBI; this finding is consistent with Wolfe et al (2003) and inconsistent with Hajynzhad et al. According to Hajynzhad, patients more experienced caring behaviours related to positive connectness than other subscales (Hajinezhad et al., 2007). This can be associated with several factors, including cultural factors; ":1}