{"TABLE I aProportions of Hemolysin, Complement, and Red Cells in HemolysisExperiment No................................................C'1 Nt per ml. of guinea pig serum, y.............Fraction of ml. for complete hemolysis of 0.2 ml.sensitized cells ................................C'1 N necessary for complete hemolysis of sensitizedcells, y ......................................C'1 globulin necessary for hemolysis, y............Molecules§ of C'1 necessary for hemolysis..........Hemolysin N combined per 0.2 ml. of sensitized cellsuspension, r .................................Hemolysin globulin used for sensitization, y........Moleculesll of hemolysin used for sensitization......Number of sheep red cells in 0.2 ml. sensitized sus-pension ......................................Molecules of C'1 available for hemolysis of single redcell .........................................Molecules of hemolysin combined with single red cellin sensitization and hemolysis ..................I*500.0040.201.265.1 X 10120.030.197.3 X 1013X 10O17,00024002'500.0040.201.265.1 X 10120.030.197.3 X 10\"2 X 10826,00037003*500.0050.251.586.4 X 10120.030.197.3 X 1012 X 10832,0003700* Details in Paper I (1).t Complement N, combining component N, \"mid-piece\" N. The mean extrapolated value,0.05 mg. per ml. is used (1).I Together with such accessory components as were present in the guinea pig serum dilutionactually used.§ The molecular weight of the combining component of complement is taken as 150,000 (foot-note 5).I The molecular weight of antibodies produced in the rabbit is approximately that of theprincipal component of normal globulin, or 158,000 (5-7).TABLE I bContinuation of Table I aType of ellipsoid and cross Cross tonal Total cross Red cell sur- Total cross Red cell sur-section assumed for hemo- area of hemo- sectional area face occupied sectional area face occupiedlysin molecule lysin molecule of 2400 hemo- by 2400 hemo- of 3700 hemo- by 3700 hemo-lysin molecules lysin molecules lysin molecules lysin moleculescm.s X 101 t cm.2X 1010o per cent cm.5 X 1010o per centProlate, elliptical crosssection ............. 0.0088 21 7.5 32 12Prolate, circular crosssection ............. 0.0009 2.2 0.8 3.3 1.2Oblate, elliptical crosssection ............. 0.0018 4.3 1.5 6.6 2.3Oblate, circular crosssection ............. 0.0210 50 18 77 28* Average sheep cell radius 2.6 X 10-4cm. (8); calculated by formula 2, reference 9, insimplified form, area = 5/12 A2, in which A = 1/2 cell diameter, area of sheep red,cell = 2.8 X 10-8cm.2t Calculated with the aid of the following data: asymmetry factor 1.5, partial specific volume0.745, as for other rabbit antibodies (6, 7); for prolate cases, ratio of axes 1:10, for oblate cases1:12 (reference 7, Table IV).697":0}