{"M. HEIDELBERGER, A. J. WEIL, AND H. P. TREFFERS45 minutes at 37C. each tube received a mixture of 0.1 ml. of 4 per cent sheep red cellsuspension and 0.1 ml. containing the volume of hemolysin given in the subheading ofTable III. Control rows of tubes containing saline instead of S III were included witheach complement dilution. These showed complete hemolysis at the end except for the2.5 X 10-3 complement dilution, which was unhemolyzed at the first reading and notentirely hemolyzed at the end. This dilution is therefore not used in computing reactingquantities and is included in the table both to show the limit of sensitivity of this modeof titration and to indicate an uncertainty in the calculations. If 0.13 y of C'1 N didnot always suffice for complete hemolysis under the conditions described it is equallyuncertain whether all of the C'1 N present in the system was taken up in complete inhibi-tion of hemolysis. At this stage it would appear premature to attempt any correctionfor these unknown and apparently variable factors, especially as this would involve de-ductions at each end of the hemolysis scale which might be equal and thus cancel out.Any lack of homogeneity in the complement combining component would also have tobe considered in this connection.In each column of Table III the first row of symbols indicates the reading after allcontrol tubes, except those mentioned above, were completely hemolyzed. The secondrow of symbols shows the reading after 10 minutes' additional standing at room tempera-ture, after which there was no appreciable change. The first readings appear to givemore sensitive indications of zone effects than the final ones and are included for possiblefuture reference.It is evident from Table III, subject to the uncertainties previously men-tioned, that as little as 0.12 y of anticarbohydrate N in antipneumococcusType III rabbit serum may take up as much as 0.2 y of complement N,or complement combining component (C'1) N in the reaction of 0.1 y ofS III with the antibody. Similarly 0.2 y of anticarbohydrate N and 0.1 yof S III take up 0.3 y of C'1 N in combining. At these high dilutions thesolutions remain crystal-clear until the hemolytic system is added. Withthe above proportions of S III and antibody the sensitivity of the test forcomplete fixation of complement decreases to 0.2 y of antibody N if thehemolysin in the hemolytic system is reduced from 0.05 y to 0.015 y of N.This difference in sensitivity vanishes when only 0.01 y of S III is used asantigen possibly because the S III-antibody proportions are then morenearly equivalent at this end of the reaction range (10). The limit of sen-sitivity as regards antibody N remains the same, however, as at the higherlevel of S III concentration. It is also to be noted that 0.01 -y of S III doesnot suffice for the complete fixation of as much as 0.5 y of C'1 N betweenthe limits of antibody concentration used, while a definite zone of completefixation occurs with 0.3 y of C'1 N extending over a 10- to 15-fold range ofantibody concentration. In the series in which 0.1 y of S III was used,however, 0.5 y of C'1 N was readily taken up at antibody N levels of 0.4 yand above.In Table IV are given similar data for Ea and anti-Ea rabbit serum. This699":0}