{"702 QUANTITATIVE CHEMICAL STUDIES ON COMPLEMENT. IIDISCUSSIONIt was shown in the preceding paper that the combining component ofguinea pig complement could be measured in weight units and that morethan 40 per cent of complement, by weight, could be added to antigen-anti-body precipitates with maintenance of volumes of the reacting componentsat levels convenient for precise analytical measurement. However, it wasscarcely feasible to use larger and larger volumes of guinea pig serum inorder to determine the maximum amount of complement capable of reactionwith known quantities of antigen and antibody. Instead, the usual tech-nique of the complement fixation test, with its great delicacy and repro-ducibility under strictly controlled conditions, appeared capable of affordingthe necessary information, and could, by virtue of this very delicacy, be usedto determine at the same time the lower limits of reactivity and the com-bining proportions of the reacting components. By the use of antigen andantibody solutions of known content and with the aid of the values for com-plement obtained in the preceding paper the actual quantities of antigen,antibody, and complement could be calculated in weight units for each sig-nificant dilution and mixture. In several experiments the number of redcells in the hemolytic system was counted and the amount of hemolysinestimated.'Since the hemolysis of sensitized red cells by complement depends uponother factors in guinea pig serum as well as the combining component ofcomplement (2, 3, 4, 15) it is impossible to define the mechanism of hemoly-sis solely on the basis of the number of red cells and the actual quantitiesof hemolysin and complement combining component. The cell count iseasily made, however, and the other two variables may now be estimatedwith a fair degree of certainty. Their interrelationships, under the con-ditions used, are set forth in Table I. Additional data on the relativeamounts of hemolysin and complement combining component required asthe test of complete hemolysis approaches its limit of delicacy, will be foundin the first portion of Experiment 10. It is evident that at extreme dilu-tions the actual amounts of hemolysin and complement combining com-ponent approach equality, but that as the test is ordinarily carried out farmore combining component than hemolysin is present. The latter may beconsidered as actually combined with the red cells in the experiments sum-marized in Table I as only twice the minimum sensitizing quantity was used,but it seems probable that, except at the highest dilutions of guinea pigserum shown in Table II, complement was present in excess. Possibly onlyan amount equal to the hemolysin, or a small multiple of this amount,entered into actual combination with the sensitized cells (cf. 16). For this":0}