{"M. HEIDELBERGER, A. J. WEIL, AND H. P. TREFFERS2. Molecular combining ratios between antigen, antibody, and C'1 havebeen established.3. The data are shown to be in accord with the theory of combinationof multivalent antigen with multivalent antibody.4. The fixation of complement by antigen-antibody combination is quali-tatively and quantitatively accounted for on this basis.BIBLIOGRAPHY1. Heidelberger, M., J. Exp. Med., 1941, 73, 681.2. Muir, R., Studies on immunity, London, Oxford University Press, 1909.3. Osborn, T. W. B., Complement or alexin, London, Oxford University Press, 1937.4. Ecker, E. E., Pillemer, L., Jones, C. B., and Seifter, S., J. Biol. Chem., 1940, 135,347. Ecker, E. E., and Pillemer, L., Preprint, Conference on Immunochemistry,New York Academy of Sciencies, Mar. 28, 29, 1941.5. Heidelberger, M., and Pedersen, K. O., J. Exp. Med., 1937, 65, 393.6. Kabat, E. A., J. Exp. Med., 1939, 69, 103.7. Svedberg, T., and Pedersen, K. O., The ultracentrifuge, Oxford, Clarendon Press,1940.8. Ponder, E., The mammalian red cell and the properties of hemolytic systems, Berlin,Gebr. Borntraeger, 1934.9. Ponder, E., J. Physiol., 1928, 66, 379.10. Heidelberger, M., and Kendall, F. E., J. Exp. Med., 1937, 65, 647.11. Heidelberger, M., and Kendall, F. E., J. Exp. Med., 1935, 62, 697.12. Heidelberger, M., and Kabat, E. A., J. Exp. Med., 1938, 67, 181.13. Goodner, K., and Horsfall, F. L., Jr., J. Exp. Med., 1936, 64, 201.14. Beeson, P. B., and Goebel, W. F., J. Immunol., 1940, 38, 231.15. Hegediis, A., and Greiner, H., Z. Immunittsforsch., 1938, 92, 1.16. Ponder, E., Proc. Roy. Soc. London, Series B, 1932, 110, 18.17. Michaelis, L., and Skwirsky, P., Z. Immunititsforsch., 1910, 4, 629. Eagle, H., J.Gen. Physiol., 1928-29, 12, 825.18. Abramson, H. A., J. Gen. Physiol., 1929, 12, 711; Electrokinetic phenomena, NewYork, Chemical Catalog Co., 1934.19. Brunius, E., Chemical studies on the true Forssman hapten, the correspondingantibody, and their interaction, Stockholm, Fahlkrantz, 1936.20. Locke, A., and Hirsch, E. F., J. Infect. Dis., 1925, 37, 449.21. Reviewed in Heidelberger, M., (a) Chem. Rev., 1939, 24, 323; (b) Bact. Rev., 1939,3, 49.22. Marrack, J. R., The chemistry of antigens and antibodies, London, His Majesty'sStationery Office, 2nd edition, 1938.23. Heidelberger, M., and Kendall, F. E., J. Exp. Med., 1935, 61, 563.24. Heidelberger, M., and Kabat, E. A., J. Exp. Med., 1937, 65, 885.25. Heidelberger, M., J. Am. Chem. Soc., 1938, 60, 242.26. Pauling, L., J. Am. Chem. Soc., 1940, 62, 2643.27. Heidelberger, M., Treffers, H. P., and Mayer, M., J. Exp. Med., 1940, 71, 271.28. Weil, A. J., Moos, A. M., and Clapp, F. L., J. Immunol., 1939, 37, 412.709":0}