{"M. HEIDELBERGER, A. J. WEIL, AND H. P. TREFFERSreason, if any portion of the complement functions enzymatically in hemoly-sis, it is probably not the combining component, for at least as much of thisprotein as hemolysin must be present. This does not resemble catalysis.Moreover, the combining component of complement actually unites in stableunion with sensitized red cells, as with other antigen-antibody systems (17).4The available data regarding the antibody molecule (6, 7) are such thatan uncertainty remains regarding its shape. The experimental value forthe frictional coefficient or asymmetry factor, however, permits the calcula-tion of molecular areas on the assumption of either oblate or prolatespheroidal shape. The area occupied by such molecules on the red cellsurface would depend upon their attachment in either the endwise or lateralposition. In Table 1 b calculations of the occupied surface are thereforegiven for each position of the oblate or prolate spheroidal molecule. Inter-mediate positions are also conceivable. Depending, then, on which cal-culation is used, the experimental data indicate that roughly from 0.8 to28 per cent of the sheep cell surface is occupied by hemolysin under theconditions employed. Since two \"units\" of hemolysin were actually used,complete hemolysis is possible with 0.4 to 14 per cent of the cell surface com-bined with antibody. While these figures are not to be taken too literallythey do at least indicate by roughly a power of ten that sensitization neednot involve a coating of the entire red cell surface. The findings are there-fore in accord with the \"key spot\" theory of Abramson (18).Brunius (19) has calculated the number of the Forssman antibody mole-cules required to sensitize a single red cell for hemolysis, finding the numberas only 30 and the fraction of red cell surface covered as 0.001 per cent.The area calculations were made on a different basis, but the number ofmolecules of hemolysin was calculated from a single preparation whichshowed about ten times the activity per y of N as four other lots isolatedby Brunius, the best preparation of Locke and Hirsch (20), and our ownsera, judged by their antibody content. When it is considered that the3000 molecules of hemolysin indicated in Table I represent double the num-ber necessary for complete hemolysis, and that Brunius used 90 per centhemolysis as the end-point, the agreement among the less active prepara-tions is moderately close. However, sheep red cell stromata may containa number of antigens. While the antibodies resulting from the injectionof these antigens into rabbits are capable of combining with stromata'it does not follow that all of the antibodies actually prepare the cell forhemolysis. The one result used by Brunius for his calculations may there-4 C'1 N is taken up by sheep cell stromata in their reaction with hemolysin (unpub-lished experiment).703":0}