{"M. HEIDELBERGER, A. J. WEIL, AND H. P. TREFFERSoccur in many immune sera (11, 23, 27, and other papers). This residualantibody, remaining after fractional absorption of many sera with antigen,forms only easily dissociated, soluble compounds with antigen. However,when multivalent, or complete, antibody is present, the \"univalent\" orresidual antibody may add to the resulting antigen-antibody aggregatesin firm, relatively undissociated union and be precipitated just as is themultivalent antibody.In the above discussion and in the graphic representations complementhas been considered, for simplicity's sake, solely in terms of its relation toantibody. This suffices to explain its behavior provided the quantity ofC'1 combined does not exceed that of A. However, the data indicate thata somewhat larger proportion of C'1 may be added when relatively morecomplement is present. It is therefore probable that, at least under suchconditions, antigen molecules may participate in binding C'1 firmly in theantigen-antibody aggregate, and it is not excluded that antigen plays somepart under all circumstances. It is known, however, (25) that throughoutpractically the entire range of the precipitin reaction more antibody mole-cules than antigen molecules are present, the proportion ranging from two-to three-fold in the equivalence zone to 6 times or greater in the region oflarge antibody excess. It would therefore seem reasonable to ascribe to thenetwork of antibody molecules the major burden in the firm linkage ofcomplement to antigen-antibody aggregates, the more so as the complementuptake is influenced to a far greater extent by the quantity of antibodypresent than by the amount of antigen.Other evidence in accord with the conception of complement fixation as aconsequence of aggregate formation by combination of multivalent antigenwith multivalent antibody is furnished by the behavior of the pneumococcusType III and Type VIII polysaccharide-rabbit antisera reactions, and of theType II and Friedlinder Type B polysaccharide reactions in rabbit anti-sera. In each homologous reaction with the appropriate specific polysac-charide complement was fixed over a wide range (see page 701), extendingin the Type II and Type VIII sera to high dilutions at which visible pre-cipitation no longer occurred. However, no visible cross precipitationoccurred, even at relatively low dilutions, between S III and anti-TypeVIII sera, or between S VIII and anti-Type III sera, nor was complementfixed in these cross tests. On the other hand S II gave specific precipitationand complement fixation with a Friedlinder B antiserum, but the Fried-linder B polysaccharide neither precipitated nor fixed complement withType II antipneumococcus rabbit serum. At least in these instances thepossibility of multivalent antigen-antibody aggregate formation seems to707":0}