{"PAGE 50MULTIFAMILY GREEN BUILDING GUIDELINESMEASURE A1 PROTECTIONOF SOIL, VEGETATION, AND WATER DURINGCONSTRUCTION» Restore wetlands. Creeks or wetlands can be augmented or restored with natural swales and stormwater retention ponds. Wetlands and riparian zones are critical natural resources and are well regulated. If your project will affect a creek or wetland, consult state and federal agencies with jurisdiction over these natural resources early in the design process.MANAGESTORMWATER DURING CONSTRUCTIONDuring grading and construction, use stormwater best management practices (BMPs) to control erosion and prevent sediment and pollutants from entering storm drains (for handbooks on BMPs in California, see CASQA information in Resources, below).Erosion control protects soil surfaces, whereas sediment control traps soil particles after they have been dislodged. Stormwater BMPs during construction include the strategies described above for defending against erosion, as well as these actions:»Cover construction materials and stored topsoil exposed to rain; store wastes under cover and dispose of properly.»Install temporary concrete washout areas for useby contractors to prevent pollution from entering storm drains. »Educate onsite workers to practice good housekeeping and implement best management practices to prevent stormwater pollution. »Inspect and maintain control measures before and after each rainstorm. Code ConsiderationsStormwater management is subject to federal, state, regional and local requirements. Projects that impact ﬁve acres or more are subject to the National Pollutant Discharge Elimination System (NPDES) under the federal Clean Water Act. The State of California requires projects that disturb one or more acres of soil or projects that disturb less than one acre but are part of a larger common plan of development that in total disturbs one or more acres to develop and implement a Storm Water Pollution Prevention Plan (SWPPP) under the General Permit for Discharges of Storm Water Associated with Construction Activity (Construction General Permit, 99-08-DWQ). There are also many regional and local regulations for stormwater management, tree conservation or landscaping. Contact your local municipality for details and assistance.Considerations for ResidentsResidents may beneﬁt from increased property values, protection of local streams and waterways, and lower energy bills (if mature shade trees are preserved). Cost and Cost EffectivenessBENEFITCOSTCosts can be reduced if topsoil doesn’t have to be imported or hauled off site and if existing vegetation is preserved. New landscaping is more likely to thrive in healthy topsoil, which will reduce plant replacement and ongoing landscaping costs.Resources»Bay-FriendlyLandscape Guidelines explain how to design, construct and maintain landscapes to support ecological health: www.BayFriendly.org»CaliforniaEnvironmental Protection Agency’s StateWater Resources Control Board has links to many resources for California developers, engineers and contractors:www.swrcb.ca.gov/stormwtr/bmp_database.html (stormwater best management practices); www.swrcb.ca.gov/stormwtr/construction.html (Stormwater Pollution Prevention Plans)»CaliforniaEnvironmentalResourcesEvaluationSystem (CERES) has information about wetlands management, regulatory permitting and policies:www.ceres.ca.gov/wetlands »CaliforniaStormwater Quality Association (CASQA) has brochures, fact sheets and other information about stormwater management during construction, including the New Development and Redevelopment Handbook: www.casqa.org »Environmental Building News has an article on treatment systems, “Cleaning up Stormwater: Understanding Pollutant Removal from Runoff” (Feb.2002); fee to access: www.buildinggreen.com » University of MassachusettsBuilding Materials and Wood Technology department’s article, “Preserving Trees During Construction,” has detailed information about planning for tree preservation: www.umass.edu/bmatwt/publications/articles/preserving_trees_during_construction.html»Washington StateDepartment of Ecology’s publication, “Guidelines and Resources for Implementing Soil Quality and Depth BMPT5.13,” describes best management practices for soil quality, stormwater retention and water quality:www.compostwashington.org/PDF/SOIL_MANUAL.pdfRelated Case StudiesNoneSITE":1}