{"MULTIFAMILY GREEN BUILDING GUIDELINESPAGE35MEASURE AA7PASSIVE SOLAR DESIGN, DAYLIGHTING AND NATURAL VENTILATIONApplication SIZE Low RiseMid RiseHigh RiseTYPENew ConstructionRetroﬁtUSEResidentialCommercialApplicable to all multifamily housing projects, including mixed-use projects. Providing good solar access and natural ventilation is more challenging with retroﬁt projects and buildings in dense urban areas. Multistory developments face challenges with incorporating thermal mass, especially on ﬂoors above ground level. DesignDetailsPASSIVE SOLAR HEATING AND COOLINGHere is an overview of the basic principles; consult a passive solar design expert for speciﬁc recommendations.» Use street orientation to improve solar access.For new subdivisions, plan streets and lot layouts to provide shading of streets and buildings. Deciduous trees provide shade during the hottest times of the year without blocking winter sun. Narrow streets are easier to shade with trees. Consider alleyways, greenbelts and similar methods to provide good solar access to all buildings. »Control solar access with building orientation. Locatebuildings on an east-west axis to facilitate passive solar design and placement of rooftop solar systems (Systems: Section I–Renewable Energy).To the greatest extent feasible, orient individual units so that living spaces face south. Passive solar apertures should be aligned toward true south (not magnetic south), but do not have to be directly facing south. Even at 25 degrees off south, 90% of the total solar insolation (a measure of solar energy striking the earth) still falls on a wall. On north, west and east-facing walls, minimize the window area while still allowing for daylighting and natural ventilation. Use spectrally selective coatings to reduce solar heat gain on east- and west-facing windows(Structure: D8–Window Replacement). North windows rarely get direct sunlight and therefore create cold spots, but are excellent for daylighting. » Insulate and reduce air inﬁltration.For passive solar heating to be effective, the building must be insulated to a very high level and inﬁltration reduced so that stored heat won’t be lost too quickly (Structure: F1–Insulation; Systems: H3–Advanced Ventilation Practices and J1–Building Performance Exceeds Title 24). »Control solar access with exterior shading devices. Design shading devices on south-facing walls and windows for the time of year that they need to be fully shaded (cut-off). In general, the hottest days should coincide with full shading of south windows and walls; check weather data for the site to determine dates for sunlight control. On the shortest days of winter, sunlight should be allowed to penetrate fully into the space. Overhangs, awnings, trellises and landscaping can provide shading. For retroﬁt projects, consider adding exterior shading to south- and west-facing windows. »Provide thermal mass. Dark mass surfaces directly in contact with sunlight absorb solar radiation more than light surfaces, and will slowly reradiate the energy as heat.Thermal mass can be incorporated in ﬂoors such as tile or concrete. Heavyweight concrete stores and conducts heat better than lightweight mixes. Other Dark colored tiles absorb and store the sun’s heat in a  passive solar house.KEMAProper overhang design on south windows will keep out the summer sun while allowing sunlight into the space on winter days. WinterSummerPLANNING & DESIGN":0}