{"PAGE 38MULTIFAMILY GREEN BUILDING GUIDELINESMEASURE AA7PASSIVE SOLAR DESIGN, DAYLIGHTING AND NATURAL VENTILATIONConsiderations for ResidentsResidents may beneﬁt from reduced heating and cooling bills and better indoor environmental quality. Teachresidents about the strategies used so that they don’t unintentionally circumvent the design. A throw rug, for example, will reduce a mass ﬂoor’s ability to store heat. Cost and Cost EffectivenessBENEFITCOSTThe strategies in this measure may increase design time. Passive solar design may increase material costs for items such as shading devices or extra concrete or drywall for thermal mass. However, passive design strategies are probably the best way to reduce ﬁrst costs associated with system sizing (Systems: H0–Heating Equipment) and provide ongoing savings throughout the building’s life. A basic level of daylighting and natural ventilation can usually be provided for no increase over standard construction costs. Skylights, clerestories, tall windows, cupolas, deep overhangs, awnings and other nonstandard design features may increase costs. Strategies more common in ofﬁce buildings, such as light shelves, automatic lighting controls and specialized glazing, can signiﬁcantly increase costs.Resources»California’s utility companies provide resources for passive systems design, including modeling tools, solar calculators and climate data. Check with your utility.  »GreenAffordable Housing Coalition has factsheets on passive solar design and daylighting for affordable housing: www.greenaffordablehousing.org » National Oceanographic and AtmosphericAdministration (NOAA) has climate data including design temperatures, degree-day averages, and more: www.noaa.gov» NationalRenewableEnergyLaboratory provides solar insolation values:www.nrel.gov/rredc» U.S.Department of Energy offers passive solar and daylighting fundamentals: www.eere.energy.gov/buildings/info Related Case Studies»Carmen Avenue, p. 230»Crossroads, p. 234»Sara Conner Court Apartments, p. 221PLANNING & DESIGN":1}