{"MULTIFAMILY GREEN BUILDING GUIDELINESPAGE37MEASURE AA7PASSIVE SOLAR DESIGN, DAYLIGHTING AND NATURAL VENTILATION» Use photocontrols for nonessential electric lighting.In common areas, photocontrols help ensure energy savings by keeping electric lights off or dimmed when there is adequate daylight.» Integrate electric lighting design with daylighting. As part of an integrated design approach, consider the electric lighting design in conjunction with daylighting to avoid unnecessary electrical conﬁgurations. »Consider visible transmittance (VT) when selecting windows. VT is the amount of light passing through the glass; higher VT values allow in more light. Fordaylighting fenestration in both new construction and retroﬁt projects, maximize VT while also choosing the U-factor and SHGC that are suitable for the climate and the fenestration’s orientation (Structure: D8–Window Replacement).NATURAL VENTILATIONMaking natural ventilation work well requires careful adherence to building science principles and close integration with the entire design team. Here are some general strategies: » Analyze site conditions. Before determining building placement and orientation, check local weather station data for wind speeds and direction. Consider setting up an onsite monitoring system if winds seem particularly strong. » Site building to take advantage of prevailing winds.Try to site the building so that obstacles such as other structures do not block summer winds and to take advantage of prevailing winds and pressure differences. Also, buildings and landscaping can be designed and oriented to help deﬂect cold winter winds. » Design for cross ventilation. Design windows to catch prevailing breezes. Ideally, each room would have an operable window on at least two walls to enhance cross ventilation. For sufﬁcient airﬂow, there needs to be a pressure difference between the inlet and outlet openings. Certain window styles, such as casement windows, are more suited to cross ventilation because they have a larger opening area than windows such as sliders.» Design for stack ventilation. High operable windows, skylights or cupolas combined with low operable windows can create a stack effect. Rising hot air exhausts at the higher openings, drawing in cooler air through the lower openings. »Consider air ﬂow within the unit. Openings between rooms, such as transom windows, grilles or open ﬂoor plans, facilitate air ﬂow through the unit. If possible, design double-aspect units that provide ventilation and daylight from at least two sides.» Take into account security and noise concerns.Window openings should be operable yet secure so people feel safe leaving windows open when at home. Some window manufacturers include small operable vents in the window frames to provide fresh outdoor air without having to open the window. During design, identify neighboring sources of noise and dust and attempt to reduce those effects through the building’s placement, design and landscaping.»Cool the incoming air. Consider planting shade trees on the building’s windward side to lower the air temperature of inﬂowing air. A body of water on the building’s windward side can also cool the inﬂowing air through evaporative cooling. » Integrate natural ventilation with passive solar design and daylighting.Natural ventilation can be used at night to dissipate heat stored in thermal mass and cool the building. Look for opportunities to have openings serve multiple purposes—ventilation, daylighting, views, passive solar design—but carefully evaluate conﬂicting priorities.»Consider ceiling fans. If natural ventilation on its own will not provide adequate comfort on most days, consider supplementing it with ceiling fans (Systems: H3–Advanced Ventilation Practices). Housing for senior citizens and others who are particularly vulnerable to the effects of prolonged heat may need to be equipped with some mechanical cooling to ensure safety during heat waves.Code ConsiderationsCalifornia’s Building Energy Efﬁciency Standards (Title 24) is limited in its ability to account for passive solar heating. Code requires that all buildings have some form of mechanical heating. A credit is available for thermal mass; consult a Title 24 expert for information. In low-rise residential buildings, natural ventilation alone is not adequate to meet the requirements of ANSI/ASHRAE Standard 62.2 as required by Title 24–2008. Mechanical ventilation in the form of a continually operating or demand-controlled exhaust or supply fan is required.For high-rise residential buildings, the design must ensure that sufﬁcient fresh air is supplied, but natural ventilation may be all that is required. (For more information, see Systems: H3–Advanced Ventilation Practices; for code issues related to windows, see Structure: D8–Window Replacement.)PLANNING & DESIGN":0}