{"Based on the dates when pregnancies and new born litters were detected, we deduced that mating begins as early as the late tillering stage allowing up to three litters per female over the nutritious ripening stage of crops. Mean population abundance was increased through the subsequent influx of juveniles and sub-adults during the late ripening and early fallow stages. This coincidence indicates that reproduction and population growth may be limited by high-quality food supply. We recommend the following management strategies for critical trials: (1) minimise the number/size of levee banks and maintain/retain the long fallow to limit tions; (2) synchronise crops to minimise breeding period; and (3) time application of mortality control at the mid-tillering stage when populations are low and least capable of compensation. Current trends in rodent damage management for Hawaiian agriculture and conservation Earl Wm. Campbell III United States Department of Agriculture, Animal Plant and Health Inspection Service, Wildlife Services, National Wildlife Research Center, Hawaii Field Station. Box 10880, Hilo, Hawaii 96721 Introduced rodents have caused, and continue to cause, substantial economic and ecological damage to the Hawaiian Islands. Due to the impact of these species, nificant effort is being expended to understand their biology and control. Four species of commensal rodents are currently found in urban, agricultural, and natural habitats in the islands. These species are the roof rat (Rattus mttus), the Polynesian rat (Rattus exu[ans), the Norway rat (Rattus norvegicus), and the house mouse (Mus musculus). In Hawaii, interest in rodent control in Hawaii historically was associated with human health issues (bubonic plague) and the need to reduce crop losses to rats in sugarcane. In recent years substantial research efforts have been devoted to ment of techniques to manage rodent damage in macadamia (Macadamia lia) orchards and in conservation situations. As land-use patterns change in Hawaii other problems with rodent depredations, for example in agroforestry, may emerge. Roof rats (Rattus rattus) damage an estimated 5 to 10% of the developing nut crop in Hawaiian macadamia orchards. Aspects of roof rat biology in macadamia orchards are studied with the ultimate goal of developing an ecologically sound and effective integrated pest management plan. I will present data which suggest that: 1) roof rats are the primary rodent pest species of concern for macadamia producers; 2) broadcast baiting of rodenticides on the ground in macadamia orchards without rior vegetation is ineffective for roof rat control; and 3) macadamia trees can pensate for rodent damage early in the crop cycle. Efforts are being made to obtain a state registration for anticoagulant rodenticide use in bait boxes in macadamia trees. 60 ":0}