{"tained in the bark chips, because there were tooth marks on the inside of bark chips as well as on the tree surface. The rats seemed to have digested the phloem incompletely and absorbed only the sap because their faeces were filled with the phloem fibres. Seeds and fruits, including 6.4% of an immature tankan fruit, accounted for 30% of the stomach contents in volume, whereas the phloem accounted for only 9%. These results show that the primary vegetable foods of the roof rats were seeds and fruits and that the phloem was not a substitute food source. I conclude that roof rats stripped the bark of the tankan orange to obtain the sap in the phloem, although the reason for this activity remains uncertain. Towards an ecological approach for management of plague reservoirs and vectors in the western Usambara Mountains in Tanzania, East Africa R.H. Makundi Rodent Research Project, Sokoine University of Agriculture, P .0. Box 3110, Morogoro, Tanzania Outbreaks of human plague in the Western Usambara Mountains in Tanzania are strictly seasonal, occurring between October and June each year since 1980. Studies have been carried out in the past to elucidate the breeding patterns of rodents, tion densities and the species involved as reservoirs and vectors of the disease ism. The studies have involved removal trapping of animals and determination of rat population densities and flea abundance on rodents. In the current study, a review of the data collected in the past was carried out to establish the appropriate ecological approaches for management of both reservoirs and vectors of plague. A hypothesis is provided to explain the increase in numbers of plague cases between October and June. The studies suggest that favourable temperatures (22-26°C) and humid conditions between November and March favour rapid multiplication of fleas, thus increasing their abundance on rodent hosts. This period coincides with ing numbers of wild, peri-domestic and house rodents. The chance of house-infesting rodents, mainly Rattus rattus and peri-domestic species (predominantly Mastomys natalensis), picking up infection from sylvatic species increases several fold. This enables the disease to be transferred from wild rodents to man. The onset of the heavy rains (March-April) and the cold and dry conditions (May-September) lowers the flea abundance and arrests the spread of the disease during this period. An ecological approach on an area-wide basis to control both vectors and reservoirs of the disease to supplement the conventional techniques using rodenticides and cides has not been attempted. A comprehensive management strategy should involve habitat management approaches, enforcement of environmental sanitation to remove sources of food and reducing potential areas for rodent harbourage and breeding, cially for Arvicanthis niloticus and M. natalensis. Sanitary improvements and ness in houses to reduce house-infesting fleas and populations of R. rattus are necessary. 68 ":1}