{"The ability to predict the likely behaviour of a sterilising virus in field populations relies on an understanding of the epidemiology of the vector virus in wild mice. The virus that we propose to use is murine cytomegalovirus or MCMV. This herpes-type virus is mouse-specific and is already present in wild house mice in Australia. It is spread by close contact and produces a persistent, non-lethal infection. Multiple infections with more than one strain of the virus are known to occur in a single mouse. Therefore, MCMV is an ideal candidate for a viral vector. However, there is still much to leam about this virus in wild mouse populations and this is the focus of new research. The key population-scale questions to be addressed are: 1. What is the transmission rate of wild and recombinant strains (including a ing strain) of MCMV in wild mouse populations? What population parameters influence transmission rate? 2. Can a recombinant strain of MCMV establish and generate an immune response in a mouse population which has already been infected with wild-type MCMV? Is the order of infection important? We will also obtain some information on the dynamics of MCMV infection in wild mice, the importance of sexual transmission, the likely persistence and infectiveness of MCMV in the environment and the threshold population size required to maintain MCMV infection. Urban rodent control programs for the 2pt century Bruce A. Colvinl and William B. Jackson2 1 Bechtel Corporation, 16 Temple Road, Lynnfield, MA 01940 USA 2 Department of Biological Sciences, Bowling Green State University, Bowling Green, OH 43403 USA Urban rodent control in the U.S. historically has been implemented in a limited or jointed fashion rather than comprehensively, and programs commonly have been tive rather than proactive. Reasons for this have included limited funding, training, and political and technical support. As urban infrastructure ages and congestion increases, the need for effective rodent control programs will become even more important for both public health and economic reasons. Additionally, expectations of urban residents and businesses for quality-of-Iife improvements will continue to grow. Urban rodent control for the 21 sI century must focus on a program approach that is both strategic and comprehensive. This must include effective long-term plarming, scheduling, data management, and mapping capabilities. It also must focus on greater partnership among municipal agencies, private pest control companies, and nity groups. Central to program success will be coordination, communication, and accountability among all program participants. Cost-effectiveness will be achievable, but predicated on effective administrative management and training. Greater focus on infrastructure maintenance and construction will be essential for long-term removal of factors that enhance pest problems. 57 ":0}