{"Ecologically based rodent management in Africa: no quick solutions for urgent problems Herwig Leirs Danish Pest Infestation Laboratory, Skovbrynet 14, D K -2800 Lyngby, Denmark Rodent management in Africa is generally organised ad hoc for control of acute problems. Nearly always, the approach is based on rodenticides, with the choice of poisons being dictated by availability rather than efficacy. Alternative strategies are used locally on a trial and error basis but the biological basis for these approaches is usually rather poor and controlled experimental designs are not commonly applied. In this paper, I present several possible field rodent management strategies and discuss how well their application is supported by the available ecological tion. For most examples, I will use data that were collected in a population of mys natalensis in Tanzania. The use of population models as a formalised way of using the available knowledge will be illustrated. The focus is on: symptomatic lethal control periphery baiting with rodenticides -prophylactic lethal control (avoiding damage to crops) -preventive lethal control (avoiding build-up of rodent populations) -environmental control by weeding, burning etc. -trap crops, social fences -biological control with predators contraception. Unfortunately, the available ecological information does not allow for much mism with most of these approaches. In order to test new strategies, specifically designed experiments are proposed. However, each of these will require considerable amounts of field work and solutions are not to be expected very soon. Chronobiology applied to rodent pest management-the case of semi-arid agriculture in sub-Saharan West Africa Bruno Si card Laboratoire de Mammalogie, Orstom, BP84, Bamako, Mali Chronobiology studies the mechanisms which allow species to react and adapt to the variations of their environment. In mammals, daily and seasonal variations of certain environmental factors called synchronisers (e.g. day-night alternation, photoperiod, temperature, relative humidity, food resources, chemical signals, pheromones and rodents density), are perceived by certain structures of the brain (e.g. suprachiasmatic 65 ":1}