{"11Business risks facing mining and metals 2014Œ2015What does broad transformation mean?New ways of thinking need to be considered to analyze and assess the level of improvements the industry needs. This involves having one view of the world:Ł A clear strategy based on a broad set of value driversŁ An operating model that is aligned with the strategyŁ Integration and alignment across the value chain through process integrationŁ Standardization of work proceduresŁ Aligned planning, budgeting and performance measurementReal and sustainable productivity gains require a holistic, top down approach that aligns productivity activities to their strategic value and contribution, and they need to be planned and executed in a coordinated way across the value chain. It is critical that all the systems, processes, interfaces and interlinks are well understood so informed decisions can be made. There is a need for a focus on longer-term initiatives, which, while harder to execute, will have more impact on improving overall productivity as shown below:The most successful companies in addressing the productivity challenge have the following traits:Ł Are bold and not incrementalŁ Have a long-term vision and planŁ Take an end-to-end viewŁ Look for broad solutionsŁ Eliminate silosŁ Align objectives to strategyŁ Set consistent performance measures for productivity that create valueŁ Address the behavioral and cultural settings necessary for sustainabilityŁ Learn from history, but be open to innovationŁ Are deliberate in planning and executing their initiativesWe believe that to really address the productivity issue requires a whole of business or end-to-end focus. This will drive a multifunctional response to problems, break down silos and ultimately deliver unprecedented productivity improvements. It™s about the systems and processes, it™s taking a holistic view of the different parts and how they Þ t together. This isn™t as easy as it sounds. Typically, the information and data needed to bring about this understanding is spread across the organization and differs greatly in terms of:Ł Volume Š how much dataŁ Variety Š the type of dataŁ Veracity Š how much it can be believedŁ Velocity Š how quickly it is generatedMany organizations are struggling with each of these measures, and in particular lack the means to cope with the sheer scale of data ß owing into the business and with the diverse nature of structured and unstructured data. ConsiderationsŁ Are you improving or transforming?Ł Are your initiatives adding to thelong-term bottom line or just moving the problem?Ł Are you thinking about the problem conventionally or with a value chain view? Ł If you are considering achieving higher productivity with lower input, do not forget to consider the impact on cash ß ow and proÞ t. Reducing output may boost certain productivity measures but may negatively impact, e.g., ROCE.Need for a long-term focusSupply chain resetReduced manpower plansHuman technology interfaceRebalanced capital deploymentRedevelop mine planLow1 Year2 YearsMediumImpactEase of executionHigh":0}