{"Business risks facing mining and metals 2014Œ201540OutlookThe nature of the risk has changed and is focused more on skilled than unskilled workers. A solution to the issue is beyond the control of an individual company, and it requires the industry participants to change how they think about their business individually and as a sector as a whole. The key is to learn from the last upswing and plan ahead, using a more holistic framework that involves all stakeholders. Being more forward looking and considering skills retention for the next cyclical upswing will help manage volatility and lessen the permanent loss of skills from the sector. The solution lies in collaboration among the industry, various governments and academic institutions. While the current economic climate does ease some of the near-term pressure on the sector, the longer term risk of a shortage of critical skills and attrition still remains. Mining leaders need to be forward looking and invest in a company™s future capability needs. To manage skills through different phases of the commodity price cycle, mining and metals companies can invest in more effective and efÞ cient ways of engaging their staff irrespective of where they are in the world. ConsiderationsProductivity recapture: In the age of big data, industry can analyze and address speciÞ c challenges and bottlenecks to labor productivity. The mining and metals industry needs to identify operational productivity protocols that utilize labor more efÞ ciently and utilize data analytics to generate actionable insights. Critical role of human resources: The most cost-effective and logical role is to retain and develop your existing talent pool. This can be done through employee engagement, beneÞ ts and perks, including ß exible beneÞ ts, variable pay, ß exible work schedules, skills management and development, extended retirement, improving mid-career engagement, and providing a compelling value proposition. Organizations can also target the knowledge development of the workers and enhance retention through training, upskilling and redeployment. Diversity and inclusiveness: The mining and metals industry can further plug its skills gaps by considering and attracting a more diverse group of talent such as women, indigenous and immigrants who are still under-utilized and under-represented in the sector. A mobile immigrant work force can also be used to Þ ll the skills gaps in knowledge occupations such as professional geoscience and engineering. The retiring or sunset labor pool should be encouraged to either stay on for longer or mentor less-experienced colleagues in the sector. Willingness to invest in vocation and tertiary funding in the face of volatility: Organizations should not underinvest during the down cycle as this is a short-term strategy. Industry can coordinate and collaborate with educational institutions to develop technician training schemes or speciÞ c post-graduate qualiÞ cations that include practical industry internships. The idea is to be prepared for the demand of highly skilled and middle- to senior-level management professionals during the next upswing in the commodities market. Accessing people from aligned sectors: Companies can continue to tap into skills from similar sectors such as oil and gas, engineering, construction and manufacturing that require complimentary skills. Targeting resources in these sectors can create a widening resource pool of technical (e.g., electrical trades, Þ tters and turners) and professional (e.g., civil and mechanical engineers) skills. ":0}