{"39Business risks facing mining and metals 2014Œ2015Annual growth in mining employment in Australia (y-o-y %)-100102030Jan 09Jan 10Jan 11Jan 12Jan 13Source: Australian Bureau of StatisticsThis does not necessarily mean that the industry has an adequate supply of critical skills as this cycle is creating a structural change in mining employment. The critical skill shortages exist in another pool of talent altogether.Dilemma: Long term and skilledAn increased focus on improving productivity and a move toward automation, mechanization, data analytics and contract negotiation means that there is an increasing level of sophistication in the operations of mining and metals projects. In addition, there has been a more proactive approach toward stakeholder management that has seen the introduction of roles, such as government relations and community engagement. With this comes the need for a more skilled subset of the work force within the sector.Finding the right people to Þ ll these roles is compounded by the high rates of employee turnover in the sector and the time it takes to Þ ll jobs at middle and senior management (8 to 10 years of experience). The younger segment of the work force does not stay in the mining industry for more than two to three years.8 According to the former South African Minerals Minister, Susan Shabangu, the industry loses more than half of technical graduates to other sectors of the economy in the Þ rst Þ ve years of employment. This Þ gure increases to more than 70% in 10 years of employment.9 This leaves this portion of the labor force in short supply.Future skills needsDespite current conditions, forecasts show that a skills shortage is still likely to occur during the next upswing of commodity prices. The Minerals Council of Australia has predicted the need for an additional 86,000 mining professionals and skilled mine workers by 2020.11 In Canada, about 145,000 workers are required by 2023, which would be approximately half of the current work force employed in the sector.12 8. ﬁAnnual report 2013,ﬂ AngloGold Ashanti, 2013.9. ﬁMining industry - The skills myth,ﬂ Financial Mail, 6 December 2012.10. ﬁCanadian Mining Industry Employment, Hiring Requirements and Available Talent 10-year Outlook,ﬂ MiHR website, http://www.mihr.ca/en/resources/Hiring_Requirements_Available_Talent_10_year.pdf, accessed 2 June 2014.11. ﬁMining™s graduating workforce: A plug for the skills shortage drain,ﬂ Mining Australia, 21 March 2013.12. ﬁCanadian Mining Industry Employment, Hiring Requirements and Available Talent 10-year Outlook,ﬂ Mining Industry Human Resources Council website, http://www.mihr.ca/en/resources/MiHR_10_Year_Outlook_2013.pdf, accessed 2 June 2014. Mining and metals companies are also battling demographics in keeping their skilled work force. The aging population means that many skilled employees are reaching the age of retirement. According to the Canadian Mining industry Human Resources Council (MiHR), roughly 20% of the Canadian mining work force is eligible to retire by 2016Œ18, whereas 6% are currently eligible to retire. The aging work force is highlighted by the expected rise in retirement age in Canada from 2.2% in 2013 to 2.8% in 2023, an increase of 27%.10":0}