{"49Business risks facing mining and metals 2014Œ20152. Coal-to-liquids (CTL) and petroleum: CTL is a process of coal liquiÞ cation which allows coal to be utilized as an alternative to oil. In South Africa, CTL fuels are not only used in cars and other vehicles, but CTL fuels produced by South African energy company Sasol also have the approval to be utilized in commercial jets.5 India-based steel manufacturer Jindal Steel and Power (JSPL) is investing INR550b to set up a CTL plant in Odisha, India. The investment will allow JSPL to produce methanol, petrol and diesel from coal.63. Aluminium and steel: Steel was thought to be irreplaceable in car manufacturing due to its strength and durability. However, with innovation in aluminium, cars are increasingly made from aluminium, including engines and drive shafts. This makes the cars lighter and more fuel efÞ cient. According to Alcoa, aluminium usage in car manufacturing is expected to double by 2025. In recent examples, Ford is manufacturing its F-150 pickup truck and Toyota its 2018 Camry using aluminium instead of steel in a bid to lighten the weight and thus improve fuel economy.712Threat of substitutes(10 in 2013)The progress in technological innovation across downstream industries and commodities has proved that no commodity is beyond substitution. The recent supercycle that led to high commodity prices had sowed the seeds of technical innovation to Þ nd or use low-cost substitutes. Other drivers that promote substitution, and potentially disrupt the existing business models, are regulatory change and environmental concerns. The following trends highlight the growing challenge some of the commodity manufacturers are facing.1. Gas and met coal: The steel business model is facing a challenge from within the industry. South Korean steelmaker POSCO could potentially alter the dynamics of the steel market through its ITmK3 technology, which does not use metallurgical coal for producing virgin steel. The companies that have heavily invested in coking coal assets could be required to alter their business model once this technology opens up for the wider market in 2015 upon expiration of the patent. Low-cost gas and DRI (direct reduction iron) are also met coal-free alternatives.Key thoughtSubstitution is a risk for all commodities and all operators.1. Global Information Security Survey 2013, EY, 2013. 2. ﬁGlobal risks 2014 Œ ninth edition,ﬂ World Economic Forum, http://www3.weforum.org/docs/WEF_GlobalRisks_Report_2014.pdf, accessed 30 May 2014.3. ﬁObama Says Cyberterrorism Is Country™s Biggest Threat,ﬂ International Business Times, 18 February 2014.4. ﬁDisclosing Cyber Security Incidents: The SEC Weighs In,ﬂ Forbes, 4 June 2012.5. ﬁCoal to Liquids,ﬂ World Coal Association, http://www.worldcoal.org/coal/uses-of-coal/coal-to-liquids/, accessed 23 May 2014.6. ﬁJSPL to soon tie-up technology partner for Angul CTL plant,ﬂ Moneycontrol.com, 14 March 2013.7. ﬁFord™s Aluminium F 150, What Took Them So Long?,ﬂ Forbes, 27 December 2013; ﬁWill aluminum Ford F-150 be a rolling beer can?,ﬂ USA Today, 31 December 2013.11Cyber attacks and information security(17 in 2013)More than 75% of our clients in mining and metals cite cyber threats as their top security priority in 2013Œ14, with 41% of the mining and metals respondents experiencing an increase in external threats over the past 12 months1 while the World Economic Forum names cyber attacks among the top-Þ ve likely global risks.2 In response to this threat, the US Government has made cybersecurity a priority and has asked military services to contribute manpower toward a new force of ﬁcyber warriors.ﬂ3 Cyber crimes come in many forms such as industrial espionage, intellectual property (IP) theft, cyber hacktivism, online scams, customer data theft, extortion, identity theft and money laundering.To increase transparency around this threat, security exchanges have introduced regulations directing companies to disclose data breaches. For example, the US Securities and Exchange Commission (SEC) has guided companies to report breaches that are likely to affect investor decisions.4 The European Union and Asia have started to introduce similar breach notice laws. Businesses can no longer afford to take cybersecurity just as a compliance exercise and a cost burden. The mining and metals industry needs to approach the issue of cyber hacking and cybersecurity with the same seriousness as it took health, safety and environment issue in the last decade. There is a historical legacy in mining and metals companies that information technology (IT) came under the responsibility of the chief information ofÞ cer (CIO) whereas operational technology (OT) production control systems were often the responsibility of the relevant technical function. Now, the better practice is that responsibility for the security, maintenance and integration of IT and OT should be managed by the CIO. Key thoughtThe full potential of this threat has just started gaining momentum.":0}