{"7Business risks facing mining and metals 2014Œ2015Carving up beneÞ ts of mining and metals is the reality, ensuring all stakeholders see it similarly based on relative contributions is the challenge. Recently, some stakeholder demands, such as those of suppliers and governments, have largely rebalanced as it has become clear that companies are grappling with reduced proÞ tability. However, other stakeholder demands lag economic reality. Companies that do not effectively manage the competing needs of stakeholders (governments, communities and employees) run the risk of damaging their corporate reputation, enduring project approval delays, Sharing the beneÞ ts Š managing expectations through the commodity price cycle08runaway costs and being subject to protests or violent opposition, and accelerating the move away from a mineral rights ownership model. Managing multiple stakeholders can be done through embracing a multi-stakeholder model, communicating a broad view of shared value and beneÞ ts, and owning transparency and accountability. As commodity prices recover, mining and metals companies need to work to build credibility and trust with all stakeholders now to manage how these increased beneÞ ts are best shared. Transparency initiatives will be part of this and are being enacted in the EU, the US and elsewhere.The nature of the risk has changed and is focused more on skilled than unskilled workers. With the increased focus on improving productivity and a move toward automation, mechanization, data analytics and contract negotiation, there is an increasing level of sophistication in the operations of mining and metals projects and the skills required. In addition, there has been a more proactive approach toward stakeholder management that has seen the introduction of roles, such as government relations and community engagement. Finding the right people to Þ ll these roles is compounded by the high rates of employee turnover in the sector and the time it takes to Þ ll jobs at middle and senior management.Balancing talent needs Š a two-needs economyAccess to water and energy Š competing or depleting0910The skills shortage risk has become more complex and is no longer a universal concept across the sector. It is now a matter of balancing the needs of an advancing industry against the skills that exist and investing in those of the future to avoid it becoming acute in the next cycle. A solution to the issue is beyond the control of an individual company, and it requires industry participants to think whole-of-sector when investing in future skills pipelines. The key is to learn from the last upswing and plan ahead, using a more holistic framework that involves all stakeholders.Accessing water and energy is an essential part of operations for mining and metals projects, and is becoming increasingly difÞ cult. Companies are up against unreliable power supply from the grid and rising energy costs. In emerging and frontier countries, the risk is ampliÞ ed as companies compete with both governments and communities for these scarce resources, with failure to manage a mine™s use of water and energy likely to jeopardize the industry™s SLTO. Managing costs sustainably is a priority. As the cost of renewable energy declines and conventional energy increases, the mining and metals industry will increase its reliance on renewables. The shift toward a resource-efÞ cient and low-carbon operation can ensure community acceptance, but this will come as the economics are proven. Water scarcity is an issue that demands a strategic and practical response from businesses to develop and implement solutions to beneÞ t all stakeholders. This means assessing dependence on water and future supplies, and developing plans to cope with increased prices and possible shortages.":0}