{"Business risks facing mining and metals 2014Œ201528As customers and producers seek to adjust to increased volatility, there is a growing acceptance that this structural change has provided greater depth to the derivatives markets, and for many they can appropriately incorporate physical and derivative trading into their core operations. Many of the larger producers are referring to this as a ﬁrevenue enhancementﬂ strategy as they seek to extract some of the option value created by volatility and their naturally long position. This mirrors the convergence of traders that are increasing their exposure to commodity production.While what has been described relates to iron ore and steel, similar effects though lesser in magnitude can be seen for metallurgical coal, nickel, aluminium and copper. In the prior year, the unwinding of exchange-traded fund (ETF) positions increased the volatility of precious metals, though this has abated somewhat in 2014.Natural currency hedge offsets lower commodity prices in 2013Œ14The effect of declining commodity prices on the underlying earnings of large diversiÞ ed mining and metals majors in FY13 was offset by favorable currency ß uctuations. Favorable movements in exchange rates cannot, however, permanently hedge the downside risk of commodity price declines on earnings. The gains are a one-off and may also have a negative impact in the long 1. ﬁRio Tinto Gets Boost From Flagging Aussie Dollar,ﬂ The Wall Street Journal, 13 February 2014.2. ﬁSpecial FX for the miners™ earnings,ﬂ Deutsche Bank, 21 February 2014, via ThomsonOne.Currency vs. commodity price ß uctuationsTime periodAverage FX offset to commodity price movesLatest reporting period (for which FX offset is calculated)FX offset to commodity price moves in the latest reporting periodAnglo American2002-20139%FY13100%BHP Billiton2001-201321%1H13214%Rio Tinto1998-201311%FY1378%Source: Company data, Deutsche Bank estimatesterm as prolonged currency weakness in the respective country of operation will lead to growing domestic inß ation, eventually amplifying costs as well as wages.1Anglo American reported that currency price ß uctuations offset 100% of the earnings impact of the commodity prices in FY13, compared with a 9% offset over the decade up until 2012.2 The positive impact of currency movements was mainly due to depreciation in the operating currencies of major producers, especially across emerging markets, relative to the US dollar. This increased the monetary value of the export-oriented production.":0}