{"Statin Use in the Metabolic Syndrome  Lundbye and Thompson2124.Randle PJ, Garland PB, Hales CN, Newsholme EA: The glucose fatty-acid cycle. Its role in insulin sensitivity and the metabolic disturbances of diabetes mellitus. Lancet 1963, 1:785Œ789.25.Borkman M, Storlien LH, Pan DA, et al.: The relation between insulin sensitivity and the fatty-acid composition of skeletal-muscle phospholipids. N Engl J Med 1993, 328:238Œ244.26.Shulman GI: Unraveling the cellular mechanism of insulin resistance in humans: new insights from magnetic resonance spectroscopy. Physiology 2004, 19:183Œ190.27.Cline GW, Petersen KF, Krssak M, et al.: Impaired glucose transport as a cause of decreased insulin-stimulated muscle glycogen synthesis in type 2 diabetes. N Engl J Med 1999, 341:240Œ246.28.Austin MA, Rodriguez BL, McKnight B, et al.: Low-density lipoprotein particle size, triglycerides, and high-density lipoprotein cholesterol as risk factors for coronary heart disease in older Japanese-American men. Am J Cardiol 2000, 86:412Œ416.29.Buring JE, O'Connor GT, Goldhaber SZ, et al.: Decreased HDL2 and HDL3 cholesterol, Apo A-I and Apo A-II, and increased risk of myocardial infarction. Circulation 1992, 85:22Œ29.30.Singer DE, Nathan DM, Anderson KM, et al.: Association of HbA1c with prevalent cardiovascular disease in the original cohort of the Framingham Heart Study. Diabetes 1992, 41:202Œ208.31.Miura K, Daviglus ML, Dyer AR, et al.: Relationship of blood pressure to 25-year mortality due to coronary heart disease, cardiovascular diseases, and all causes in young adult men: the Chicago Heart Association Detection Project in Industry. Arch Intern Med 2001, 161:1501Œ1508.32.Lewington S, Clarke R, Qizilbash N, et al.: Age-specific relevance of usual blood pressure to vascular mortality: a meta-analysis of individual data for one million adults in 61 prospective studies. Lancet 2002, 360:1903Œ1913.33.Downs JR, Clearfield M, Weis S, et al.: Primary prevention of acute coronary events with lovastatin in men and women with average cholesterol levels: results of AFCAPS/TexCAPS. Air Force/Texas Coronary Atherosclerosis Prevention Study. JAMA 1998, 279:1615Œ1622.34.Randomised trial of cholesterol lowering in 4444 patients with coronary heart disease: the Scandinavian Simvastatin Survival Study (4S). Lancet 1994, 344:1383Œ1389.35.Girman CJ, Rhodes T, Mercuri M, et al.: The metabolic syndrome and risk of major coronary events in the Scandinavian Simva-statin Survival Study (4S) and the Air Force/Texas Coronary Atherosclerosis Prevention Study (AFCAPS/TexCAPS). Am J Cardiol 2004, 93:136Œ141.This is a post hoc analysis of the 4S and AFCAPS/TexCAPS, looking at the metabolic syndrome.36.Lakka HM, Laaksonen DE, Lakka TA, et al.: The metabolic syndrome and total and cardiovascular disease mortality inmiddle-aged men. JAMA 2002, 288:2709Œ2716.37.Malik S, Wong ND, Franklin SS, et al.: Impact of the metabolic syndrome on mortality from coronary heart disease, cardio-vascular disease, and all causes in United States adults. Circulation 2004, 110:1245Œ1250.This prospective study emphasizes the impact of the metabolic syndrome on CVD.38.Summary of the second report of the National Cholesterol Education Program (NCEP) Expert Panel on Detection, Evaluation, and Treatment of High Blood Cholesterol inAdults (Adult Treatment Panel II). JAMA 1993, 269:3015Œ3023.39.Grundy SM, Cleeman JI, Merz CN, et al.: Implications of recent clinical trials for the National Cholesterol Education Program Adult Treatment Panel III guidelines. Circulation 2004, 110:227Œ239.This report outlines new guidelines of cholesterol management based on recent clinical trials.40.Ballantyne CM, Olsson AG, Cook TJ, et al.: Influence of low high-density lipoprotein cholesterol and elevated triglyceride on coronary heart disease events and response to simvastatin therapy in 4S. Circulation 2001, 104:3046Œ3051.41.Ballantyne CM, Stein EA, Paoletti R, et al.: Efficacy of rosuva-statin 10 mg in patients with the metabolic syndrome. Am J Cardiol 2003, 91:25Œ27.42.Ridker PM: Connecting the role of C-reactive protein and statins in cardiovascular disease. Clin Cardiol 2003, 26:III39ŒIII44.43.Caslake MJ, Stewart G, Day SP, et al.: Phenotype-dependent and -independent actions of rosuvastatin on atherogenic lipoprotein subfractions in hyperlipidaemia. Atherosclerosis 2003, 171:245Œ253.44.Sattar N, Gaw A, Scherbakova O, et al.: Metabolic syndrome with and without C-reactive protein as a predictor of coronary heart disease and diabetes in the West of Scotland Coronary Prevention Study. Circulation 2003, 108:414Œ419.45.Takemoto M, Liao JK: Pleiotropic effects of 3-hydroxy-3-methyl-glutaryl coenzyme a reductase inhibitors. Arterioscler Thromb Vasc Biol 2001, 21:1712Œ1719.46.Ridker PM, Buring JE, Cook NR, Rifai N: C-reactive protein, the metabolic syndrome, and risk of incident cardiovascular events: an 8-year follow-up of 14 719 initially healthy Americanwomen. Circulation 2003, 107:391Œ397.47.Festa A, D'Agostino R Jr, Howard G, et al.: Chronic subclinical inflammation as part of the insulin resistance syndrome: theInsulin Resistance Atherosclerosis Study (IRAS). Circulation2000, 102:42Œ47.48.Ridker PM, Wilson PW, Grundy SM: Should C-reactive protein be added to metabolic syndrome and to assessment of global cardiovascular risk? Circulation 2004, 109:2818Œ2825.49.Balk EM, Lau J, Goudas LC, et al.: Effects of statins on nonlipid serum markers associated with cardiovascular disease: asystematicreview. Ann Intern Med 2003, 139:670Œ682.50.Thompson PD, Buchner D, Pina IL, et al.: Exercise and physical activity in the prevention and treatment of atherosclerotic cardiovasculardisease: a statement from the Council on ClinicalCardiology (Subcommittee on Exercise, Rehabilita-tion, and Prevention) and the Council on Nutrition, Physical Activity, and Metabolism (Subcommittee on Physical Activity). Circulation 2003, 107:3109Œ3116.51.Knowler WC, Barrett-Connor E, Fowler SE, et al.: Reduction in the incidence of type 2 diabetes with lifestyle intervention or metformin. N Engl J Med 2002, 346:393Œ403.":1}