{"166. International Atomic Energy Agency, Survey of radioactivity in food consumed in Austria. Report on second sampling period-January-} une 1961. IAEA report WP /19: v.e. United Nations ment A/ AC.82/G/L.767. 167. Aarkrog. A., J. Lippert, J. Petersen, mental radioactivity in Denmark in 1961. Riso report No. 41; v.e. United Nations document A/AC.82/G/L.802. 168. Agricultural Research Council Radiobiological Laboratory, Annual report, 1961-1962. ARCRL report No. 8 (1962); v.e. United Nations ment A/ AC.82/G/L.806. 169. Agricultural Research Council Radiobiological Laboratory, Annual report, 1962-1963. ARCRL report No. 10 ( 1963) : v.e. United Nations ment A/ AC.82/G/L.858. 170. Hiyama. Y., H. Hayami, N. Yamagata, et al., Japanese dietary habits and the fallout problem II. To be published in J. Rad. Res. 171. Committee on Protection against Ionizing tions, Medical Research Council, The exposure of the population to radiation from fallout. HMSO, London, 1964. 172. Hiyama, Y., H. Hayami, N. Yamagata, et al., Japanese dietary habits and the fallout problem. J. Rad. Res. 3: 61-67 (1961). 173. Mercer, E. R., J. D. Burton, B. 0. Bartlett, tionship between the deposition of strontium-90 and the contamination of milk in the United dom. Nature 198: 662-665 (1963). 174. Harley, J., Prediction of levels of strontium-90 and caesium-137, pp. 210-218 in Hearings before the Subcommittee on Research, Development and Radiation of the Joint Committee on Atomic Energy. 88th Congress, 1 st session. June 3, 4 and 6, 1963; v.e. linited Nations document G/L.849. 175. Bartlett, B. 0., J. D. Burton, F. B. Ellis, et al .. Information on food chain mechanisms obtained by the analysis of survey results. ARCRL report No. 10, pp. 82-85 (1963): v.e. United Nations document A/ AC.82/G/L.858. 176. Minnesota Department of Health, and University of Minnesota, Factors influencing strontium-90 in milk from the Brainerd, Minn. milkshed. U.S. Department of Health, Education, and Welfare, Public Health Service Puhl. No. 999-R-1 ( 1962); v.e. United Nations document A/ AC.82/G/L.821. 177. Schulert, A. R .. Strontium-90 in Alaska. Science 136: 146-148 ( 1962). 178. Miettinen, Y. K., Studies of Sr9° and Cs137 in plants. animals and man in Lapland. Plenary ture held at the 11 th Meeting of Scandinavian Chemists, August 20-25. 1962, Turku, Finland. Personal communication in form of typed script. 179. Aarkrog, A., Preliminary 1963 data on mental contamination in Denmark and its tories. Danish Atomic Energy Commission, search Establishment Riso, April 1964. Personal communication. 180. Health and Safety Laboratory, Fallout program quarterly summary report, January 1, 1964, pp. 73 2-153. USAEC report HASL-142 (1964); v.e. United Nations document A/AC.82/G/L.871. 181. Rivera, J., A comparison of strontium-90 and calcium in infants and adult diets. pp. 273-275 in USAEC report HASL-135 (1963); v.e. United Nations document A/AC.82/G/L.831. 182. United States Department of Health, Education, and Welfare. Radiological Health Data. vol. III, pp. 42-49; 224-242: 471-475 (1962); vol. IV, pp. 177-182; 347-352: 441-446 (1963). 183. Czosnowska, W .. Sr90 in diet in Poland (August 1961-July 1962). In press. 184. Czosnowska. W .. Sr00 in diet in Po1and in the period from 1 August 1960 to 31 July 1961. In press. 185. National Institute of Radiological Sciences, Chiba, Japan, Radioactivity survey data in Japan, No. 1 (1963): v.e. United Nations document A/AC.82-G/L.921. 186. Tsugo, T., H. Nozaki, T. Asari, et al., Radioactive contamination of milk in Japan, 1961-1963. To be published in J. Rad. Res. 187. Bryant. F. J., J. F. Loutit, Human bone olism deduced from strontium assays. AERE port R-3718 ( 1961) ; v.e. United Nations ment A/ AC.82/G/L.668. 188. Rivera, J., Stable strontium concentrations in three bones of the human skeleton. pp. 303-305 in USAEC report HASL-140 (1963); v.e. United Nations document A/AC.82/G/L.856. 189. Rivera, J .. Calcium discrimination by adults and infants, pp. 235-238 in USAEC report HASL-138 ( 1963); v.e. United Nations document A/ G/L.842. 190. Grummitt, W. E .. Strontium and barium in bone and diet. pp. 376-380 in USAEC report TID-7632, Book 2 ( 1962): v.e. United Nations document A/ AC.82/G/L.776. 191. Comar, C. L., Over-all considerations of tium-calcium discrimination, pp. 405--417 in The Transfer of Calcium and Strontium Across logical Membranes. R. H. \\Vasserman, editor, Academic Press, N.Y .. 1963. 192. Kornberg, H. A., The use of element-pair m radiation hazard assessment. Health Physics 6: 46-62 (1961). 193. Bryant, F. J., J. F. Loutit. The entry of strontium-90 into human bone. Proc. Roy. Soc. Series B, 159: 449-465 ( 1964). 194. Lough, S. A., J. Rivera. C. L. Comar, Retention of strontium. calcium and phosphorus in human infants. Proc. Soc. Exp. Biol. Med. 112: 631-636 (1963). 195. McClelan, R. 0 .. J. R. McKenney. L K. Bustad, Changes in calcium-strontium-90 discrimination with ag-e in young miniature swine. Life Sci. No. 12: 669-675 (1962): v.e. USAEC report SA-2790. 196. Ichikawa, R., Y. Enomoto, Strontium-calcium crimination in rats feeding on rice. milk and mercial diets. Health Physics 9: 717-720 (1963). 197. McClelan, R. 0., Calcium-strontium discrimina-":1}