{"tion in miniature pigs as related to age. Nature 202: 104-106 (1964). 198. Della Rosa, R. J., F. Gielow, G. Peterson, Skeletal uptake of injected Sr90: Discrimination against strontium in growing beagles continually ingesting Sr00, pp. 45-51 in University of California, Davis, report UCD-108 (1963). 199. Loutit, F. J., R. Scott Russell, R. S. Bruce, et al., Ratios of Sr90 to calcium in milk and in the bones of infants. Nature 201: 770-772 (1964). 200. Rivera. T.. Strontium-90 in human bones collected during ·1962, pp. 239-248 in USAEC report HASL-138 (1963); v.e. United Nations ment A/ AC.82/G/L.842. 201. Kulp, J. L., A. R. Schulert, Strontium-90 in man. V. Science 136: 619-632 ( 1 %2). 202. Liniecki, J., Some aspects of the kinetics of Sr00 accumulation in the body under conditions of chronic intake. Pelnomocnik Rzadu d/s rzystania Energii Jadrowej. Warszawa, 1963. 203. Marshall, J. H., Theory of alkaline earth olism. pp. 5-29 in Argonne National Laboratory report ANL-6646 (1%3). 204. Pribilla, 0., Der Gehalt menschlicher Knochen und Gewebe an radioaktivem Strontium (90-Sr) in der Bundesrepublik Deutschland in den Jahren 1958-1%2. Dtsch. med. Wschr. 88: 1560-1564 (1963). 205. Cohn, S. H., H. Spencer, J. Samachson, ef. al., The turnover of in man as determined bv whole body counting. Rad. Res. 17: 173-182 ( 1962). 206. Kulp, J. L., A. R. Schulert, E. J. Hodges, tium-90 in man. IV. Science 132: 448-454 (1960). 207. Onstead, C. 0., E. Oberhausen. F. V. Keavy, Cesium-137 in man. Science 137: 508-510 (1962). 208. Fredriksson, L., B. Eriksson, A. Eriksson, et al., Personal communication. 209. Yamagata, N., S. Matsuda, The environmental crease of cesium-137 since 1957 to 1960; v. United Nations document A/ AC.82/G/L.479. 210. Liniecki, J., Personal communication. 211. Agricultural Research Council, Strontium-90 in milk and agricultural materials in the United Kingdom 1959-1960. Report ARCRL-4 (1961); v.e. United Nations document A/ AC.82/G/L.587. 212. Lillegraven, A., L. Lund, 0. L. Michelsen, Quoted by D. A. Barber and W. A. Mitchell. pp. 57-58 in Agricultural Research Council biological Laboratory Annual Report 1962-63. port ARCRL-10 (1963): v.e. United Nations document A/ AC.82/G/L.858. 213. Agricultural Research Council. Surveys of activity in human diet and experimental studies. Report for 1960. Report ARCRL-5 (1961): v.c. United Nations document A/AC.82/G/L.701. 214. Lindell, B., B. Aberg, L. Fredriksson, et al., lected data on radioactivity in Swedish food. Swedish Radiation Council, 1962. 215. Comar, C., R. H. \\Vassermann. F. Vv. mann, ef. al., Fallout and the food-chain: A status review, pp. 426-456 in USAEC report TID-7632, 74 Book 2 (1962); v.e. United Nations document A/ AC.82/G/L.776. 216. United States Department of Health, Education and Welfare, National food consumption survey: Fresh whole milk consumption in the U.S.-July 1%2. Radiological Health Data, vol. IV, No. 1: 15-17 (1963): v.e. United Nations document AC.82/G /L.820. 217. Fredriksson, L., Personal communication. 218. Barber, D. A., W. A. Mitchell, Influence of soil organic matter on the uptake of caesium-137 by perennial rye-grass, pp. 57-58 in Agricultural search Council Radiobiological Laboratory nual Report 1962-63. Report ARCRL-10 (1963); v.e. United Nations document A/AC.82/G/L.858. 219. Bartlett, 0., R. Scott Russell, Personal cation. 220. Anderson, E. C .. G. M. Ward. J. Z. Holland, et al., Cesium-137 in United States powdered milk and in the population, pp. 477-516 in USAEC report TID-7632, Book 2 (1962): v.e. United Nations document A/ AC.82/G/L.776. 221. Abe, M., K. Kitahara, Y. Hiyama, et al., Annual reports of scientific research grants I %3. tion Effects, Ministry of Education, Japan 1964. 222. Madshus, K., A. Str91mme, K. Koren, Caesium-137 body burden in persons chosen at random from selected areas in Norway. Nature 200: 278-279 ( 1963). 223. Madshus, K.. A. Str91mme. K. Koren, Rapport om innholdet av Cesium-137 i melk fra varen 1962 og 1963. Private communication in the form of typed manuscript. 224. Madshus, K., A. Str91mme, K. Koren. Redegj91relse for stralebelastningen fra Cs187 \"in vivo\" hos befolkningen i Vest-Norge 1963. Personal munication in the form of typed report. 225. Hanson, W. C., H. E. Palmer, B. E. Griffin, Radioactivity in Northern Alaskan Eskimos and their foods. Summer 1962. Health Physics 10: 421-429 (1964). 226. Miettinen. J. K., A. Jokelainen, P. Roine. et al., Cs137 and potassium in people and diet-a study of Finnish Lapps. Ann. Ac. Sci. Fennicae. II. ica issue 120, Helsinki 1963. 227. Salo, A., J. K. Miettinen. Strontium-90 and um-137 in Arctic vegetation during 1961. Nature 201: 1177-1179 (1964). 228. Rasanen, E., J. K. Miettinen, Cs137 content of fresh-water fish in Finland. Nature 200: 1018-1019 ( 1963). 229. Paakkola, 0., J. K. Miettinen, Strontium-90 and caesium-137 in plants and animals in Finnish land during 1960. Ann. Ac. Sci. Fennicae. Series A, II. Chemica issue 125, Helsinki 1963. 230. Rundo, J., J. I. Mason, D. Newton, et· al .. cal half-life of caesium in man in acute and chronic exposure. Nature 200: 188-189 (1963). 231. Cohn, S. H .. B. Rosoff, E. A. Gusmano. et al., Long-term Cs1a; turnover in man as measured by a whole body counter. Rad. Res. 19: 655-658 (1963 ). 232. Richmond, C. R., J. E. Furchner, \\V. H. Lang-":1}