{"absorption and methods of elimination : ential behavior of substances in metabolic ways, pp. 526-540 in Symposium on Radioisotopes in the Biosphere, Univ. of Minnesota, apolis, 1960. 265. Beninson. D., Radioestroncio y estroncio estable en la dieta y el hueso humano. Comisi6n Nacional de Energia At6mica de Republica Argentina, 1964. 266. Lindell, B.. Correlations between Cs137 fallout rates, food levels and body burdens. The Radiation Protection Board, Institute of Radiophysics, Stockholm, June, 1964. 267. Martinez, A. M., S. Bulbulian, T. A. Brody, terminaci6n de! estroncio 90 en leches y aguas de lluvia. Instituto de Fisica, Universidad Nacional Aut6noma de Mexico, 1964. 268. Suschny, 0., Uberblick iiber die Radioaktivitat der in Osterreich im Jahre 1961 konsumierten Lebensmittel. Mitteilungen Osterr. Sanitatsverw. 64: 15-24 (1963). 269. Drasil. V., Z. Papezova, Milk contamination by Sr90 in Czechoslovakia. Institute of Biophysics, Czechoslovak Academy of Sciences, Brno. published report to the UNSCEAR. 270. Paakkola, 0., Strontium-90 in Finnish milk ing 1960-63. Personal communication. 271. Saiki, M., N. Mochizuki, To be published in dioactivity Survey Data in Ja pan, No. 3 ( 1964). National Institute of Radiobiological Sciences, Japan. 272. Republic of Ireland, Department of Agriculture, Report on estimated levels of radionuclides in foodstuff during 1961. 1962 and 1963. Personal communication to the F AO. 273. Comitato Nazionale Energia Nucleare, Data on environmental radioactivity collected in Italy (January-June 1961 ). BI0/12/61 (1961); v.e. United Nations document A/ AC.82/G/L.770. 274. Strackee, L., F. C. U. Mattern, Iodine-131 in milk and vegetables during the second part of 1961. Rijks Institut voor de Volksgezondheid, Utrecht. Rep. RA-15 (1962). 275. Strackee, L., F. c. u. Mattern, Sr110 and csm in the human diet in the Netherlands during 1962. Rijks Institut voor de Volksgezondheid, Utrecht. Rep. RA-21 ( 1964). 276. Hvinden, T .. L. Lund, P. Thorensen, Fallout in Norwegian milk in 1961. Interim rapport S-15. Forsvarets Forskninginstitut, Norway, 1962. 277. Lindell. B .. A review of measurements of activity in food, especially dairy milk, and a sentation of the 1963 data on Cs137 and Sr110Ł The Radiation Protection Board, Institute of physics, Stockholm, 1964. 278. Huber, P., 5. Bericht der EidQ\"enossischen mission zur Uberwachung der Radioaktivitat zuhanden des Bundesrates fiir das Jahr 1961. Bulletin des Eidg. Gesundheitsamtes Nr. 4 (1962); v.e. United Nations document A/AC.82/G/L.-801. 279. Huber, P .. 6. Bericht der Eidg\". Kommission zur Uberwachung der Radioaktivitat, zuhanden des Bundesrates fiir das Jahr 1962. Bulletin des Eidg. 76 Gesundheitsamtes Nr. 4 (1963); v.e. United tions document A/ AC.82/G/L.894. 280. Agricultural Research Council, Annual report for 1963-1964. Report ARCRL-12. 281. lJymrnn II. l\\J.. CoAep;irnime cTpOBilTUt-90 B MOJIO:&e OT,11,eJihHDIX pationon CCCP n 1960-1961 roAax n n nepBOll IJOJlODIIBe 1962 ro,a;a. rocy)\\apcTBeHlrn:tt MRTCT no ncrro.'1baonaanl0 atOMHOfi aneprnrr CCCP, l\\focr.na, 1963; v.e. AOnyMeHt OOH A/ AC.82/G/L.-910. 282. Ministere de la sante publique, Service central de protection contre Jes rayonnements ionisants, Surveillance de la radioactivite sur le territoire fram;ais de 1961 a 1963. Rapport SCPRI No 98, p. 18-19 (1963): v.e. United Nations document A/ AC.82/G/L.877. 283. Pazy, N., Y. Feige, Radioactivity in milk in Israel for the period October 1961-June 1%3. Israel Atomic Energy Commission report IA-882 ( 1964 ). 284. Vohra, K. G., V. V. Shirvaikar, V. S. Bhatnagar, et al., Measurements on the environmental activity in India from nuclear weapon tests data collected during 1956-1961. Atomic Energy lishment Trombay report AEET/AM/26 (1962). 285. Vohra, K. G., C. Rangarajan, V. S. Bhatnagar, et al .. Measurements on the environmental activity in India from nuclear weapon tests data collected during 1962-1963. Atomic Energy lishment Trombay report AEET/AM/39 (1963). 286. Asari, T., M. Chiba, M. Kuroda, Strontium-90 and cesium-137 in milk, pp. 9-13 ill Radioactivity survey data in Japan, No. 1 (1963): v.e. United Nations document A/AC.82/G/L.921. 287. Danbara, H., T. Mitsuhashi, Strontium-90 and cesium-137 in milk, pp. 13-16 in Radioactivity survey data in Japan, No. 1 (1963); v.e. United Nations document A/AC.82/G/L.921. 288. Danbara. H., T. Mitsuhashi, Strontium-90 and cesium-137 in milk. To be published in activity survey data in Japan, No. 3, 1964. 289. Asari, T., M. Chiha, M. Kuroda, Strontium-90 and cesium-137 in milk. To be published in activity survey data in Japan, No. 3, 1964. 290. United Arah Republic Scientific Committee on the Effects of Atomic Radiation, \\\\Tide survey of Sr00 in soil, food items and diet of the Delta region of UAR during the period July to December 1961. UARSCEAR report, vol. 4, No. 3 (1962). 291. Mahmoud, K. A .. F. H. Abd-el Said, A. T. Abd-el Fatah, Report on fallout and radioactive content of the food chain in UAR during the year 1962. UARSCEAR report, vol. 5, No. l (1963): v.e. United Nations document A/ AC.82/G/L.932. 292. Mahmoud, K. A., M. K. Moloukhia, S. A. Latif, et al .. Fallout and radioactive content of food chain in U.A.R. during the year 1963. UARSCEAR report, vol. 6-1. June 1964: v.e. United Nations document A/ AC.82/G/L.948. 293. Bryant, F. J., J. R. Moroney. D. J. Stevens, et· al .. Strontium-90 in the Australian environment ing 1961. Australian J. Sci. 26: 69-74 (1963); v.e. United Nations document A/AC.82/G/L.875. 294. Bryant, F. J., W. J. Gibbs, J. R. Moroney, et al .. ":1}