{"International Journal of Computer Applications (0975  8887)  Volume 117  No. 23, May 2015 11 used for classification and regression task[71]. This theory relates it to a family of generalized linear classifiers. In other way, Support vector machine (SVM) is a binary classification and simple regression data mining tool that uses machine learning concept to maximize forecasting accuracy while automatically avoiding local minima and over fitting to the data. Support Vector Machine can be summarized as a system which use feature space hypothesis concept of a linear functions in a d-dimensional space, simulated and trained with a learning algorithm generated from statistical learning theory. There is vast mining tools are available for data analysis, clustering, regression and pattern discovery. One of the tool is Support vector machine so a guide for users for the better understand ability of Support Vector Machines as a widely used classifier and describe the effect of the SVM parameters on the resulting classifier, how to select good values for those parameters, data normalization, factors that affect training time, and software for training SVMs.  Author provides the user with a basic understanding of the theory behind SVMs and focus on their use in practice [72]. To familiarize the concept of Support Vector Machines for data mining this paper introduce support vector machine and highlight the advantages thereof over existing data analysis techniques [73].  The modeling of the relationship between rainfall and river discharges of the Fuji River using the SVRBFN is presented. The main advantage of this approach is that the structure of the network can be obtained objectively, as the SVs of the SVM are obtained from the constrained optimization for a given error bound [74]. Support vector regression is a new regression procedure in water resources for predicting suspended sediments load in rivers [75]. A novel regression approach, termed as the Rough Margin Support Vector Regression (RMSVR) network, is the approach to adopt the concept of rough sets to construct the model obtained by SVR and fine tune it with a robust learning algorithm. Simulation results of the proposed approach have shown the effectiveness of the approximated function in discriminating against outliers [76]. The purpose of the study of the SVM, is to develop a parsimonious model used little operation gage that accurately simulates semi-arid regions by using SVM models [77].  Recommended learning in hydrological prediction environment are, firstly, to examine the limitations in applying conventional method for evaluating the data driven forecasting model performance, and, secondly, to present the new performance evaluation methods that can be used to evaluate hydrological data-driven forecasting model with consistency and objectively. The Relative Correlation Coefficient (RCC) is used to estimate the forecasting efficiency relative to the nave model in data driven forecasting [78]. Support vector machine is a useful tool for knowledgeable data discovery. A novel clustering based Short Term Load Forecasting (STLF) using support vector machine (SVM). The forecasting is performed for the 48 half hourly loads of the next day. The data considered for forecasting contains 2 years of half hourly daily load and daily average temperature. The proposed architecture is implemented in Matlab[79]. Time series data analysis is a new approach along with weighted support vector machine. Typically nonlinear features are introduced through a nonlinear kernel function. While these studies propose a new feature induction algorithm for SVMs. Specifically, new features are induced iteratively. At each step, it weights training examples differently according to the outputs of the current SVM model. The weighted training examples are then used to train a classification model that becomes a new feature for the SVM model [20]. The accuracy of support vector machines (SVM), which are regression procedures, in modelling reference to evapotranspiration (ET0). Obtained result comparison reveals that the support vector machines could be employed successfully in modelling the ET0 process [80]. In this study, four simple dynamic methods and two supervised learning techniques including a linear regression model, a quadratic regression model, an original grey prediction model, a back-propagation neural network model, and an epsilon-SVM regression model were investigated for the forecasting of flood stage one hour ahead for early warning of flooding hazards [81]. Li H.P.(2010) et al introduced a modified SVM based prediction framework which improves the predictability of the inflow using climate data from the prior period [14]. Lingras and Butz (2004) presented unique classifier techniques with support vector machine and rough set theory [82].  Liong Yui-Shie and S.Chandrasekaran (2002) study reveals a novel machine learning and regression technique and application of Support Vector Machine as a robust forecasting tool has been shown with its implementation in the Bangladesh flood stage data [78]. Lin Y.J. et al (2006) presented SVM as a promising method for hydrological prediction. The SVM prediction model is tested using the long term observation of discharges of monthly river flow discharges in the Manwan Hydropower Scheme. Obtained result demonstrates SVM as a very potential candidate for the long term discharges [79]. Mamat M and Samad A.S. compares the performance of Radial Basis Function and Support Vector Regression in time series forecasting. Both methods were trained to produce one step ahead forecasting on two chaotic time series data: Mackey Glass and Set A data. [83]. Misra et al (2009) demonstrated to use Support Vector Machines (SVM) to simulate runoff and sediment yield from watersheds. They have simulated daily, weekly, and monthly runoff and sediment yield from an Indian watershed, with monsoon period data, using SVM, a relatively new pattern-recognition algorithm [84]. Mountrakis et al (2010) presented a review over remote sensing implementations of support vector machines[85]. Solomatine P.D. (2002) described the application of the artificial neural networks, fuzzy rule-based systems, M5 model trees, support vector machine, chaos theory to the problems of water management and control in this research [86]. Shahbazi and Pilpayeh (2012) have implemented the concept support vector machine for forecasting of river flow downstream through examining the data collected from upstream. Results have shown that SVM acts well and efficient in preserving the monthly and yearly features [87]. Torabi M. and Hashemi S. (2012) presented an approach to forecast three-day ahead hourly electric energy consumption. To exact energy consumption patterns, Neural Network and Support Vector Machine are adapted in a novel manner [88]. Wu et al (2004) implement concept of Support Vector Regression (SVR) for the use of identifying prediction of travel time and compare its result to other travel time forecasting method using real highway traffic datasets [89]. Yang et al (2009) used the concept of non- stationary and volatile data with localized support vector regression model [90]. Yi D. and Wei C. experiment shows that the fitting value which obtains using the return to first would be more precise than directly[91]. Xian and Zeng presented a two-phase, efficient, and fair evaluation method for DRMs (digital right management system) basing on SVM. Influence of three difference methods and test set number on evaluation result id discussed [92]. Yoon H. et al developed two nonlinear time series models for predicting ground water level fluctuations using artificial neural networks (ANNs) and support vector machines (SVMs). The results of the model performance show that root mean square value of ANN models is lower than those of SVM in model training and testing stages [93]. ":1}