{"International Journal of Computer Applications (0975  8887)  Volume 117  No. 23, May 2015 13 genetic algorithm can be defined based on the following equations: SGA = (C, E,P0 ,M  ,T )  Where C is the initial population coding scheme; E is the fitness function; P0 is the initial population; M is the scale of operator;  is the mutation operator; T is the stop criterion. (Mutao H, 2007)[104]. GA operates on a population of potential solutions by applying the principle of survival of the fittest to achieve an optimal solution. Every solution in the temporary population is ranked against other solutions based on a fitness criterion. Li S et al. (2009) proposed an improved genetic algorithm to solve the disadvantage of the standard genetic algorithms inaccuracy of coding and low-precision. The improved genetic algorithm gets better results in calibration of the three-source XinAnJiang model [108]. Patil et al. (2012) compared  the ANN, fuzzy logic and genetic algorithms for rainfall- runoff modeling [109]. Banik et al. (2009) investigated the development of an efficient model based on Fuzzy logic System for the prediction of monthly monsoon rainfall for a number of stations [110].  7. REVIEW OF RAINFALL RUNOFF MODELING BASED ON ROUGH SET THEORY AND FUZZY LOGIC APPROACH  Rough set theory is a mathematical theory to deal with uncertainty and incompleteness of data which was proposed by Pawlak. It is based on the capability of classifying the data observed and measured directly. The Knowledge is based on the ability of classifying objects. For the analysis of knowledge dependency none of other additional information is needed like probability in statics and weight in fuzzy set.  On the basis of Rough set theory, single element medium and long term classification forecast model has developed using historical hydrological data.  Medium and long term hydrological forecasting are crucial to the optimal distribution and utilization of water resources. The main method for medium and long term forecasting is multi factor forecasts and single factor forecasts.  Dong et al. (2004) developed rough set theory based model which reflects the non linear relations between the input and output effectively. The model composed of the decision rules which are very simple and could be comprehended easily and the model is more credible if the quantity of swatches is larger [111]. Hundecha et al. (2001) described Fuzzy logic model which is based on the theory of fuzzy sets. In a fuzzy set the boundary is not clearly defined and partial membership of an element is possible. Each element of the set is assigned a membership value which can be between 0 and 1 inclusively. The function that assigned this value is pointed to as the membership function related with the fuzzy set. Fuzzy numbers are special type of fuzzy sets defined on the set of the real numbers. Fuzzy numbers are generally defined by using membership function which have triangular shapes and are given as (a1, a2, a3)T such that a123, are trapezoidal shapes that are expressed as (a1, a2, a3, a4)R such that a1234 [77]. Mahabir et al. (2003) proposed a Fuzzy logic approach could be used to simulate actual component of hydrologic processes such as snowmelt, runoff, evaporation and basin response. On the availability of vast data the fuzzy logic model physically developed. The main objective of this study was to develop the potential viability of an alternate approach for water supply forecasting based on fuzzy logic. Based on fuzzy set theory, fuzzy logic is being applied in several fields where empirical relationships are not broadly defined [112].  Alvisi et al. (2006) presented data driven water level forecasting models on the basis of fuzzy logic and ANN. The analyses are made with great attention to the reliability and accuracy of each model for water level forecasting [113]. Shrike et al. (2012)   ANN and Fuzzy logic System based Model was generated. ANN based result applied in fuzzy system for further analysis. Fuzzy system was applied for opening and closing of the Dam gate. This Model is known as Neuro-Fuzzy model is to be prepared for Dam Gate operation for flood monitoring and control system [114] 8. MODEL EVALUATION On the basis of literature survey, it is observed that the evaluation of each approaches for both testing and training data are coefficient of determination R2, root mean square error (RMSE), relative mean error (RME) and relative absolute error (RAE). These are widely implemented for the evaluation of effective results of time series forecasting [4-5]. 9. CONCLUSION AND FUTURE STUDY Based on the literature review, it is find out that data based models are an alternative method used for runoff forecasting particularly useful in flood prone area. Multiple linear regression (MLR) and autoregressive moving average (ARMA) models, autoregressive integrated  moving average (ARIMA) are probably the most common data based methods currently employed for forecasting runoff . Data based artificial intelligence models like ANN; SVM can also be developed with limited data and without a priori knowledge of the mathematical relationships interlinking inputs with outputs. Based on the review, it is observed that available models have limitations of times; effective only for site specific, expensive in data collection, lack of security and data transferability in similar watershed. After critical review of the literature, it is observed that  there are very few mathematical  and computational models available to predict real time hydrological forecast objectives i.e., to provide livelihood  security through  flood management  especially  designed for  degraded and  flood prone areas. Also there  is scarcity  of model for  prediction of  livelihood security  with respect to  holistic development  of environmental  economic and  socio-economic yield.  There are several potential directions for future research.  First we would like to investigate what measures best reflect the performance of existing models. Second we try to develop a rainfall-runoff model and improve the hydrological prediction with maximum accuracy.  10. REFERENCES [1] Chaubey V.,  Mishra S. and Pandey,S. K. (2014), Time series data mining in real                time surface runoff forecasting through support vector machine, IJCA(0975-8887), ISBN : 973-93-80882-93-2, 98(3),  PP 23-28. Doi> 10.5120/17163-7223.  ISBN: 973-93-80882-93-2. [2] Gupta, P., Mishra, S., and Pandey, S. K. (2014), Time series data mining in rainfall forecasting using artificial neural network, IJSET (ISSN: 2277-1581), 3(8), pp 1060-1065. [3] Mishra,S.,  Tiwari,H. L.,  Shukla J. P. and Purvia,R. (2014), Estimation of runoff and flood risk in the Narmada River Basin using hydrological time series data mining, in 19th International conference on \"Hydraulics, Water Resources, Coastal & Environmental Engineering (HYDRO 2014 INTERNATIONAL)\", MANIT, Bhopal. [4] Mishra, S. Gupta, P., Pandey, S.K., Shukla, J.P. (2014), An ":0}