{" 345iv. Beam-column joint shear check following two criteria: (1) joint shear cracking check by comparing the principal tensile stress with the concrete tensile strength; (2) if joint shear cracking is identified in (1), then conduct strut-and-tie analysis to determine the shear reinforcement.   4. EXPERIMENTAL PROGRAM  Four large-scale SRC-MRF connection models will be tested using the test configurations shown in Fig.4. Three exterior connection models, each representing one of the proposed composite MRF structures, will be designed and tested. Another test will be conducted for interior connection configuration. During each test, axial load will be applied to the column while cyclic transverse forces will be applied to the beam tips. In order to take full advantages of existing data and testing experiences at the laboratory, it is planned to use AISC W24x76 steel beams. Selection of this steel shape will allow to compare the test results of the current project with those conducted for welded SRC column and steel beam connections by Uang et al. (Chou and Uang 1998, 2000) and the welded steel connections tested by the authors (2000, 2002).   4.1. Design of Steel Beam Bolted to RC Column Connection Specimen  Based on the proposed design procedure and considering the dimensions of Uang™s specimens, the exterior connection details were chosen and shown in Fig.5.  The design and analysis of the specimen are described hereafter. Note that the strength reduction factors are taken to be unit for the design of specimens.   4.1.1. Flexural strength of steel beam For seismic design, the nominal strength of the steel beam can be calculated as the plastic moment, Mp,   Mp=FyZ         (1)  where, Fy is the yield strength of the steel and Z is the plastic section modulus. The corresponding shear Vp in the steel beam with a clear shear span length lb can then be determined as,   Vp=Mp/lb          (2)  The AISC W24x76 beam has a plastic section modulus Z=3.28x106 mm3 (200 in.3). If ASTM A572 Grade 50 Steel (yield strength Fy = 345 MPa = 50 ksi) is used, then the plastic moment is calculated as Mp=FyZ=1130 kNm (10,000 kip-in.), and the shear force corresponding to the plastic moment is, Vp=Mp/Lb = 1130/3.125 = 361.2 kN.   4.1.2. Reinforced concrete column design The shear demands in the columns and the moment demands at column ends should be calculated based on the plastic moments acting at the ends of beam. For a story height of 3.4 m, the shear in the columns is calculated as Vc = 358 kN, and the moment demand at the beam column interface is then 464 kNm. Based on ACI-318 codes, the reinforcements for the 510x510 square column with concrete strength of fc™ = 35 MPa (5.08 ksi) are determined and shown in ":0}