{"International Journal of Computer Applications (0975  8887)  Volume 117  No. 23, May 2015 7 framework of new algorithm for Rainfall runoff modeling. (Patil et al, 2012) A review of relevant literatures has been done as a part of this work. The focus of the review has been to identify sources of information and techniques that would help for the development of a methodology for the hydrological prediction. This paper gives an overview of previous work done on related topic that provides the necessary background for the purpose of this research. The literature review concentrates on runoff prediction. Many models have been developed for forecasting the runoff. In spite of substantial efforts by hydrologist/scientist cannot yet make any accurate models for runoff predictions for the river Brahmaputra. The hydrological prediction literature contains many comparisons and evaluations of prediction algorithms. There are several literature reviews that focus on evaluation of rainfall, runoff and water level prediction algorithms based on gauge or sensor data and other measurements.  2. REVIEW OF CLUSTERING APPROACH FOR THE HYDROLOGICAL STUDY Hydrological forecasting is an important aspect of hydrological services on economy and society, especially making prediction of disastrous hydrological phenomena. Currently, the main applications of cluster algorithms in hydrological forecasting include rainfall monitoring, flood forecasting, and water quality monitoring, inflow and outflow calculation. The main clustering methods contain k-means method, hierarchical method, Similarity search, SOM method and FCM method (Tian et al., 2014). Purviya R. Et al.  (2014) described clustering can be done by the different number of algorithms such as hierarchical, partitioning, grid and density based algorithms. This paper is original concerns in two main aspects. First, it provides an evolutionary algorithm for clustering starting from data mining mechanism, tasks and its learning. Second, it provides a taxonomy that highlights some very important aspects in the context of clustering algorithms, namely, hierarchical, partitional algorithms, density based, grid based and model-based. Developing a hydrological model based on past records is crucial and effective in many water resources applications such as optimal reservoir operation, drought management, flood control, hydropower generation and sustainable development of watershed area, etc13. Ramoni et al.  (2000 presented a study on BCD, a Bayesian algorithm for clustering by dynamics. BCD is basically an unsupervised algorithms based on agglomerative clustering method. The clustering result is evaluated mainly by a measure of the loss of data information induced by clustering, which is specific to the proposed clustering method. They also presented a Bayesian clustering algorithm for multivariate time series 21. The algorithm searches for the most probable set of clusters given the data using a similarity-based heuristic search method. The measure of similarity is an average of the KullbackLiebler distances between comparable transition probability tables. Van Wijk and Van Selow (1999) analysed an agglomerative hierarchical clustering of daily power consumption data based on the root mean square distance. How the clusters distributed over the week and over the year were also explored with calendar-based visualization 22. Vlachos et al. (2003) introducing a novel anytime version of k-Means clustering algorithm for time series. In this work we address these challenges by introducing a novel anytime version of k-Means clustering algorithm for time series. It is an approach to perform incremental clustering of time-series at various resolutions using the Haar wavelet transform. Using k-Means clustering algorithm, for the next level of resolution, they modified the final centers at the end of each resolution as the initial centres 23.  Li and Biswas (1999) described a clustering methodology for temporal data using the hidden Markov model representation. The proposed continuous HMM clustering method can be summarized in terms of four levels of nested searches. The HMM refinement procedure for the third-level search starts with an initial model configuration and incrementally grows or shrinks the model through HMM state splitting and merging operations. They generated an artificial data set from three random generative models: one with three states, one with four states, and one with five states, and showed that their method could reconstruct the HMM with the correct model size and near perfect model parameter values.24. Wei T. et al., (2014) described cluster analysis techniques in data mining play an important role in the study of meteorological applications. Warren Liao T., (2005) presented the basics of time series clustering are presented, including general-purpose clustering algorithms commonly used in time series clustering studies, the criteria for evaluating the performance of the clustering results, and the measures to determine the similarity/dissimilarity between two time series being compared, either in the forms of raw data, extracted features, or some model parameters. There seems to be an increased interest in time series clustering as part of the effort in temporal data mining research. Clustering is necessary when no labeled data are available regardless of whether the data are binary, categorical, numerical, interval, ordinal, relational, textual, spatial, temporal, spatio-temporal, image, multimedia, or mixtures of the above data types 25. Uncertainties in climate change and human activities have great impacts on water resources. It mainly includes rainfall change, runoff decrease, flood disaster and so on. Thus, the reasonable configuration and integrated planning of water resources are important parts of the water resources management. Clustering algorithms classify different watersheds with similar hydrological characteristics. Changes of precipitation, basin evaporation and snow density under certain climatic conditions, have been studied. At present, the clustering methods in this field contain the k-means, hierarchical method, SOM method and FCM method. In view of the clustering algorithms, k-means and hierarchical methods are widely used in hydrological applications mentioned above for their typicality and distinct advantages.  3. REVIEW OF RAINFALL RUNOFF MODELING BASED ON REGRESSION APPROACH Adequate literature is available on stochastic modeling. Generally, the rainfall-runoff forecasting model needs to fulfil four principles: parsimony, modesty, accuracy and testability (Abrahart and See, 2000). It is obvious that a large number of models have been developed and used both as research and as operational tools 26.  The most widely-applied procedure for hydrological regionalization applied to date has been the so-called Method of Residuals, in which the classification and modeling are carried out simultaneously, with the appropriate models being developed by application of MLRA. The hydrological index variable (quantile) is regressed upon catchment and rainfall characteristics for the whole data set. The residuals, i.e. the differences between the observed and computed values of the index variable, are plotted geographically in order to identify groups of these differences that are similar in both magnitude and sign and can therefore be regarded as a sub-region; and the regression analysis is repeated ":0}