{"Table 5.1-1 Biofuel Volumes Modeled in 2022 (Billions of Gallons) Biofuel Reference Case Control Case Change Corn Ethanol 12.3 15.0 2.7 Corn Residue Cellulosic Ethanol 0 7.5 7.5 Sugarcane Bagasse Cellulosic Ethanol 0.3 1.4 1.1 Switchgrass Cellulosic Ethanol 0 1.3 1.3 Other Ethanol 0 0.2 0.2 Biodiesel 0.4 1.0 0.6 5.1.3 Biofuel Feedstock Assumptions In order to run a representative model of the U.S. and international agriculture sectors to analyze the impact of the RFS2 biofuel volumes requirement, a series of assumptions and input parameters were set in order to achieve two major goals in our analysis.  First, that the input assumptions are based on the most current data and projections available in government, industry, and academia; and second, to ensure that the two agriculture models, FASOM and FAPRI, were analyzing similar real-world assumptions, and thus present a detailed and consistent worldwide analysis.  Table 5.1-2 lists some of the key assumptions associated with the agriculture sector modeling, as well as the source for these assumptions.  Additional details on the assumptions included in FASOMPPPPPPPPPP and FAPRIQQQQQQQQQQ are included in the docket. A series of information was gathered from and reviewed by other government agencies, such as USDA and DOE. These include corn and soybean yields,RRRRRRRRRR corn ethanol dry and wet mill plant processing energy use, corn ethanol yields, corn ethanol by-product use, and estimated corn stover yields.  For other assumptions, we relied on external expertise, such as FAPRI; the Greenhouse gases, Regulated Emissions and Energy use in Transportation (GREET) model;SSSSSSSSSS the Assessment System for Population Exposure Nationwide (ASPEN) model;TTTTTTTTTT and the Agriculture Resource Management Survey (ARMS).UUUUUUUUUU PPPPPPPPPP Beach, Robert; McCarl, Bruce, Agricultural Impacts of the Energy Independence and Security Act: FASOM Results and Model Description, RTI International, October, 2008. QQQQQQQQQQ Technical Report: An Analysis of EPA Biofuel Scenarios with the FAPRI International Models, CARD staff, November, 2008. RRRRRRRRRR USDA Agricultural Projections to 2017 (OCE-2008-1), February, 2008. SSSSSSSSSS The GREET model is run by Argonne National Laboratory at the Department of Energy.  GREET can simulate more than 100 fuel production pathways and more than 80 vehicle/fuel systems.TTTTTTTTTT ASPEN is a computer simulation model used to estimate toxic air pollutant concentrations is called the Assessment System for Population Exposure Nationwide, or. This model is based on the EPA™s Industrial Source Complex Long Term model (ISCLT) which simulates the behavior of the pollutants after they are emitted into the atmosphere. ASPEN uses estimates of toxic air pollutant emissions and meteorological data from National Weather Service Stations to estimate air toxics concentrations nationwide. UUUUUUUUUU ARMS is sponsored by the Economic Research Service (ERS) and National Agricultural Statistics Service (NASS) at USDA, and provides observations of field-level farm practices, the economics of the farm business, and the characteristics of the American farm household. 645 ":1}