{"Quantity of Forest Residue The quantity of forest residue available to produce biofuels was estimated by two different studies.  We summarize those two studies, and then summarize data which we received directly from the U.S. Forest Service Billion Ton Study A landmark assessment of the potential biomass available from existing forest land in the U.S. was recently conducted by the USDA and the Department of Energy (DOE).58 This landmark assessment was titled ﬁBiomass as Feedstock for a Bioenergy and Bioproducts Industry:  The Technical Feasibility of a Billion Ton Supply,ﬂ which is also known as the Billion Ton Study. We reviewed this study and are summarizing much of the information contained in that report here because it is very useful background about U.S. forest land and its potential contribution to biofuels. The total forest inventory is estimated to be about 20.2 billion dry tons.  The report authors estimated that about 2.2 percent of the total forest inventory is harvested each year, which corresponds to 444 million dry tons.  This removal rate is estimated to be less than the annual average forest growth, which suggests, at least on an aggregate basis, that this removal rate is sustainable. It is estimated that 78 percent of this removal was for roundwood products (sawlogs, pulpwood, veneer logs and fuel wood), 16 percent was logging residue and about 6 percent was classified as other removals.  Thus, the Billion Ton study authors estimate that 67 million dry tons of logging residue would potentially be available for biofuel production, which is comprised of 49 million dry tons of primary logging residue, and 18 million dry tons of other removals.  The Billion Ton study estimates that 65 percent of the total logging and other residue would be recovered for use. The two reasons cited for not collecting the other 35 percent is that some of the logging residue is comprised of small pieces, such as small branches and leaves, which would not be economically recoverable, and that it would be necessary leave behind a portion of the logging residue would be to protect the sustainability of the forest as well as the wildlife which thrives in the forest. For these reasons, the Billion Ton Study authors estimated that 41 million dry tons of forest residue could be sustainably removed from the U.S. forests as byproduct from existing logging operations.  Virtually all this removal is from privately owned land where the logging operations occur today. Additional forest residue is available downstream of the logging operations at mills.  In the process of making their products, primary wood processing mills create some waste or residue. However, almost all of this waste wood is recovered or burned for process heat.  For example, the bark from the logged wood is burned as fuel or converted into mulch.  However, the Billion Ton authors estimated that just under 2 million dry tons per year of residue would be available from the primary wood processing mills as feedstock for producing biofuels.   The Billion Ton study estimates that additional wood waste could also be available from secondary wood processing mills, which refine crude wood into more refined products.  The report authors could not find any data on how much residue is produced by these secondary wood processing mills, however, a study of these facilities did provide an estimate.  29":1}