{"Projected crop yields, both domestically and internationally, constitute one of the most influential factors of this agricultural analysis.  The yields presented in Table 5.1-2 are based on the USDA projections through 2017 (the last year of their baseline projections report) and then extrapolated out to 2022. The yields in this table represented the national weighted average yields, which vary by region. These yields are based on historical averages for the region, which increase over time in both the AEO Reference case and the EISA Control Case.  FASOM assumes the rate of increase is (1.6% per year).  For this proposal, we modeled the same yields in both the Reference Case and the Control Case, assuming there was no significant impact on yields due to commodity price changes resulting from the RFS2 volumes (i.e., no price-induced yield changes). In addition, we did not model changes in yields that might occur based on increased planting on marginal land or management practices (e.g., residue removal, corn after corn rotations) as a result of the RFS2 volumes. For cellulosic biofuels from corn residues, the current assumptions in FASOM for residue removal rates are based on the Graham et. al. paperVVVVVVVVVV and the Perlack et al study.WWWWWWWWWW  This approach uses a maximum percent removal of residues on acres based on tillage practices.XXXXXXXXXX  Other recent papers have raised the issue that a more relevant metric is a minimum amount of mass that must remain on an acre of land to prevent runoff and maintain soil carbon levels.YYYYYYYYYY However, we were unable to obtain national or regional estimates in time for the proposal.  We intend to review these assumptions between proposal and final, and, if possible, update these assumptions as appropriate.  In addition, we plan to review in more detail the sustainable removal rates for other crops such as wheat and rice residues.ZZZZZZZZZZ,AAAAAAAAAAA FASOM assumes fertilizer application rates do not increase over time in proportion to the increase in yields, as shown in Table 5.1-2.  This data is based on USDA data that shows fertilizer application rates per acre remaining relatively steady for the past 30 years, during which time corn yields have increased approximately 70%.BBBBBBBBBBB  However, it may be reasonable to assume that there may be a corresponding increase in fertilizer rates as crop yields increase into the future, and EPA requests comment on the relationship. In addition, when residues are removed from the field, some of the nutrients that are contained in the residue must be replaced through additional fertilizer use. For the proposal, we assumed that 7 additional pounds of nitrogen and 3.6 lbs of phosphorous must be applied per ton of residue removed.  We will continue to review these assumptions for the final rule. VVVVVVVVVV See also http://www.cpnrd.org/Harvesting%20Stover.pdfWWWWWWWWWW Available at http://feedstockreview.ornl.gov/pdf/billion_ton_vision.pdf. XXXXXXXXXX Many site specific factors associated with the sustainable removal of residue (e.g., crop type, soil type, soil fertility, slope, and climate) affect which geographic regions are suitable for crop residue removal. Detailed modeling of these factors was beyond the scope of this analysis.  YYYYYYYYYY Wilhelm et. al Corn Stover to Sustain Soil Organic Carbon Further Constrains Biomass Supply, Ag Journal (2007)ZZZZZZZZZZ Kerstetter JD, Lyons JK. Logging and agricultural residue supply curves for the Pacific Northwest. Washington State University Energy Publication; 2001 AAAAAAAAAAA Banowetz et al.  Assessment of straw biomass feedstock resources in the Pacific Northwest. Biomass and Bioenergy.  In Press BBBBBBBBBBB Data from the National Agriculture Statistics Service (NASS) at USDA: http://www.nass.usda.gov/ 646 ":1}