{"        Table 4.4-22. Summary of Year-by-Year Volumes (Billion Gallons/year) Year Gasoline Volume CornEthanol Volume  Cellulosic Ethanol Volume Imported Ethanol Volume Diesel Fuel Volume Biodiesel Volume Renewable Diesel Fuel Volume 2009 148.7 0.34 0.00 0.00 54.3 0.08 0.00 2010 149.8 1.04 0.00 0.00 55.8 0.23 0.01 2011 150.4 1.60 0.06 0.00 57.3 0.37 0.03 2012 151.4 2.12 0.25 0.00 58.2 0.62 0.04 2013 152.4 2.82 0.75 0.00 58.7 0.61 0.06 2014 153.2 3.39 1.50 0.16 59.3 0.69 0.07 2015 154.0 3.90 2.75 0.45 60.0 0.66 0.09 2016 154.7 3.84 4.00 0.80 60.7 0.54 0.10 2017 155.1 3.70 5.25 1.25 61.3 0.52 0.12 2018 155.1 3.51 6.75 1.71 61.9 0.51 0.13 2019 155.2 3.31 8.25 2.15 62.6 0.49 0.15 2020 154.8 3.17 10.25 2.10 63.4 0.47 0.16 2021 155.1 2.93 13.25 2.04 64.2 0.45 0.17 2022 155.4 2.71 15.75 2.50 65.0 0.43 0.19 2023 154.8 2.71 15.75 2.50 65.9 0.43 0.19 2024 154.3 2.71 15.75 2.50 66.8 0.43 0.19 2025 153.4 2.71 15.75 2.50 67.7 0.43 0.19 2026 153.2 2.71 15.75 2.50 68.8 0.43 0.19 2027 153.2 2.71 15.75 2.50 69.8 0.43 0.19 2028 153.3 2.71 15.75 2.50 70.9 0.43 0.19 2029 153.3 2.71 15.75 2.50 71.9 0.43 0.19 2030 153.7 2.71 15.75 2.50 73.0 0.43 0.19 Also for our year-by-year cost analysis, we needed year-by-year estimates of the production and distribution cost for each renewable fuel type.  The feedstock costs were available for the years 2012, 2017 and 2022 from FASOM for corn ethanol and soy oil, used for producing biodiesel, with crude oil priced at $53/bbl and $92/bbl.  We entered those feedstock costs into the respective cost models and interpolated and extrapolated the production costs for the years provided to develop production costs for the in-between years.  For cellulosic ethanol, we assumed the same feedstock costs for all years, but we adjusted the production costs based on our adjusted NREL production costs, interpolating between the years for which we have specific cost data. Since the costs change so much for cellulosic ethanol, the costs in any one year were based on the accumulated costs from the previous years.  For example, the production costs in the year 2015 are a function of the production costs times the new volume of cellulosic ethanol in 2015, plus the production costs times the volume of new cellulosic ethanol in 2014, and so on.  This avoids underestimating the costs in the later years.  Imported ethanol costs by year are from Section 4.1 above. Tables 4.4-23 and 4.4-24 summarize the renewable fuels production and distribution costs by year along with the projected crude oil, gasoline and diesel fuel wholesale costs. Table 4.4-23 represents the projected costs based on crude oil priced at $53 per barrel, and Table 4.4-24 presents the projected costs based on crude oil priced at $92 per barrel.    622 ":0}