{"                                                           Soil Health In terms of soil health, residues perform many positive functions for agricultural soils. Recent studies and reviews have attempted to address these issues.  Despite a few shortcomings, existing research can be used to some extent to guide practices or make estimates, especially for corn stover harvest in the Corn Belt, which has been studied more extensively than the other residues except, perhaps, wheat. In a review by five USDA Agricultural Research Service (ARS) scientists, Wilhelm et al. acknowledged the complexity of interactions between soil type, climate, and management when considering crop residue effects on soil. They recommended that removal rates be based on regional yield, climatic conditions and cultural practices, with no specific rates given.27 Using the Revised Universal Soil Loss Equation (RUSLE) technology and the Wind Erosion Equation (WEQ), Nelson predicted safe residue removal rates for minimizing soil loss in the Eastern and Midwestern U.S. These predictions varied widely over time and location as a result of the complex interactions discussed by Wilhelm et al. 28,29  In another recent review, sponsored by the U.S. Department of Energy (DOE), Mann et al. concluded that before specific recommendations could be made, more information was needed on the long term effects of residue harvest, including: 1) water quality; 2) soil biota; 3) transformations of different forms of soil organic carbon (SOC); and 4) subsoil SOC dynamics.30 Current USDA Natural Resource Conservation Service (NRCS) practice standards for residue management shy away from specific residue quantities and point to the use of the RUSLE2 model for guidance (without specifics on how to do so).31  Despite broad recognition of the need for specific guidelines for residue removal, none yet exist. With the upsurge in biofuels and the obvious prospects of removing significant quantities of residue, many questions remain regarding the long-term effects on soils of residue removal.  Residues haven™t yet been removed at the contemplated rates over a period sufficiently long for the effects to be clearly determined.  Another difficulty is that while the effects of removing a residue may appear to one observer to have affected the soil in a certain manner, it may not be completely clear that the observed effects were totally related to the residue removal or, were in fact related to a change or to combinations of changes in other variables that were simply missed.  A second observer may view the same results in an honest, but different manner.  There are so many variables with so many different interactions among them that assigning effects is very difficult at best. There simply are no real-world data available for determining long-term effects.   Nevertheless, we can describe some of the interactions that take place and how they can potentially affect soil health. Soil Erosion Soil erosion is an extremely important national issue.  Most, if not all, agricultural cropland in the United States experiences some degree of soil erosion each year due to rainfall (water) and/or wind forces. Rainfall erosion (sheet and rill) occurs when rain directly strikes the soil, dislodging particles in the top layer.F  When soil becomes saturated, particles are F rill: A small intermittent watercourse with steep sides, usually only a few inches deep; www.hancockcoingov.org/surveyor/drainage_glossary_of_terms.asp. 20":0}