{"              Yet another issue regarding sustainable removal is the affect of forest residue extraction on biodiversity. The removal of forest residue may affect biodiversity because lower amounts of wood in the forest imply fewer habitats for species using wood for breeding.  Species may also be threatened because certain insects colonize in wood that may be burned for energy purposes.  Quantitative predictions about how much habitat loss various species can tolerate are almost impossible to make.  Instead, one study recommended making qualitative predictions on which types of habitats or wood types are most threatened.  For instance, this study examined Sweden™s forest fuel extractions and concluded that coniferous wood can be harvested to a rather large extent, whereas deciduous tree species should be retained to a larger degree.54  As different regions will certainly have species specific to their own regions, more research is necessary to determine appropriate recommendations on maintaining biodiversity.  Another issue that has been considered is the occurrence of soil disturbance due to the use of forest residue collection equipment.  Studies have shown that the growth of woody plants and yields of harvestable plant products are decreased by soil compaction from residue collection equipment, because of the combined effects of high soil strength, decreased infiltration of water and poor soil aeration.55  In another study, the use of a residue bundling machine caused some measurable amounts of soil disturbance and an increase in ﬁsoil exposedﬂ area at some locations.56  Thus, it is important to limit the severity of soil disturbances with minimal passes and relatively low ground pressure. Energy Content of Forest Residue and Biofuel Woody material obtained by the harvesting or thinning of forest is somewhat more energy dense compared to other forms of biomass.  On its Biomass Program webpage, the Department of Energy lists the higher heating values (lower heating values were not available) for many different types of biomass for dry samples.57  These values for woody biomass are summarized in Table 1.1-7. Table 1.1-7. Energy Content of Forest Material Tree name Higher Heating Value (BTU/lb dry wood) Hybrid Popular 8,384 - 8,491 Black Locust 8,409 - 8,582 Eucalyptus 8,384 - 8,432 American Sycamore 8,354 - 8,481 Eastern Cottonwood 8,431 Monterey Pine 8,422 Because woody material is energy dense, it can produce a large amount of renewable fuels per ton of feedstock. Based on the data in FASOM, we assumed that 89 gallons of ethanol could be produced per each ton of dry (15 percent moisture) woody feedstock in 2022. 28":1}