{"E85.GGGGGGGGGG For estimating the program costs for using E85 (shown in Tables 4.4-12 and 4.4-13), we adjusted E85 price back up to 5 cents per gallon less than the gasoline price for each case (the additional time spent refueling is a true cost).  We then used the relative energy density of the E85 to that of gasoline as reported by the refinery model (see energy content values in20) to account for the energy density costs for using E85.  We preferred the energy content price cost made by the refinery model to our preliminary E85 energy content price adjustments because the refinery model can also account for changes in gasoline energy content made when accommodating the blending of ethanol.  We are not assuming that the price adjustment that we made to account for lower E85 availability account for any additional social cost.  If the FFV driver would have to drive out of his way from time-to-time to find the E85, then there would be some extra cost associated with the lower availability.  But most of the time FFV drivers would likely learn where to find E85 along the routes that they normally frequent, thus, no additional effort and cost would be incurred for refueling on E85.  Thus, we assume that the lower E85 price to account for reduced E85 availability is purely a transfer payment from the refiner to the FFV owner. The assumption used here and throughout this proposed rulemaking is that ethanol™s fuel economy is directly proportional to its energy density and its concentration in the fuel.  Since the volumetric energy content of ethanol is approximately 33 percent less than conventional gasoline, we assumed this loss in fuel economy proportional to its concentration in the fuel.  Some studies have suggested, however, that ethanol™s decrease in fuel economy may be less than its relative decrease in volumetric energy content of the fuel.  In other words, there is less of a fuel consumption decrease than what the lower energy density of ethanol would suggest.  However, for a variety of reasons, we have reason to question the data from these studies.  We therefore intend to investigate this issue more for the final rule as new data become available. 4.4.1.6 Other Adjustments to the Costs As discussed above, we needed to adjust the estimated program costs from costs based on $51/barrel crude oil, the crude oil price at which the refinery model was run, to $53/bbl and $92/bbl, the crude oil costs that served as the basis for our cost analysis.  To make these adjustments we estimated the wholesale gasoline and diesel fuel prices (which are the surrogate for the gasoline and diesel fuel production costs) at the adjusted crude oil price and compared these adjusted wholesale gasoline and diesel fuel adjusted prices to the baseline wholesale gasoline and diesel fuel prices.  The baseline wholesale gasoline and diesel fuel prices, based on an average $51/bbl crude oil price, are summarized in Table 4.4-1.  To adjust these wholesale prices, we needed to estimate how the price of crude oil will affect them.  We conducted a regression between the annual average spot price of price of Western Texas Intermediate crude oil and the annual average retail gasoline and diesel fuel prices for the years 2002 through 2006.942,943  This regression is reflected in Table 4.4-10 as Gasoline Retail Price = Crude Oil Price multiplied times 2.95 plus 65.7, or Gasoline Retail Price = Crude Oil Price x ﬁXﬂ + ﬁY.ﬂ  The slope ﬁXﬂ and intercept ﬁYﬂ for this equation are summarized in Table 4.4-10.  The X and Y GGGGGGGGGG  The possibility for this potentially large transfer payment associated with using ethanol in E85 would cause refiners to encourage the development of a cellulosic diesel fuel industry to avoid this E85 issue. 610 ":0}