{"                                                           Chapter 5: Economic Impacts and Benefits 5.1 Agricultural Impacts 5.1.1 Models Utilized As described in the Preamble, we used a suite of tools to model the potential domestic and international impacts of this rulemaking on the agricultural sector.  The Forest and Agricultural Sector Optimization Model (FASOM), developed by Professor Bruce McCarl of Texas A&M University and others, provides detailed information on domestic agricultural and greenhouse gas impacts of renewable fuels.  The Food and Agricultural Policy Research Institute (FAPRI) at Iowa State University and the University of Missouri-Columbia maintains a number of econometric models that are capable of providing detailed information on impacts on international agricultural markets from the wider use of renewable fuels in the U.S.   FASOM is a long-term economic model of the U.S. agriculture sector that maximizes total revenues for producers while meeting the demands of consumers.  Using a number of inputs, FASOM determines which crops, livestock, and processed agricultural products would be produced in the U.S. In each model simulation, crops compete for price sensitive inputs such as land and labor at the regional level. The cost of these and other inputs are used to determine the price and level of production of primary commodities (e.g., field crops, livestock, and biofuel products). FASOM also estimates prices using costs associated with the processing of primary commodities into secondary products (e.g., converting livestock to meat and dairy, crushing soybeans to soybean meal and oil).  FASOM does not capture short-term fluctuations (i.e., month-to-month, annual) in prices and production, however, as it is designed to identify long-term trends. The FASOM model also contains a forestry component.  Running both the forestry and agriculture components of the model would show the interaction between these two sectors.  However, the analysis for this proposal only shows the results from the agriculture component with no interaction from the forestry sector, as the forestry component of the model is in the process of being updated. We plan to utilize a complete version of the model for our analysis in the final rule, where agricultural land use impacts also affect forestry land use, and cellulosic ethanol produced from the forestry sector will affect cellulosic ethanol production in the agriculture sector. FASOM uses supply and demand curves for the 11 major U.S. domestic regions,LLLLLLLLLL which are calibrated to historic price and production data.  FASOM also includes detailed supply and demand data for corn, wheat, soybeans, rice and sorghum across 37 LLLLLLLLLL U.S. regions consist of the Pacific Northwest (West and East), Pacific Southwest, Rocky Mountains, Great Plains, Southwest, South Central, Corn Belt, Lake States, Southeast, and the Northeast.   642 ":1}