{"          Table 1.1-8. Quantity of Forest Biomass Available for Producing Biofuels Quantity (million dry tons) Logging Residue 41 Primary Mill Residue 2 Secondary Mill Residue 6 Forest Thinnings 18 Total 67 The Billion Ton Study authors projected that forest harvesting and mill activity will increase in the future, thus increasing the amount of forest residues that would be available for producing biofuels. The authors estimated the future forest residue supply in the year 2050 and concluded that the logging residue is expected to increase from 41 million dry tons to 64 million dry tons. Also in 2050, the primary and secondary mill residue quantity is projected to increase from a total of 8 million dry tons per year to a total of 24 million dry tons per year.  No estimate was provided for any increase, or decrease, in the amount of forest woody material that would be available from thinning forests.  If the projected 39 million dry ton increases in forest residue comes to fruition, then the total amount of forest residue that would be available for producing biofuels in 2050 would be 106 million dry tons per year.  We are primarily interested in compliance with the RFS2 biofuels standard in 2022, which is just over 1/3rd of the way between today and 2050. Thus, by interpolating the projected future forest residue in 2022 relative to current levels and those in 2050, the report supports the conclusion that 79 million dry tons of forest residue would be available in 2022 . U.S. Cellulosic Biomass Study Another estimate for the amount of forest residue that could be used to produce biofuels was made by Marie Walsh, formerly of the Oak Ridge National Laboratory (ORNL).59 The report was titled ﬁUS Cellulosic Biomass Supplies and Distributionﬂ and it is dated January of 2008. This report also uses the Forest Service data base for its estimates, so its conclusions resemble those of the Billion Ton study.  However, an important difference between this Cellulosic Biomass Study and the Billion Ton Study is that Marie Walsh estimated a cost curve for amount of biomass available for her Cellulosic Biomass study for multiple future years. In this report, Marie Walsh estimates that 63 million dry tons of logging residue is created in the lower 48 states. Of this total amount of logging residue, 65 percent is estimated to be accessible by roads, and not all the accessible logging residue is considered recoverable because some of it is too small to recover.  This study also estimates the cost for recovering this available logging residue for future years for five year intervals through 2030.  The amount of logging residue available at different price points and for different years is summarized in Table 1.1-9. 31":1}