{"                                                                          foreign regions.MMMMMMMMMM  FASOM contains transportation costs to all regions and then uses all of this information to determine U.S. exports to the point where prices are then equated in all markets. We chose to use FASOM to model the full potential impacts on the domestic agricultural sector given higher renewable fuel volumes, in part because FASOM also provides detailed greenhouse gas information resulting from these changes (see Chapter 2 of this RIA for more information).  FASOM is not able to model land use and agricultural sector changes internationally, however.  Therefore, we are working with the FAPRI models to better understand international agricultural impacts.  Additional details on the FASOM model are included in the docket.NNNNNNNNNN The FAPRI models are econometric models covering many agricultural commodities. These models capture the biological, technical, and economic relationships among key variables within a particular commodity and across commodities.  They are based on historical data analysis, current academic research, and a reliance on accepted economic, agronomic, and biological relationships in agricultural production and markets.  The international modeling system includes international grains, oilseeds, ethanol, sugar, and livestock models.  In general, for each commodity sector, the economic relationship that supply equals demand is maintained by determining a market-clearing price for the commodity.  In countries where domestic prices are not solved endogenously, these prices are modeled as a function of the world price using a price transmission equation. Since econometric models for each sector can be linked, changes in one commodity sector will impact other sectors.  Elasticity values for supply and demand responses are based on econometric analysis and on consensus estimates.  Additional details on the FAPRI models are included in the docket.  Agricultural and trade policies for each commodity in a country are included in the models to the extent that they affect the supply and demand decisions of the economic agents.  These policies include taxes on exports and imports, tariffs, tariff rate quotas, export subsidies, intervention prices, and set-aside rates.  The FAPRI models assume that existing agricultural and trade policy variables will remain unchanged in the outlook period. OOOOOOOOOO We recognize that there are inherent challenges in reconciling the results from two different models, however we believe that using two models provides a more robust analysis than either model would be able to provide alone.  Part of the difference in the model results is due to the fact that the two models have different time horizons. Since FASOM is a long term econometric model, short term spikes are smoothed out over the five year reporting period.  In comparison, the FAPRI model captures annual fluctuations that may include short-term supply MMMMMMMMMM FASOM Foreign Regions include:  the European Economic Community, North Central Europe, Southwest Europe, Eastern Europe, Adriatic, Eastern Mediterranean, Former Soviet Union, North Africa, EastAfrica, West Africa, South Africa, Red Sea, Iran, India, Taiwan, Japan, South Korea, North Korea, China, Bangladesh, Indonesia, Myanmar, Pakistan, Philippines, Thailand, Vietnam, West Asia, Southeast Asia, Australia, Caribbean, Eastern Mexico, Eastern South America, Western South America, Argentina, Brazil, Canada, Other.   NNNNNNNNNN Beach, Robert; McCarl, Bruce, Agricultural Impacts of the Energy Independence and Security Act:FASOM Results and Model Description, RTI International, October, 2008. OOOOOOOOOO Technical Report: An Analysis of EPA Biofuel Scenarios with the FAPRI International Models, CARDStaff, November, 2008. 643 ":0}