{"Table 5.1-2. Agriculture Model Assumptions Assumption Notes Feedstock Production U.S. national average corn yields are approximately 170 bu/acre in 2017 and 180 bu/acre in 2022 (a 1.6% annual increase over the baseline year) Consistent with USDA projections (http://www.ers.usda.gov/publications/oce081/) U.S. national average soybean yields are approximately 50 bu/acre in 2022 (a 0.4% annual increase) International corn yields increasing over time, for example: Argentina ~140 bu/acre in 2022 (a 0.8% annual increase) Brazil ~68 bu/acre in 2022 (a 1.1% annual increase) FAPRI Models International soybean yields increasing over time, for example: Argentina ~48 bu/acre in 2022 (a 0.7% annual increase) Brazil ~50 bu/acre in 2022 (a 1.1% annual increase) Corn residue removal rates of 50% are allowed for no till practices; 35% removal rate allowed for reduced till practices (no removal from conventional till) Derived from Graham et. al., Agronomy Journal, 99:1Œ11 (2007). ﬁCurrent and Potential U.S. Corn Stover Supplies.ﬂ  and Perlack, R. D., L. L. Wright, A. F. Turhollow, R. L. Graham, B. J. Stokes, and D. C. Erbach. 2005. Biomass as Feedstock for a Bioenergy and Bioproducts Industry: the Technical Feasibility of a Billion-ton Annual Supply. Report prepared for the U.S. Department of Energy and the U.S. Department of Agricutlure. The Conservation Reserve Program (CRP) has a minimum limit of 32 million acres enrolled in the program at any given time 2008 Farm Bill USDA baseline assumptions Fertilizer Use U.S. nitrogen application rate in corn is approximately 136 lbs/acre in the corn belt in 2022 U.S. phosphorous application rate in corn is approximately 28 lbs/acre in the corn belt in 2022 Based on ARMS data, adjusted for differences in regions and irrigation practices For U.S. assume higher yields require no increase in fertilizer use Based on USDA baseline assumptions This holds for all farming rotations (e.g., corn / soybean and corn / corn) and land types (e.g., prime and marginal land); see below for stover removal impacts Nitrogen nutrient replacement application = 7 lbs/ton corn residue removed Phosphorous nutrient replacement application = 3.6 lbs/ton corn residue removed These numbers come from the Argonne National Lab Report, Fuel Cycle Assessment of Selected Bioethanol Production Pathways in the United States. (November 7, 2006).  (Used and cited by GREET) Processing 1 bushel of corn produces 17 lbs of dried distillers grains (dry tons). 1 pound of DDG substitutes 0.9 pounds of corn and 0.1 pound of soybean meal feed www.ethanol.org USDA baseline assumptions ":1}