{" very necessary for the teacher to understand the motivation and its components as well as the factors that influence motivation. Due to the complexity of basic functions and motivations, students learning motivation can be divided into direct and indirect. Direct motivation is for the benefit of human beings, which is easy to take, but cannot last for a long time. And indirect motivation is a long-term motivation, which is generated from the social environment, which is not easy to appear and can last for a long time. As the economy develops, more and more English learners experience and good English commands can help them have a better future. This becomes the direct motivation of some students, but it is still the indirect motivation of most other students. . Therefore, this motivation cannot have obvious good results. The schools English proficiency regulations are also a direct motivation. The combination of direct motivation and indirectness forms a powerful driving force for English learners[5-6]. 2.2. Multiple Intelligence Theory The conceptualization of human intelligence and the evaluation of a new approach to describing. According to Gardners theory of multiple intelligences, each persons seven relatively independent forms of information processing capabilities, from a particular profile, they show the difference between wisdom and personal. The scope of human intelligence is the best assessment, based on content, based on smart fair instruments. Three research projects have been elaborated on more and more theories. Preliminary data from the spectrum of the project, applied in early childhood education, indicate that children aged 4 and 5 exhibit unique strengths and weaknesses. In addition, various intelligent measures are largely independent and capable of mining measurements than standard intelligence tests. 3. SITUATIONAL TEACHING EFFECT ANALY- SIS The effect can be divided into individual society. The former includes happiness, anger, sadness, happiness, etc. The latter includes patriotism and friendship. Impact can have many features. The most important of these is its social function. In society, people have different communication situations with others. Understanding your emotions and other social communications can be very rewarding. Another classification is departmental internal motivation and external motivation. The former comes from the interest of learners in a particular field. The latter comes from external influences such as bonuses or avoidance of punishment. Although external motivation can also lead learners learning, more important is internal motivation. Internal motivation can last for a long time, which is an important prerequisite for success in English learning. 3.1. Positive Effect Because of the positive impact, there can be a big impact on peoples behavior, we should try to make a positive impact on ourselves, and then enable us to complete the task in a perfect way. I believe that the interest of many successful learners leads to success. Another factor related to interest is motivation. But many people still dont know the motivation to learn. Motivation refers to a set of factors that provide motivation and guidance from learners. Early research learning motivations fall into two categories: tool-driven power and hybrids. If a learner learns the actual purpose of a foreign language, such as employment, this motivation is called tool-driven. That is to say, people learn language for the needs of future work and living. If learners learn business administration, for their own benefit and long-term acceptance of new organizational structures and associations, this is the so-called hybrid. In addition to the interest and motivation of foreign language learning, you need confidence and a strong will to overcome difficulties. For most English learners in China, English is a new language. In the early stages, its learning is very difficult for fresh learners. Therefore, learners should have enough self-confidence and strong will to overcome difficulties, which is essential, especially for fresh learners. In modern society, there are many competitions and cooperation. Developing students cooperative spirit and ability is an important task of current education. Many language learning activities require learners to work together and provide learners with more learning opportunities and resources. The awareness of the motherland and the international vision should also have a situational teaching of adolescents. Having the meaning of the motherland means that it should contribute to the development of patriotism and the motherland. International vision means that people should develop with all other human beings. 3.2. Negative Effect Another similar situational factor is restraint. The child gradually forms his own image as he grows up. In order to protect themselves, the child learns to restrain his true feelings. This is the so-called self-restraint. In language learning, learners can have many different attempts, which inevitably cause some errors. And sometimes others will laugh at these mistakes. Therefore, learners with weak influences will not be afraid of being part of the language activities that are not afraid of being laughed at by others. This is the restraint of learning the language, and it can also overcome anxiety. Can be divided into one of the introversion, the disposal of the outside person. Some researchers misconnected restraint and introverted personality. In general, introverted personality is not conducive to learning the language, while extroverts are easier and better able to learn the language. Those who are leaving can participate in language learning more actively, while introverted students tend to restrain themselves from taking part ":0}