{"one-adhesive metering system meets all the requirements for optimum use of high viscosity adhesives. In addition to the metering chamber, pistons are also used in some special applications. 3. COODING SYSTEM DESIGN  Due to the large cross-sectional area of the automobile shell, the injection mold, the fixed mold core and the cavity are designed in the form of inserts for the convenience of processing. On the one hand, it is possible to save material without using a too large steel material, and on the other hand, the cooling water channel Machining with a radial drilling machine reduces the depth of the hole. The cooling system of the movable mold and the fixed mold is designed to be designed as 3 in 3 out, that is, the mold is connected to 3 inlet pipes and 3 outlet pipes, so that the flow path of the cooling pipe is not too long, so as to control the cooling water. The temperature difference is in the range of 5 °C. The cooling system adopts a spacer, and the spacer is made of brass which does not rust, ensuring that the position of the core cavity can transport the cooling water at a higher position, and the position of the spacer mounting hole is designed to be 15 mm away from the plastic part. The distance ensures that the molten plastic can be cooled to shorten the cooling time of the plastic parts. The inlet and outlet are in the form of quick joints to facilitate the installation and disassembly of the water pipes. 4. MOLD STRUCTURE DESIGN   When designing the injection mold, it is necessary to consider the problems of the plastic processing process such as the plastic melt flow behavior, and also consider the mold structure and other problems in the mold structure, and summarize the following aspects: (1) mold type The number of cavities, according to the shape and size of the injection molded parts, cooling and demoulding, as well as the injection molding process, should be used in one cavity and two cavities. (2) In the pouring point, according to the shape of the injection molded part, the point gate feeding is required. (3) The selection of the parting surface, the plastic is solidified in the mold cavity to form the plastic part. In order to take out the plastic part, the mold cavity must be opened, that is, the mold must be divided into two parts, namely, the fixed mold and the movable mold. In part, simply, the parting surface is the contact surface of the moving mold and the fixed mold, and the mold can be separated to thereby eject the plastic part. (4) Understand the flow behavior of the plastic melt, consider the resistance of the plastic flow in the flow channel and the cavity, the flow velocity, and verify the maximum flow length. Depending on the direction of flow of the plastic in the mold (ie, the filling sequence), the problem of plastic re-melting in the mold and the original air in the crucible is considered. (5) Control the crystallization and orientation in the mold by mold design, and improve the internal stress of the part. (6) Consider the shrinkage and shrinkage of plastic during cooling. (7) Due to the small size of the plastic part, the cooling problem can be ignored. (8) The fixed template combination insert adopts a cooling tube to facilitate sealing. (9) The relationship between the size of the mold and the injection molding machine used, including the relationship between the maximum injection quantity of the injection molding machine, the clamping force, and the size of the mold part. (10) The overall structure and shape of the mold should be simple and reasonable. The mold should have appropriate precision, surface roughness, strength and rigidity, and easy to manufacture and assemble. In short, according to the above main content, it is possible to design a pair of automobile door handle arm injection molds. 5. DEMOULDING MECHANISM DESIGN  There are 9 screw mounting holes on the inner surface of the car casing, which are formed by push pipes. After the mold is opened, the mold release mechanism pushes the lateral core pulling mechanism to disengage the slider from the reverse position, and the demoulding mechanism starts to operate. The push tube and the push rod are jointly introduced, and the precision of the push tube is high, and the gap must be strictly controlled. 1 The matching of the fixed part of the push tube: the fixing of the push tube is similar to the fixing of the push rod. The outer side of the push tube and the push tube fixed plate and the support plate are matched by a large gap of 0.5 mm on one side; 2 the cooperation of the working part of the push tube: The cooperation of the push tube working part refers to the cooperation between the push tube and the core and the cooperation between the push tube and the forming template. The inner diameter of the push tube and the core are matched with H8/f7; the outer diameter of the push tube is matched with the hole on the template, and the fit of H8/f8 is adopted. In order to ensure that the push tube does not scratch the core and the corresponding forming surface when pushing out, the outer diameter of the push tube should be about 0.5mm smaller than the outer wall size of the plastic part: the inner diameter of the push tube should be 0.2-0.5 larger than the inner diameter of the plastic part. Mm. Using the finite element software to realize the simulation of the instrument panel film forming, and then obtaining the better processing data through the global optimization method; sampling with the experimental design method, and establishing the approximate model according to this, the evaluation analysis establishes the best approximate model. , to prepare for global optimization. 6. LATERAL CORE PULLING MECHANISM DESIGN  In the lateral side core pulling mechanism, the mating surface for the bottom of the slider and the matching surface of the sliding surface of the slider and the ":0}