{"Recommended Best Practice: Defense in Depth All connections to the Control System LAN should be routed through the firewall, with no connections circumventing it. Network administrators need to keep an accurate network diagramof their control system LAN and its connections to other protected subnets, DMZs, the corporate network, and the outside. Multiple DMZs have proved to be very effective in protecting large architectures comprised ofnetworks with different operational mandates. A perfect example, illustrated in Figure 7, is theconjoined networks for control systems and business. In this example, the secure flow of data into and out of the different environments is critical to operations. Having multiple DMZsprotects the information resources from attacks using Virtual-LAN (VLAN) hopping and trust exploitation, and is a very good way to enhance the security posture and add another layer to the defense-in-depth strategy. Intrusion Detection SystemsWhen considering the most logical route an attacker will take in compromising a control network, it is easy to visualize an attack path that pries deeper and deeper into the architecture.Starting from the external environment, an attacker will move past perimeter devices and ultimately strive for access to both the network andhosts on that network. Bear in mind that this access may be via field devices where remote access requirements can introduce vulnerabilitiesinto control system architectures.  Once on the target network, the attacker must begin to collect intelligence through reconnaissance, followed by attempts at compromising more and more components. In each of these cases, unusual and unauthorized activity would be present in the network, and this activity can be monitored (and acted upon) to provide another level of defense. There are several common methods for monitoring a network for unusual or unauthorized activity, with one of the most effective being Intrusion Detection Systems(IDS). It is important to keep in mind that intrusion detection is not a single product or technology. It is a comprehensive set of tools providing network monitoring that can give an administrator a complete picture of how the network is being used. Implementing a variety of these tools helps to create a defense-in-depth architecture that can be more effective in identifying attackeractivities.An intrusion detection system, by its very nature, is passive. In a network deployment, the function of the IDS is to watch and assess the traffic or network activity without impacting that traffic. Having collected data, IDS compares it against a pre-defined rule set, as well as against a set of known attack ‘signatures’. The IDS will investigate port numbers and data payload to determine if any nefarious activity is occurring. Having recognized an attack pattern, or any deviation from what has been defined as normal/allowable traffic, the systems will carry out a set of instructions that can include alerting a systems administrator. Extensive logging is also a function of most IDSs available today. 21":0}