{" 2 This is also the time when many well-known clothing brands are considering the design of sweaters. They should not only consider the solid color and color matching design, but also consider the combination of sweaters as a single item and other clothing colors. 3.2 Modeling Design The styling design refers to the outer shape design of the garment, which is one of the important design elements that visually express the design style of the sweater and reflect the popularity of the sweater design. The outer contour of the sweater generally has the basic shapes of H-type, A-type, V-type, X-type, O-type, etc. Among them, the H-shape is rectangular, and the shoulder width, chest circumference, waist circumference and hip circumference are basically the same, which makes people loose and comfortable. Feeling, the general design is more suitable for long or medium-length models; A-type is small and large, exaggerated hem, casual and playful, is a combination of loose and fit; V-type is usually used to decorate or exaggerate the shoulder, generally Most of the short paragraphs, it will look slender, straight and capable when worn; X-type is the common shape of the fitted sweater, the waist effect is remarkable, reflecting the curves of womens sexy; O-shaped appearance is round, the waist is loose, sometimes it can hide the lack of body Where [3]. The three brands sampled showed great differences in their design because of their different target market positioning. The volume curl brand is basically a type H and a V-shaped slightly hem. The Impression Grassland brand is mainly the H-type and the waist-type X-type, while the original elemental clothing style is more varied, there are H-shaped, waist-shaped X-shaped, A-shaped with a large hem, and a loose O-shaped waist. The sweater design is not only the basic design, but also the detail design. The partial details include the collar design, the sill design, the hem design and the cuffs. Because the overall style is simple, the Impression Grassland will be biased towards the waist, collar, cuffs and hem. The details of the styles are ingenious, and the original elements are mainly thresholds in detail design. A variety of designs, a variety of process performance, make the overall style changeable. In general, the Impression Grassland style design is elegant and simple, the volume curl is the college style, and the original element clothing design is fashionable and changeable style. 3.3 Pattern Design The pattern design of the sweater can be divided into a pattern distributed on the whole body of the sweater, a partial position of the pattern in the sweater and a non-patterned sweater according to the distribution of the pattern on the knitted sweater [4]. Compared with pure color sweaters, the use of patterns will increase the diversity and variability of colors; it will enhance the style of design, increase the layering, rhythm, regularity and disorder of the design. The design and design of the Dalang sweater pattern is varied. The Impression Grassland design is inspired by the representative European Impressionist masters. Some patterns will select a part of the Impressionist painter. Most of the sweaters are used without Patterned sweaters or partial patterns, and partial patterns occupy a small proportion of the body on most sweaters; original element sweaters occupy a larger proportion of the body in the use of the pattern, the pattern is mainly flowers And stripes; the rolled curl sweaters are basically partial patterns, the main patterns are stripes and diamonds. In the process of sweater pattern, the three brands use embroidery, jacquard and printing. The cost of jacquard is higher in the three processes, and the printing is completely independent of color diversity, pattern complexity and application size. The restrictions, low cost, and varied according to the markets popularity, so the original element sweaters are mostly printed, according to the fashion changes of each season, the sweater body pattern or partial pattern. Affecting the design of the sweater pattern is not only the innovative pattern design, but also the color of the pattern, the position of the pattern, the area of the pattern and the proportion of the overall body, etc., all have an effect on the pattern effect of the sweater. 4. SUMMARY  Through the field investigation of Dalang sweater products and the analysis of online data collection, it is found that Dalang sweater design is biased towards fashion variability as a whole, but there are mainly the following differences between the well-known sweater brands in China: 4.1 Online and Offline Sales of Products are Difficult to Coordinate, and Online Sales and Services Still Need to be Worked Hard. The well-known sweater brands in the country have online flagship stores. Consumers can choose clothes online and enjoy services that are not restricted by time and place. Offline, there are physical stores in many major cities, and consumers can go to physical stores. Clothing, replacement; and Dalang sweater brand network flagship store is less, many sweater products also use other well-known websites to simply promote and provide basic information stage, which means that many Dalang sweater brands can not be on the network platform Face the final consumer, stay in the stage of joining, acting or looking for a middleman. Among the three brands sampled, only volumes have flagship stores on the Internet, selling products directly to consumers. 4.2 Sweater Product Design Needs to be Improved The products of well-known brands from the design concept, style design, color design, pattern design and even the type of clothing and apparel products will present certain and different artistic styles with other brand products. I have put this art style for a long time. ":0}