{"2  Engineering Measurement, the determination of teaching content, and the production of multimedia courseware. Participate in the training of related courses such as MOOC and SPOC courses, and improve the multimedia and information teaching level of teachers[5-7]. 3.2. Content Reform On the basis of preliminary research, standard learning and case collection, the syllabus for -established. The project team members re-enacted the course syllabus and experimental syllabus for the measurement courses such as Surveying and Traffic Engineering Surveying. In the revision process of the  (1) Revision of the syllabus. The newly revised syllabus is closely integrated with the graduation requirements index points and their weights, which increases the description of the supporting experimental projects and key difficulties, and increases the description of the evaluation methods. The teaching objectives are clear, the teaching content is more reasonable, and the teaching requirements are met. And the performance evaluation is specific and operability is strong. (2) Reform of teaching content. Compared with the 2012 version of the outline, the second part is revised precision wire measurement, global positioning system measurement, the principle of triangular Positioning System Measuand this content It is also an important technical guarantee for the current high-speed railway engineering measurement. The third part adjusts the original teaching focus, and the teaching content  of least squares method, understand the necessary observations, the meaning of redundant observations, and master the indirect adjustment method. Can use the indirect adjustment method to solve the problem of  focus became the main means of measuring data adjustment.  main work of line measurement, understand the main methods and technical requirements of plane control measurement, elevation control measurement, understand the purpose and significance of control network maintenance measurement. Understand the role of the mitigation curve. Master the line geometry expression The method has the basic ability to calculate relevant data and the application of the total station coordinate method line mid-line surveying ability; master the basic structure of the subgrade, and has the ability to test the subgrade side pile; master the vertical and horizontal section expression method, with vertical and horizontal section mapping the original syllabus are merged into a line measurement, and the latest high-speed railway plane control measurement and elevation control measurement content are introduced. The original content is mainly based on ordinary and traditional railways. It is out of step with the actual engineering site measurement technology; the fifth part and the sixth part have no major changes in the teaching content, but put forward new requirements for the teaching objectives, which prompted us to make new adjustments in teaching resources. In summary, the entire outline changed from the original 7 parts to the new 6 parts. At the same time, the inter-class experiment was adjusted from the original 8 hours to 4 hours, and the adjustment was completed during the oRailway Publishing House). (3) Update teaching resources. After the revision of the syllabus was completed, the project team members actively developed and improved the teaching resources in line with the new syllabus according to the new teaching content. Publish and use the new course materials, which update the original measurement specifications, new instruments and new technologies in practical projects, and solve the original textbook specifications, instruments, Old technology problems. The content of the online courses was updated to improve the utilization rate of related online courses. Re-instructional design, lesson plans, lectures, and added new measurement techniques, such as global satellite positioning measurement technology, aerial photography and remote sensing, measuring robots, etc. during the teaching process; Large-scale tunnel independent control network is established to content that is difficult to complete in campus internship, such as high-speed railway track control network measurement process, to show the measurement process to students in the form of video, animation, etc., so that Students are easier to understand. 3.3. Teaching Achievement Through the study of the reform of teaching content, the syllabus of relevant majors and related courses has been revised and revised. Re-created the multimedia courseware, instructional design, and lesson plans for the relevant courses, and published the teaching reform papers. Use a new textbook. At the same time, ":0}