{"Recommended Best Practice: Defense in Depth KeywordsDefense in depth, industrial control system, SCADA, PCS, cyber security, mitigation, firewall, IDS, intrusion detection, encryption, DMZ IntroductionInformation infrastructures across many public and private domains share several common attributes regarding IT deployments and data communications. This is particularly true in the control systems domain. A majority of the systems use robust architectures to enhance business and reduce costs by increasing the integration of external, business, and control system networks. However, multi-network integration strategies often lead to vulnerabilities that greatly reduce thesecurity of an organization, and can expose mission-critical control systems to cyber threats.This document provides guidance and direction for developing ‘defense-in-depth’ strategies for organizations that use control system networks while maintaining a multi-tier informationarchitecture that requires:Maintenance of various field devices, telemetry collection, and/or industrial-level process systemsAccess to facilities via remote data link or modemPublic facing services for customer or corporate operationsA robust business environment that requires connections among the control systemdomain, the external Internet,and other peer organizations. BackgroundThe critical infrastructure systems that support major industries, such as manufacturing, transportation, and energy, are highly dependent on information systems for their command and control. While there is still a high dependence on legacy control systems, critical infrastructure/key resource (CI/KR) systems are migrating to new communication technologies. As a result, the diverse and disparate proprietary mechanics of control systems are being replaced with common communications protocols and open architecture standards, which can have both positive and negative impacts.On one hand, the migration empowers control system users and manufacturers to offer new and more efficient methods of communication, as well as more robust data, quicker time to market,and interoperability. On the other hand, empowering control system users introduces new risks. Cyber-related vulnerabilities and risks are beingcreated that could not exist when the CI/KR information infrastructures that involve control systems were isolated. The interdependence of CI/KR systems, such as in the power sector, has been illustrated in a number of instances, including the 2003 North American blackout. 3":0}