{"B.A. Aliyu and et. al.85 At three different temperatures in terms of the ERAS model studied to measurement of thermophyiscal properties of two liquid mixtures systems n-alkyl amine, di-n-alkyamine, and tri-n-alkyl amine with a series of 1-alkanols. The model parameter resulting forms strong negative values showing that the hydrogen bonding energy cause unlike molecules Interaction between in mixture and  due to presence of hydrogen bonding, the esters are important class of chemical compounds, which involves p-electrons in carbonyl groups. There used weak dipole- dipole interaction among the ester molecules.  Pal. A. And Kumar. S.86 measured the viscosities and densities of water urea solutions of 5 to 25 percent with L- glycine, L-alanine and L-valine in composition from the viscosity data have been calculated by equation. B-coefficients show the positive, values for all amino acids in aqueous urea indicates that the ion-solvent interactions are strong. Liew. K.Y., Sen C. E. and et.al.88 worked on viscosities as the physicals property of normal chain alcohols from 15 to 800C. Plot of the logarithm of viscosity versus reciprocal absolute temperature were almost linear. The energies of activation were found to increase with Chain length. The viscosities and densities were measured throughout composition range at 35 and 400C of propan-1-ol + butan-1-ol, propan-1-ol to undecan-1-ol and at atmospheric pressure. McAllister equation used to were correlated viscosity data by with an average absolute error.  Iabal and et.al.89 worked on partial molar excess volume of drugs in aqueous and ethyl alcohol solvents. The molar volume data of the drug studied showed solution behavior consistent with the general rules governing the behavior of electrolytic, non-polar and amphiphilic nature of solutes in water. The calculated data of ionic compressibility™s showed that correlation exists between compressibility™s size of ion, and structural complexity. The difference in volume is due to hydrophobicity of solutes. The hydrophobicity of these compounds used to study of drug action.  Attwood and et.al.90 studied the different physicals properties of phenothiazine and chlorpromazine drugs in water at different temperature.  As the temperature increase there is nearly increase in molar volume and compressibility of chlorpromazine in micellar form. This work was very useful to known about role of biomoleclues in thermodynamic behavior of ":0}