{"V. Kannappan and S. X. JesuRaya.60 at 298 K temperature studied density viscosity and ultrasonic velocities in the chloroform and n-hexane solution of 2-butanone, acetophenone and benzaldehyde the concentration range of 0.5-1 M. stronger interaction observed in chloroform solutions due to change in these properties indicates solute-solvent interaction in all mixtures and. Acoustical parameters show that through intermolecular hydrogen bond. Carbonyl compound are strongly attracted by chloroform molecules these value such as linear free length, relaxation time, adiabatic compressibility, absorption coefficient and solution number values are calculated.  R. Vens and R. Raykumar.61 at 308.15 K and 318.15 K temperature studied viscosities and densities of three liquid mixture of anisole +cyclohexane +1-hexanol throughout composition from measured experimental data excess properties are calculated as well as excess parameters. positive Excess molar volume over throughout of composition attributed physical interaction which result of breaking of liquid-liquid chain and addition of other liquid molecules  and presence of non-chemical attraction between different molecules the deviation in  viscosity value is negative predict of liquid mixture easiely flow of as compared with pure mixture. As temperature increase causes to breaking pure component chain which result excess value decrease that and increasing the nature of interaction. M. Almasi and H. Iloukhani.62 at 298.15 K temperature studied refractive indices, density and viscosities of two liquid mixtures of acetophenone with n-alcohols namely n-propanol, 2-butanol throughout composition, experimentally measured density, viscosity and refractive indices are used to calculate excess properties molar excess volume, refractive index deviation and correlated by different equation to found the standard error. The positive value result that physical interaction are developed and negative value result that the chemical interactions are developed. N. N. Wankhede, D. J wankhede and et.al.63 at different temperatures worked one density and viscosity of two liquid mixtures2, 4,6-trimethyl 1,3,5-trioxane with methyl acetate, ethyl acetate and 1-butly acetate were measured throughout  composition from measured experimental data. Excess parameters like viscosity deviation, molar excess volume calculated and fitted to formula of Redlich and kister. In present study increase in temperature the molar excess volume is increase which found to be positive. The molar excess volume at isotonic solutions follows the different order. ":0}