{" Ilia Anisa A. N. and Ahurahaman H. Nour.67 worked on Thus in coating industry knowledge of the viscosity and refractive index is considerable importance for manufacturing process, Stability and rate of cure of paint film.  Dand. D. and Gung J. 72 studied on viscosity and refractive index of cured oil is the Viscosity is find of internal resistance to flow it is one of the most important properties of fluids, The crucial part to investigate. Most of studies were based on viscosity effect on droplet size distribution and refractive index of oil in water emulsion. it is useful  in the petroleum industry.  L. Che, and S. Thompson.73 the estimated precision in the liquid density determination was 0.05% Densities and refractive indices of proan-1-ol, propan-2-ol and methanol with water were measured at 20 and 25 0C.  The plotting curve of composition of density is observed decreasing constantly with increase in weight percent of alcohol.        M. Krolikowska and et. al. 74 Studied different physicals properties of two liquid mixtures of toluene with ethyl acrylate methyl methaacrylate, butyl acrylate and styrene for throughout composition range and from experimental data are help to explain excess thermodynamic properties. Like excess viscosity, excess volume and excess viscous flow for activation of Gibbs free energy were calculated and substituted to substitute to different equation to estimate the experimental and computed values between standard deviation and binary coefficients.            The value of deviation in viscosity of above two liquid mixtures of toluene with methaacrylate is negative. The negative value attributed to presence of dispersive interaction of electron donor accepter type while positive value attraction between two liquid mixtures. above two liquid mixtures of toluene  The  molar excess volume are negative for  mixtures,  The negative value suggests specific interaction while positive value suggests dominance of dispersion force between two liquid mixtures of unlike molecules.            Herskovits T.T. and Kelly T. T.75 worked on the relative viscosity and the viscosity B and C coefficients of alcohols, urea and amide solutions. The most significant finding of their study was the viscosity increments of most of those solutes were in the ranges predicted by the Einstein and Sigma equation for rigid spherical or ellipsoidal particles. Viscosities for solutions of amino acids in water solution urea have been determined from 5 to 350C at 100C intervals. ":0}