{"The positive value indicates dispersion force or weak dipole-dipole interaction in present study viscosity deviation is negative The decrease in value at isotonic solution follows order 1-butylacetate>ethyl acetate > methyl acetate. The negative deviation indicates that dipolar forces are operating.            B.P.Lveit and et. al.64 Worked on thermodynamic properties varies liquid mixture from experimental data, Excess parameters like molar excess volume, viscosity deviation was calculated. In terms of liquid theory worked towards reformulation of average rules for van der waals mixtures and calculated values are found in much better agreement with the experiment from their approach even when one fluid-theory is applied. they attempted first to evaluate the thermodynamic functions for a mixture of solution in terms of intermolecular energy parameter developed a fluid versions of the cell model, they gave a new approach with his theory of the attractive part of intermolecular potential is treated as perturbation on hard sphere potential.  A more successful approach is due to Flory who also makes use of certain features of cell theory and assumes an empirical equation for the dependence of energy on volume.            V.K. Rattan and et. al.65 Studied the density, viscosity, of two liquid mixtures of pure liquids with non-polar liquids from experimental data, Excess parameters like  molar excess volume, viscosity deviation were calculated.  The variation in molar excess volumes, excess viscosity were discussed in terms of liquid theory however use of adjustable parameters makes it applicable to components whose molecules interact in a specific manner. This is the only theory that can be applied to mixtures of realistic interest in which the component molecules may differ considerably in size and shape. They developed a statistical mechanical theory of two liquid mixtures from the equation of state, properties of pure liquids along with adjustable parameters.               J. Woolf and et.al.69 Worked on thermodynamic properties varies liquid mixture from experimental data, Excess parameters like molar excess volume, viscosity deviation were calculated. In terms of liquid theory worked towards. they attempted first to evaluate the thermodynamic functions for a mixture of solution in terms of intermolecular energy parameter developed a fluid versions of the cell model they combined both Prigogine and Flory theories and presented a general, unified theory from which one is able to identify various contributions. in the excess thermodynamic quantities.    ":0}