{"190the UN Special Rapporteur on Human Rights and Extreme Poverty, parliamentarians should ensure that the following key elements are stipulated in legislation and implemented through relevant strategies, policies and programmes:Ł Adopt rigorous labour regulations and ensure their enforcement through a labour inspectorate with adequate capacity and resources to guarantee enjoyment of the right to decent working conditions:Ł have access to an adequate standard of living.Ł Extend legal standards regarding just and favourable conditions of work to the informal economy, and collect disaggregated data assessing the dimensions of informal work.Ł Take positive measures to ensure the elimination of all forms of forced and bonded labour and harmful and hazardous forms of child labour, in addition to measures that ensure the social and economic reintegration of those affected and avoid reoccurrence:Ł Ensure that caregivers are adequately protected and supported by social programmes and services, including access to affordable childcare.Ł formal labour market, including through vocational guidance and training and skills development.Ł Eliminate discrimination in access to employment and training, and ensure that training programmes are accessible to those most vulnerable to unemployment, including women, migrants and persons with disabilities, and tailored to their needs.Ł Respect, promote and realize freedom of association so that all workers are effectively represented in social and political dialogue about labour reforms.Box 84 Labour rights before the Inter-American Court of Human Rights (Baena, Ricardo et al. (270 workers) v. Panama)In February 2001, the Inter-American Court of Human Rights ruled on an leaders. The persons concerned organized a demonstration after the government had rejected a petition concerning labour rights and announced a strike the escaped from a prison and occupied the National Police headquarters for several hours. The trade union cancelled the strike. The Government insisted that there had been a connection between the two events and dismissed the persons by means of a simple letter, invoking a law that was adopted after the facts, and which replaced the applicable procedure before labour courts with an administrative one. The Court concluded that the State of Panama had violated the rights of the workers to freedom of association, judicial guarantees and judicial protection, as well as the principles of legality and non-retroactivity. The Court ruled further that the due process guarantees set forth in Article 8 (2) ":0}