{"J. Phys.: Condens. Matter 2 (1990) 1369-1412. Printed in the UK REVIEW ARTICLE The application of the specular reflection of neutrons to the study of surfaces and interfaces J Penfoldt and R K Thomas$ t Neutron Science Division, Rutherford Appleton Laboratory, Chilton, Oxfordshire, UK $ Physical Chemistry Laboratory, Oxford University, South Parks Road, Oxford, UK Received 26 June 1989 Abstract. The application of the specular reflection of neutrons to the study of surface and interfaces is described. The theoretical and experimental background to the technique is presented. A range of recent experimental results in surface chemistry, solid films and surface magnetism is discussed. In surface chemistry the results include adsorption of surfactants at the air-solution interface, insoluble monolayers and polymers at the air-liquid interface, soap films and adsorption at the liquid-solid and liquid-liquid interfaces. In solid films results on Langmuir-Blodgett films, hard carbon films, polymer films and some semiconductor layers are discussed. In surface magnetism experimental data which illustrate the nature of magnetism in magnetic multilayers and ferromagnetic films, and which describe flux penetration in superconductors. are presented. 1. Introduction A range of phenomena analogous to those observed in classical optics are exhibited by slow neutrons; these include reflection, refraction and interference: see for example Klein and Werner [l]. Total reflection of slow neutrons was first reported by Fermi and co-workers [2,3], and has since been extensively applied to a range of problems. Early applications of these phenomena have included the determination of scattering lengths [4], the production of neutron guides [5] and neutron spin polarisers [6-91. The specular reflection of neutrons gives information on the neutron refractive index profile normal to an interface. The refractive index is simply related to the scattering length density and hence specular neutron reflection can provide important information about the composition of surfaces and interfaces. Similar information can be obtained using, for example, x-ray reflection. However there are many instances where the neutron method provides a distinct advantage. In contrast to x-rays, neutron scattering amplitudes vary randomly from element to element, and isotopic substitution can be used to produce large contrasts in the scattering density. Of particular importance is the large difference in scattering powers of hydrogen and deuterium; this has already been used to great effect in small-angle neutron scattering and will be seen to be of particular importance in surface chemistry. Due to the magnetic interaction, magnetic materials have a neutron spin-dependent refractive index, and the specular reflection of spin polarised neutrons is a sensitive probe of surface magnetism [lo]. Since some of the early experiments [ 11-12] and applications [4-9] , it is only relatively recently that any concerted effort has been made to apply the technique to the wider 0953-8984/90/061369 + 44 $03.50 @ 1990 IOP Publishing Ltd 1369 ":0}