{"Application of the specular reflection of neutrons 1373 however, the surface is not entirely smooth its local roughness will modify the specular reflectivity in a manner similar to that of a diffuse interface (in terms of specular reflectivity the two are indistinguishable). The reflected intensity will be modified by a Debye-Waller-like factor of the form I(A) = Io@) exp(-4041(a)*) (2.14) where Z(A) and Zo(A) are the reflected intensity with and without surface roughness, (a) is the root mean square roughness, and qo = 2k sin Bo, q1 = 2k sin 8,. Equation (14) is applicable to a bulk interface and has been derived by Nevot and Croce [31] on the basis of a gaussian distributed height-height correlation function at the interface. Figure 3 illustrates the application of Fresnel's law with a gaussian roughness factor to the reflectivity profile of a All0 optical flat: the full curve is a least-squares fit for an interfacial roughness of 32 A. 20 25 30 3.5 4.0 45 5.0 55 60 Wavelengtn (AI Figure 3. Reflectivity versus wavelength (for angle of incidence H = 0.3\") for a A/lO optical flat: X, data points; -, a least-squares fit with scattering length density of the glass, Nb = 0.36 X kZ, surface roughness = 32 A and A0 = 4.6%. Cowley and Ryan [32] have extended this treatment of interfacial roughness to thin films in a consideration of the effects of roughened or diffuse interfaces on the specular reflection of x-rays from oxide layers in silicon. They have applied a gaussian roughness factor to each interface by modifying the Fresnel coefficients of equations (2.10,2.11) such that (2.15) It has been shown [33] that this treatment of surface imperfection is equivalent to the matrix method (see equations (2.12), (2.13)) but with the interface divided into discrete layers with a gaussian distribution of density. It has the advantage, however, of being numerically much less unwieldly. It is therefore preferable to use an alternative multi- layer method to calculate reflectivity profiles, which will overcome this problem. One ":0}