{"REPORT DOCUMENTATION PAGE Form Approved OMB No. 0704-0188 The public reporting burden for this collection of information is estimated to average 1 hour per response, including the time for reviewing instructions, searching existingdata sources, gathering and maintaining the data needed, and completing and reviewing the collection of information. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden, to Department of Defense, Washington Headquarters Services, Directorate for Information Operations and Reports (0704-0188), 1215 Jefferson Davis Highway, Suite 1204, Arlington, VA 22202-4302. Respondents should be aware that notwithstanding any other provision of law, no person shall be subject to any penalty for failing to comply with a collection of information if it does not display a currently valid OMB control number. PLEASE DO NOT RETURN YOUR FORM TO THE ABOVE ADDRESS. 1. REPORT DATE (DD-MM-YYYY) 2. REPORT TYPE 3. DATES COVERED (From - To) 4. TITLE AND SUBTITLE 5a. CONTRACT NUMBER 5b. GRANT NUMBER 5c. PROGRAM ELEMENT NUMBER 6. AUTHOR(S) 5d. PROJECT NUMBER 5e. TASK NUMBER 5f. WORK UNIT NUMBER 7. PERFORMING ORGANIZATION NAME(S) AND ADDRESS(ES) 8. PERFORMING ORGANIZATION REPORT NUMBER 9. SPONSORING/MONITORING AGENCY NAME(S) AND ADDRESS(ES) 10. SPONSORING/MONITOR'S ACRONYM(S) 11. SPONSORING/MONITORINGREPORT NUMBER 12. DISTRIBUTION/AVAILABILITY STATEMENT 13. SUPPLEMENTARY NOTES 14. ABSTRACT Vectran HS appears from literature and testing to date to be an ideal upgrade from Kevlar braided cords for many long-term, static-loading applications such as tie-downs on solar arrays. Vectran is a liquid crystalline polymer and exhibits excellent tensile properties. The material has been touted as a zero creep product. Testing discussed in this report does not support this state-ment, though the creep is on the order of four times slower than with similar Kevlar 49 products. Previous work with Kevlar and new analysis of Vectran testing has led to a simple predictive model for Vectran at ambient conditions. The mean coefficient of thermal expansion (negative in this case) is similar to Kevlar 49, but is not linear. A positive transition in the curve occurs near 100 ¼C. Out-gassing tests show that the material performs well within parameters for most space flight applications. Vectran also offers increased abrasion resistance, minimal moisture regain, and similar UV degradation. The effects of material construction appear to have a dramatic effect in stress relaxation for braided Vectran. To achieve the improved relaxation rate, upgrades must also examine alternate construction or preconditioning methods. This report recommends Vectran HS as a greatly improved replacement material for 15. SUBJECT TERMS 16. SECURITY CLASSIFICATION OF: 17. LIMITATION OF ABSTRACT 18. NUMBER OF PAGES 19b. NAME OF RESPONSIBLE PERSON a. REPORT b. ABSTRACT c. THIS PAGE 19b. TELEPHONE NUMBER (Include area code) Standard Form 298 (Rev. 8-98)Prescribed by ANSI Std. Z39-18 Vectran, Kevlar,time-dependent behavior, Goddard Space Flight Center (GSFC), Coefficient of   Thermal Expansion (CTE), creep, Boltzman superposition principle, stress relaxation 15Marjorie F. Sovinski":0}