{"9was performed on both a single strand fromthe!braid and on the braid as a whole. Testing ofa single strand was preferred, as the 12 strandsin the braid increases the amount of twist in thefiber and may alter the measured CTE. Theeffect that the braiding has on the CTE isreflected in the data. Two runs were performedon the TMA 2940 using a single strand ofVectran, and one run was done using the 12-strand braid.The measured CTE for the Vectran fiber iscomparable to the CTE values reported by theindependent company; however, the expansioncurves from both the TMA 2940 and theindependent company show a small transition atapproximately 100!¡C. For the TMA 2940measurements, the CTE was calculated from theexpansion curve over the range of Ð125!¡C to0!¡C, and was limited by the presence of thetransition in the curve. Conversely, the CTEcalculated by the independent company includedthe portion of the expansion curve with thetransition by taking the linear regression of thecurve. Given that the CTE is often provided as alinear value, the CTE for the Vectran would bemore useful if it were provided over atemperature range that excluded the transition inthe curve, rather than calculating the CTE usinglinear regression.Several different test configurations were usedto determine the cause of the transition. Inaddition to testing the Vectran over the Ð150!¡Cto 150!¡C range, several samples were alsotested from room temperature to 150!¡C, and asample was also run using a weight to providemore tension in the sample. Finally, a sample ofthe 12-strand Vectran braid was tested over thefull Ð150!¡C to 150!¡C temperature range. Asmentioned previously, because the braid consistsof 12 strands, the fibers within the braid aretwisted and are therefore not oriented in a lineardirection. It was therefore expected that testingthe Vectran in this configuration would providea higher CTE. Analysis of the braid of Vectranfound that the CTE for the braid wasÐ12.5µm/m-!¡C, almost triple the reported CTEvalue. Figure 8 provides a comparison of thedifference in CTE found by testing the entirebraided cord as opposed to a single strand.Figure 8. CTE Plot of Vectran HS.Conclusions and Recommendations1. Vectran HS type 97 appears from literatureand testing to date to be an ideal upgradefrom Kevlar Braided Cords for many long-term, static-loading applications such as tie-downs on solar arrays.2. Key improvements in performance includecreep/relaxation, moisture regain, abrasionresistance, and strength properties.3. Vectran is NOT a zero creep material. Thisassumption was uncontested and repeated inavailable literature, based on a stressrelaxation test. The material experiencedlogarithmic creep and stress relaxation.4. Vectran creeps at a rate four times slowerthan Kevlar.5. A mean CTE of -5.78µm/m-!¡C  was  foundover  a  range of !-125!¡C to 0!¡C.6. Vectran braided cord must be pre-loaded toremove the effects of fiber weave and laybefore a reliable creep or stress relaxationrate can be expected. -60 -40 -20 0 20 (!m) -150 -100 -50 0 50 100 150 Temperature (¡C) Vectran Braid Vectran Strand ":0}