{"7CTE TestingEach sample was heated from Ð150!¡C to150!¡C, and a mean CTE of -5.78µm/m-!¡C wasfound over a range of 125!¡C to 0!¡C. A CTE of-4.8 µm /m-!¡C from 20 to 145¡!C was reportedby Celanese, the manufacturer of the Vectranfiber. Additional CTE data provided by anindependent company lists a CTE of -4.89µm/m-!¡C from 150 to Ð160!¡C.Out-gas TestingStandard out-gassing tests were also performedat NASA and the pertinent results are includedin Table 8. The results show that the materialperforms well within the typical limits to qualifyit for space flight. IR Spectroscopy showed thecords tested were coated with optional siliconoil, which can be declined for space flight.Table 8. Out-gassing report.Micro VCM Out-gassing TestPer ASTM E-595-93, Three runsVectran HS Type 97 1500 denier 12 std Braidtested as receivedAverage Total Mass Lost0.06%Average WVR @ 50% RH0.01%Average CVCM0.01%Test by Dewey Dove and Debbie Thomas,NASA GSFC 1 June 2004.DiscussionA variety of differently constructed ropeproducts are compared throughout this report. Aprimary assumption of this report is that theeffects of material construction (yarn twist,weave, braid, and wire rope packing) areeliminated during initial tensioning and thematerial will subsequently perform similarly to asingle fiber. For Creep testing, this break-inperiod (also known as pre-conditioning) isaccomplished during the initial period ofconstant loading in the test. For stress relaxation,the first loading curve and relaxation constantcan be assumed to be dominated by constructionartifacts as well.The validity of this assumption is borne out bytesting of Kevlar braided cords during 2003!Ð!!2004 at NASA GSFC where the relaxationconstants generated during testing of 12 strandbraided Kevlar included fiber results in theirmargin of error. It is also supported by a ropecreep study.9Temperature fluctuations in tests at ambient labconditions caused disruptions in both creep andstress relaxation curves. These were minor, andare not assumed to have impacted the results.Creep TestingThe most instructive information on theresponse of Vectran came from creep testing.Although for most applications at NASA, stressrelaxation is the more pertinent test, creeptesting allows quicker and more controlledresults that can cover a wider range of variables.Also, under certain simplifications, theBoltzmann superposition principle can be usedto directly relate creep to stress relaxation.In creep testing, there was a distinct inflectionpoint observed on many of the test curves ofdisplacement vs. Log (t). The visually distinctinflections generally occurred between 0.5 and 4hours. Previous testing implies that this mayrepresent the end of a period when fiber lays arealigned and straightened. A graphic depiction ofone creep curve with a distinct inflection isrepresented below.Figure 7. Depiction of Creep Curve with Inflection  to Steady State Creep.":0}