{
    "address": "\nDepartment of Physics, Jadwin Hall, Princeton University,\n\tPrinceton, NJ 08544\n}\n\\date{January 2000}\n\n\\maketitle\n\\begin{abstract}\nWe investigate an analytic model to compute nonlinear power spectrum \nof dark matter, galaxies and their cross-correlation. The model \nis based on Press-Schechter halos, which cluster and have \nrealistic dark matter profiles. \nThe total power spectrum is a sum of two contributions, one from \ncorrelations betwen the halos and one from correlations within the same\nhalo. We show that such a model \ncan give dark matter power spectra which match well with the results of \nN-body simulations, provided that concentration parameter decreases \nwith the halo mass. \n\nGalaxy power spectrum differs from dark matter power spectrum \nbecause pair weighted number of galaxies does not scale with the halo\nmass and because most halos harbor \na central galaxy. If the pair weighted\nnumber of galaxies increases less rapidly than the halo mass, \nas predicted \nby theoretical models and observed in clusters, then the resulting power \nspectrum becomes a power law with the slope closed to the observed \nover several orders of magnitude in scale. Such a model also predicts\nlater onset of nonlinear clustering compared to the dark matter, \nwhich is needed to reconcile the CDM models\nwith the data. Generic prediction of\nthis model is that bias is scale dependent and nonmonotonic.  \nThis is particularly important for red or elliptical galaxies, which\nare preferentially found in larger mass halos and for which bias in \npower spectrum may be scale dependent even on large scales.\n\nOur predictions for galaxy-dark matter correlations, which can be \nobserved through the galaxy-galaxy lensing, show that these cannot be \ninterpreted simply as an average halo profile of a typical galaxy,\nbecause different halo masses dominate at different scales and \nbecause larger halos host more than one galaxy. We \ncompute predictions for the cross-correlation coefficient \nas a function of scale and discuss the prospects of using \ncross-correlations in combination with galaxy clustering to \ndetermine the dark matter power spectrum.\n\n\\end{abstract}\n%\\pacs{PACS numbers: 98.80.Es,95.85.Nv,98.35.Ce,98.70.Vc\t \\hfill}\n%]\n\\newcommand{\\tl}{\\tilde}\n\\newcommand{\\bm}{\\boldmath}\n\\newcommand{\\cut}{\\rm cut}\n\\newcommand{\\mnras}{Mon. Not. Roy. Astron. Soc.}\n\\def\\bi#1{\\hbox{\\boldmath{$#1$}}}\n\\def\\sun{\\hbox{$\\odot$}}\n\n\\section{Introduction}\nCorrelations in dark matter contain a wealth of information \nabout cosmological parameters. Their power spectrum is sensitive\nto parameters such as matter density, Hubble constant, primordial \npower spectrum slope and amplitude, massive neutrinos, baryon \ndensity etc. Determining the linear power spectrum of dark matter \nis one of the \nmain goals of modern cosmology. There are several complications \nthat prevent us at present from reaching this goal. First, \non small scales the linear power spectrum is modified\nby nonlinear evolution which enhances its amplitude over the \nlinear spectrum. It is important to understand this process, so \nthat one can predict the relation between the two. \nThis is necessary both to reconstruct the linear spectrum from \na measured nonlinear one and to verify whether there are other\nmechanisms besides gravity that modify the clustering of dark matter \non small scales. \nExamples of such are baryonic feedback effects on dark matter \\cite{DS} or\nnongravitational interactions between dark matter \nparticles \\cite{SS99}. Second, it is difficult to observe correlations in \ndark matter directly. Direct tracers such as peculiar velocity flows\nor weak lensing still suffer from low statistics and poorly understood\nsystematics. Instead it is much easier to\nobserve correlations between galaxies \\cite{P97} or \ncorrelations between galaxies and dark matter \\cite{qsogal}.\nWhile these are related to the dark matter \ncorrelations, the relation may not be simple. The goal of this \npaper is to address both issues with \na model that is simple enough to allow analytic calculations without \nthe use of N-body simulations, yet sufficiently accurate\nto be useful for predicting galaxy and dark matter power spectrum.\n\nOur approach to dark matter clustering \nis based on the Press \\& Schechter model \\cite{PS74}. In \nthis picture at any given time \nall the matter in the universe is divided into virialized\nhalos. These halos are correlated and have some internal density \nprofile, which can be a function of halo mass. By specifying \nthe halo mass function, their clustering strength and their\nhalo profile we can determine the dark matter correlation function. \nThe formalism for correlations inside halos has been \ndeveloped by \\cite{MS} and applied to power law \nhalos \\cite{SJ}. We generalize this approach by including \nthe correlations between halos and by using more realistic \nnon-power law halo profiles whose shape may \ndepends on the halo mass \\cite{NFW}.\nWe show in this paper that such a generalized model can provide \nvery good agreement with results of numerical simulations over \na wide range of scales \\cite{ScoSh}.\n\nThe central question in extracting dark matter power spectrum from \nthat of the galaxies is how well galaxies trace dark matter, the \nissue of bias. \nThis has been addressed theoretically \nboth with hydrodynamic \\cite{bias} and semi-analytic methods \n\\cite{Benson,Kauffmann}. The fact that the galaxy correlation function is \na power law over several decades in scale, while power spectra in \nCDM models do not show such behaviour, already indicates that the bias is scale \ndependent. Moreover, galaxies come in different types and observational\ndata show that they can be biased relative to one another \\cite{biasobs}.\nIn our modelling of galaxy correlations we introduce two new functions, \nthe mean number and the mean pair weighted number \nof galaxies inside the halo as a function of the halo mass.\nThe importance of these has recently been emphasized in the \ncontext of pairwise velocity measurements \\cite{JingMoBo98,Benson99b} \nand galaxy clustering \\cite{Benson}. These play a key role in \nunderstanding the relation between galaxy and dark matter clustering.\nWe explore the predictions for different choices of these relations \nand compare them to the results of semi-analytic models. \n\nGalaxy-dark matter correlations can provide additional information \non the clustering of galaxies and dark matter and the relation between them. \nSuch correlations have been observed through gravitational lensing \neffects, for example using galaxy-galaxy lensing or \ncorrelations between foreground and background populations \\cite{qsogal}. \nSuch measurements are often interpreted either \nin terms of an averaged density profile of a halo \\cite{brainerd} \nor in terms of a constant bias model \\cite{waerbeke}. \nWe discuss the applicability of these models and how they can be \ngeneralized to take into account effects such as \nbroad range of halo masses and multiple galaxies inside halos. \n\n\\section{Dark matter power spectrum",
    "author": "Uro\\v s Seljak",
    "title": "Analytic model for galaxy and dark matter clustering"
}