{
    "address": "{Max-Planck-Institut f\\\"ur Str\\\"omungsforscung,} \\\\\n{37073 G\\\"ottingen, Germany }}%\n        \\,and\n        Holger Schanz$^{\\rm a,}$%\n        \\address{{Institut f\\\"ur Nichtlineare Dynamik, Georg-August-Universit\\\"at,} \\\\\n{37073 G\\\"ottingen, Germany }}%\n}\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n%\n% abstract   \n%\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n\\begin{abstract}\n\\hrule\n\\mbox{}\\\\[-0.2cm]\n\n\\noindent{\\bf Abstract}\\\\\nWe study the statistical properties of the\nscattering matrix associated with generic quantum graphs. The scattering\nmatrix is the quantum analogue of the classical evolution operator on the\ngraph. For the energy-averaged spectral form factor of the scattering matrix\nwe have recently derived an exact combinatorial expression. It is based on a\nsum over families of periodic orbits which so far could only be performed in\nspecial graphs. Here we present a simple algorithm implementing this summation\nfor any graph. Our results are in excellent agreement with direct numerical \nsimulations for various graphs. Moreover we extend our previous notion of an ensemble of\ngraphs by considering ensemble averages over random boundary conditions\nimposed at the vertices. We show numerically that the corresponding form\nfactor follows the predictions of random-matrix theory when the number of\nvertices is large---even when all bond lengths are degenerate. The\ncorresponding combinatorial sum has a structure similar to the one obtained\npreviously by performing an energy average under the assumption of\nincommensurate bond lengths.\n\\\\[0.2cm]\n{\\em PACS}: 05.45.Mt, 03.65.Sq\\\\[0.1cm]\n{\\em Keywords}: quantum chaos; random-matrix theory; periodic-orbit theory\\\\\n\\hrule\n\\end{abstract}\n\n\\maketitle\n\\newcommand{\\text}[1]{\\mbox{#1}}\n\\footnotetext[1]{To be published in Physica E, special\nissue ''Dynamics in Complex Systems''.}\n\\section{Introduction}\n%\nQuantum graphs have recently attracted a lot of interest\n\\cite{KS97,SS99,KS99,BG99,ACD+99,BK99,aloc,Tan00}. A review paper containing\na list of references to previous work can be found in \\cite{KS97}. The attention\nis due to the fact that quantum graphs can be viewed as typical and simple\nexamples for the large class of systems in which classically chaotic dynamics\nimplies universal spectral correlations in the semiclassical limit\n\\cite{BGS84,berry"
}