{
    "address": "$^{*}$Astronomical Institute, Utrecht University,\n         Postbus 80\\,000, 3508 TA Utrecht, Netherlands \\\\\n         $^{\\dagger}$Dublin Institute for Advanced Studies,\n         5 Merrion Square, Dublin 2, Ireland \\\\\n         $^{\\ddagger}$Max-Planck-Institut f\\\"{u}r Kernphysik,\n         Postfach 10\\,39\\,80, 69029 Heidelberg, Germany}\n\n\\maketitle\n\n\\begin{abstract}\nWe examine Fermi-type acceleration at relativistic shocks, and distinguish \nbetween the initial boost of the first shock crossing cycle, where the \nenergy gain per particle can be very large, and the Fermi process proper \nwith repeated shock crossings, in which the typical energy gain is of \norder unity. We calculate by means of numerical simulations the spectrum \nand angular distribution of particles accelerated by this Fermi process, \nin particular in the case where particle dynamics can be approximated as \nsmall-angle scattering. We show that synchrotron emission from electrons \nor positrons accelerated by this process can account remarkably well for \nthe observed power-law spectra of GRB afterglows and Crab-like supernova \nremnants. In the context of a decelerating relativistic fireball, we \ncalculate the maximum particle energy attainable by acceleration at the \nexternal blast wave, and discuss the minimum energy for this acceleration\nprocess and its consequences for the observed spectrum.\n\\end{abstract}\n\n\n\\section*{Introduction}\n\n   The spectrum of emission from GRB afterglows is well-accounted for by \nsynchrotron emission from electrons accelerated at a decelerating \nrelativistic blast wave.  The mechanism responsible for the \ngamma-ray-burst emission itself is less well-established, but\nit has been interpreted as synchrotron emission as \nwell, from electrons accelerated either at internal, mildly \nrelativistic shocks, or at the ultra-relativistic external shock as it \nruns into a clumpy medium.\n\n   In current models of afterglow emission, however (e.g.\\\n\\cite{gallant:SarPirNar98",
    "author": "Yves A. Gallant$^{*,\\dagger}$, Abraham Achterberg$^{*"
}