{
    "address": "IBM T.J. Watson Research Center, Yorktown Heights, NY 10598,\nsmolin@watson.ibm.com\n\\\\}\n\n\\date{January 1, 1900}\n\n\\maketitle\n\\begin{abstract}\nI present a four-party unlockable bound-entangled state, that is, a\nfour-party quantum state which cannot be written in a separable form\nand from which no pure entanglement can be distilled by local quantum\noperations and classical communication among the parties, and yet when\nany two of the parties come together in the same laboratory they can\nperform a measurement which enables the other two parties to create a\npure maximally entangled state between them without coming together.\nThis unlocking ability can be viewed in two ways, as either a\ndetermination of which Bell state is shared in the mixture, or as a\nkind of quantum teleportation with cancellation of Pauli operators.\n\\end{abstract}\n\\pacs{03.65.Bz,03.67.-a,03.67.Dd,03.67.Hk}\n\n% close bracket for pretty prl mode\n%]\n%\n%\\narrowtext\n\nThe study of entanglement, the so-called ``spooky action at a\ndistance'' of quantum particles whose joint states cannot be written\nin a product form \\cite{epr}, has been at the heart of quantum\ninformation theory, and seems to be crucial to an understanding of\nquantum computation, quantum cryptography and perhaps quantum\nmechanics itself.  It has been shown that in the case of mixed\nentangled states, it is often possible to distill some nearly pure\nentanglement using only local quantum operations and classical\ncommunications among the parties sharing the state\n\\cite{purification,bdsw}.  Recently, a new type of entangled mixed\nstate was discovered \\cite{horodecki,horodeckis} which has the\nproperty that, though definitely entangled, is not distillable.  Such\nstates are known as {\\em bound entangled} states.\n\nThe usual technique used in proofs about bound entanglement to show a\nstate is entangled is to observe that there are not enough product\nstates in its span for it to be decomposed in separable form:\n\\begin{equation} \n\\sum_i \\alpha_i \\proj{\\psi^1_i} \\otimes \\proj{\\psi^2_i}\\otimes \\proj{\\psi^3_i}\n\\otimes \\ldots \\proj{\\psi^N_i}\n\\label{separableform}\n\\end{equation}\nwhere there are tensor Hilbert spaces 1 through $N$ and the $\\alpha_i$'s \nare real numbers summing to 1.\n\nThis note will show a state is entangled by a different method, by\nshowing that when two parties of a four-party state come together,\nthey can by local quantum operations and classical communication\nenable the other two parties to have some pure entanglement (for a\ndiscussion of multiparty entanglement purification protocols see\n\\cite{mppvk,MS",
    "author": "John A. Smolin",
    "title": "A four-party unlockable bound-entangled state"
}